{
    "program_name": "B.Sc Computer Systems and Design",
    "year": "2020",
    "courses": [
        {
            "code": "21X101",
            "title": "CALCULUS AND ITS APPLICATIONS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "FUNCTIONS AND CONTINUITY:",
                    "content": "Functions - Periodic functions- Graphs of standard functions – Limits and continuity - Piecewise continuous functions – Differentiability – Fundamental theorem of Calculus(8+5)"
                },
                {
                    "title": "FUNCTIONS OF TWO VARIABLES:",
                    "content": "Partial derivatives - Geometrical interpretation - Saddle points - Taylor‟s series - Maxima and minima - Constrained maxima and minima - Lagrange multiplier method(6+4)"
                },
                {
                    "title": "INTEGRAL CALCULUS:",
                    "content": "Multiple integrals – Change of order of integration - Application of multiple integrals in finding area and volume - Beta and Gamma functions - Relation connecting Beta and Gamma functions - Evaluation of definite integrals (10+7)"
                },
                {
                    "title": "ORDINARY DIFFERENTIAL EQUATIONS:",
                    "content": "Linear Differential Equations of first order - Exact differential equations - Integrating factors - Linear Differential Equations of second order with constant coefficients - Method of variation of parameters – Modeling: \n                        Mass-spring systems, electrical circuits  \n                         (11+7)"
                },
                {
                    "title": "VECTOR CALCULUS:",
                    "content": "Vector differentiation - Gradient, Divergence, Curl and directional derivatives – Vector Integration - Line \n                        and surface integrals - Green‟s, Gauss divergence and Stoke‟s theorems (Statement only).                                    \n                        (10+7)"
                }
            ],
            "textbooks": [
                "1.\tErwin Kreyszig, “Advanced Engineering Mathematics”, John Wiley and Sons, 2015.",
                "2.\tGeorge B.Thomas, Maurice D.Weir and Joel R.Hass, “Thomas Calculus”, Pearson Education, 2018."
            ]
        },
        {
            "code": "21X102",
            "title": "COMBINATORICS",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION TO COMBINATORIAL PROBLEMS:",
                    "content": "Magic Square Problem – Four-Color Problem – Shortest-route problem – Perfect Covers of Chessboards(4)"
                },
                {
                    "title": "PERMUTATIONS AND COMBINATIONS:",
                    "content": "Sets and MultiSets - The Pigeonhole Principle – Simple and Strong Form - Generating Permutations - Inversions in Permutations - Generating Combinations - Generating r-Subsets. (9)"
                },
                {
                    "title": "BINOMIAL COEFFICIENTS:",
                    "content": "Pascal's Triangle - The Binomial Theorem - Unimodality of Binomial Coefficients - The Multinomial Theorem - Newton's Binomial Theorem (7)"
                },
                {
                    "title": "INCLUSION-EXCLUSION PRINCIPLE:",
                    "content": "The Inclusion-Exclusion Principle - Combinations with Repetition – Derangements - Permutations with Forbidden Positions - Mobius Inversion (8)"
                },
                {
                    "title": "RECURRENCE RELATIONS:",
                    "content": "Some Number Sequences - Generating Functions - Exponential Generating Functions -Solving Linear Homogeneous Recurrence Relations - Nonhomogeneous Recurrence Relations. (9)"
                },
                {
                    "title": "SPECIAL COUNTING SEQUENCES:",
                    "content": "Fibonacci Numbers - Catalan Numbers - Stirling Numbers - Partition Numbers.  (4)"
                },
                {
                    "title": "COMBINATORIAL DESIGNS:",
                    "content": "Modular Arithmetic – Block Designs – Steiner Triple systems – Latin Squares (4)"
                }
            ],
            "textbooks": [
                "1.\tRichard A Brualdi, “Introductory Combinatorics”, Pearson, 2019.",
                "2.\tAlan Tucker, “Applied Combinaorics”, Wiley, 2016."
            ]
        },
        {
            "code": "21X103",
            "title": "C PROGRAMMING",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "PROBLEM SOLVING:",
                    "content": "Introduction to Problem Solving- Program development- Analyzing and Defining the Problem- Modular Design – Algorithm - Flow Chart - What is a programming language-Types of programming language- Program Development Environment.                                                                                                           \n                        (5)"
                },
                {
                    "title": "C LANGUAGE:",
                    "content": "Introduction to C Language -  C character set - Identifiers and Keywords - Data Types - Constants - Variables - Arrays - Declarations - Expressions - Statements - Symbolic constants - Operators and  Expressions - Library Functions - Data Input and  Output Functions (7)"
                },
                {
                    "title": "CONTROL STATEMENTS:",
                    "content": "While Statement - Do While Statement – For Loop – Nested  Loop - If Else - Switch - Break - Continue - Comma Operator – Goto Statement  (6)"
                },
                {
                    "title": "FUNCTIONS:",
                    "content": "Defining Function - Accessing a Function - Passing Arguments to Functions - Specifying Arguments Data Types - Function Prototypes - Storage Classes - Auto - Static - Extern and Register Variables(8)"
                },
                {
                    "title": "ARRAYS:",
                    "content": "Defining Array – Processing array - Passing array to a function - Multi dimensional array - Array and strings (6)"
                },
                {
                    "title": "POINTERS:",
                    "content": "Declarations - Pointers to a function - Pointers and one dimensional arrays - Operating a pointer - Pointer and multi-dimensional arrays - arrays of pointers - passing functions to other functions. (10)"
                },
                {
                    "title": "STRUCTURES AND UNIONS:",
                    "content": "Definition of Structure and Union - Processing a structure – Bit field representations - Structures and pointers - Passing structure to functions - Self-referential structures – Nested structure. (7)"
                },
                {
                    "title": "FILES:",
                    "content": "File Structure concepts introduction -  Definitions, concept  of  record,  file  operations:  Storing,  creating,  retrieving,  updating Sequential, relative, indexed and random access mode, Files with binary mode(Low level), performance of Sequential Files  – Operations on Files – Types of Files, Various input and output functions on Files.  (7)"
                },
                {
                    "title": "ENUMERATED DATA TYPE :",
                    "content": "Typedef - Preprocessor Directives - Command Line Arguments.  (4)"
                }
            ],
            "textbooks": [
                "1.\tKernighan B. W. and Ritchie D. M., “C Programming Language (ANSI C)”, Prentice Hall, 2015.",
                "2.\tDeitel H. M. and Deitel P. J., “C How to Program”, Prentice Hall, 2015"
            ]
        },
        {
            "code": "21X104",
            "title": "ANALOG AND DIGITAL ELECTRONICS",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "ANALOG:",
                    "content": "Diode theory-forward and reverse-biased junctions- Transistor fundamentals, transistor configurations, characteristics & parameters - Transistor as Amplifier and as switch - Basic idea of an OP-AMP - Inverting and non-inverting inputs – Adder –Subtractor - Integrator - Differentiator. (9)"
                },
                {
                    "title": "NUMBER SYSTEMS AND CODES:",
                    "content": "Introduction to decimal, binary, octal, hexadecimal number systems – Inter conversions of Number Systems – Binary Codes: BCD, Excess -3, Gray, ASCII Codes– 2‟s complement addition, subtraction – BCD addition. (7)"
                },
                {
                    "title": "LOGIC GATES AND FAMILIES:",
                    "content": "AND, OR, NOT, NAND, NOR, Exclusive - OR and Exclusive - NOR- Implementations of Logic Functions using gates- NAND -NOR implementations. (6)"
                },
                {
                    "title": "BOOLEAN ARITHMETIC AND THEOREM:",
                    "content": "Boolean laws and theorems – Boolean expressions – Minimization - Sum of Products (SOP) -Product of Sums (POS) - Minterm - Maxterm - Canonical forms - Karnaugh map Minimization - two, three and four variable Karnaugh maps - Don't care conditions. (9)"
                },
                {
                    "title": "COMBINATIONAL AND SEQUENTIAL LOGIC CIRCUITS:",
                    "content": "Adders – Subtractors - Encoders – Decoders – Multiplexers - Demultiplexers - Flip-flops. (8)"
                },
                {
                    "title": "SHIFT REGISTERS AND COUNTERS:",
                    "content": "A Parallel/serial in/out shift registers – Counters: Definition – Types - Asynchronous Counters - Synchronous counters - Design of counters. (6)"
                }
            ],
            "textbooks": [
                "1.\t1.Morris Mano M., “Digital Design”, Prentice Hall of India Private Limited, 2012",
                "2.\tJohn M. Yarbrough, “Digital Logic Applications and Design”, Thomson- Vikas publishing house, 2015"
            ]
        },
        {
            "code": "21X105",
            "title": "ENGLISH",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "VOCABULARY BUILDING:",
                    "content": "The concept of Word Formation: Compounding, Backformation, Clipping, Blending - Root words from foreign languages and their use in English - Acquaintance with prefixes and suffixes from foreign languages in English to form derivatives - Synonyms, antonyms, and standard abbreviations: Acronyms. (5)"
                },
                {
                    "title": "GRAMMAR:",
                    "content": "Identifying Common Errors in English – Tenses – Modal auxiliary verbs - Subject-verb agreement - Noun-pronoun agreement - Articles – Prepositions – Word order - Different types of sentence: simple, compound, complex, Idioms and Phrases, Transformation of sentences: Active and Passive voice. (6)"
                },
                {
                    "title": "READING COMPREHENSION:",
                    "content": "Developing Reading Skills like Skimming and Scanning for information, Critical Reading, Inferential, Cognition, and analytical Skills- appropriate reading texts to be used from general, scientific, and literary genres.  (9)"
                },
                {
                    "title": "BASIC WRITING SKILLS:",
                    "content": "Importance of proper punctuation - Creating coherence: Arranging paragraphs & Sentences in logical order - Creating Cohesion: Organizing principles of paragraphs - Techniques for writing precisely - Nature and Style of sensible Writing: Describing, Defining, Classifying - Writing introduction and conclusion - Précis Writing - Essay Writing - Writing Letters: Formal, Informal - Writing E-mail. (9)"
                },
                {
                    "title": "LISTENING SKILLS:",
                    "content": "Adders – Subtractors - EncodeUnderstanding listening - Listening Techniques - Listening short comprehension passages - Conversational practice in both social and professional contexts. (6)"
                },
                {
                    "title": "PRACTICALS",
                    "content": "Oral presentation - Short speeches and conversation Practice  - Listening integrated tasks. (10)"
                }
            ],
            "textbooks": [
                "1. Shoba, K N & Lourdes Joavani Rayen. “Communicative English: a workbook”. New Delhi: Cambridge University Press, 2021"
            ]
        },
        {
            "code": "21X106",
            "title": "C PROGRAMMING LABORATORY",
            "credits": "0 0 4 2"
        },
        {
            "code": "21X107",
            "title": "WEB DESIGN LABORATROY",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "Exercises pertaining to the following concept s are to be implemented",
                    "content": "b\n                        1.\tHTML formatting for images, text including list and link  \n                        2.\tHTML table formatting \n                        3.\tMenu and frames  \n                        4.\tUser interface using forms with audio and video \n                        5.\tDynamic web page using internal/external CSS \n                        6.\tCSS involving text, colour properties in tables \n                        7.\tBootstrap commands \n                        8.\tIncluding internal/external JavaScript \n                        9.\tJavaScript control structures \n                        10.\tJavaScript functions \n                        11.\tA complete web site development"
                }
            ]
        },
        {
            "code": "21X108",
            "title": "ANALOG AND DIGITAL ELECTRONICS LABORATORY",
            "credits": "0 0 4 2"
        },
        {
            "code": "21X201",
            "title": "LINEAR ALGEBRA",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "Prerequisites:",
                    "content": ""
                },
                {
                    "title": "LINEAR SYSTEMS:",
                    "content": "System of linear equations - Consistent and inconsistent systems - Geometric interpretation of linear system in 2 and 3 unknowns - Row reduction and Echelon forms – Vector equation – Matrix equation Ax=b - LU decomposition - Applications of linear systems. (6+4)"
                },
                {
                    "title": "VECTOR SPACES:",
                    "content": "Euclidean n-space, General vector spaces, Subspaces, Linear independence, Basis and dimension, Row space, Column space and Null space, Rank and nullity – Change of basis – Similarity - Isomorphism. (10+7)"
                },
                {
                    "title": "LINEAR TRANSFORMATIONS:",
                    "content": "Introduction, Properties-Kernel and range, Linear Transformation from Rn to Rm, Matrices of linear transformations (9+5)"
                },
                {
                    "title": "INNER PRODUCT SPACES:",
                    "content": "Inner products, Length and Angle in inner product spaces - Orthonormal bases, Gram Schmidt process - Orthogonal matrices, QR decomposition - Best Approximation and Least-squares. (10+7)"
                },
                {
                    "title": "EIGEN VALUES AND EIGEN VECTORS:",
                    "content": "Eigen values and Eigen vectors - Diagonalization, Symmetric Matrices, Orthogonal Diagonalization – Singular Value Decomposition – Eigen values and linear transformations - Discrete Dynamical systems. (10+7)"
                }
            ],
            "textbooks": [
                "1.\tHoward Anton, “Elementary Linear Algebra”, John Wiley, 2017",
                "2.\tDavid C. Lay, “Linear Algebra and Its Applications”, Pearson Education, 2016."
            ]
        },
        {
            "code": "21X202",
            "title": "DISCRETE MATHEMATICS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "MATHEMATICAL LOGIC:",
                    "content": "Proposition logic - Logical operators - Laws of Logic – Tautologies – Equivalences – Tautological implications – Rules of inference - Validity of arguments – Consistency of specifications – Predicate logic – Quantifiers and universe of discourse. (10+7)"
                },
                {
                    "title": "RELATIONS AND FUNCTIONS:",
                    "content": "Relations – Binary relation – Properties – Representations – Closures of Relations – Composition of Relations – Equivalence Relations – Partitions – Partial Orderings – Covering of Sets – Hasse Diagrams – n-ary Relations and their Applications. Functions - Injective, Surjective, Bijective functions, Composition, Identity and Inverse. (10+7)"
                },
                {
                    "title": "ALGEBRAIC STRUCTURES:",
                    "content": "Groups – properties of Groups, Subgroups –Definition, Cosets and Lagrange‟s theorem, Homomorphism, Isomorphism, Automorphism - Cayley‟s theorem-Normal subgroups-Factor group-Fundamental theorem of group homomorphism.(10+7)"
                },
                {
                    "title": "CODING THEORY:",
                    "content": "Coding of Binary information and Error detection – Group codes – Decoding and Error correction.  (6+4)"
                },
                {
                    "title": "GRAPH THEORY:",
                    "content": "Basic concepts – degree sequence - Matrix representation of graphs - connectedness – Euler and Hamilton graphs – Graph isomorphism. Tree–Spanning tree–matrix tree theorem-Dijkstra‟s algorithm. (9+5)"
                }
            ],
            "textbooks": [
                "1.\tKenneth H Rosen, “Discrete Mathematics and its Applications”, 8th Edition, McGraw Hill, 2019.",
                "2.\tTremblay J P and Manohar R, “Discrete Mathematical Structures with Applications to Computer Science\", Tata McGraw Hill, 2014.",
                "3.\tJoseph A. Gallian, “Contemporary Abstract Algebra”, 9th Edition, Cengage Learning, 2016"
            ]
        },
        {
            "code": "21X203",
            "title": "COMPUTER ARCHITECTURE",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Elements of a Computer system – Jon Von Newmann Architecture, Harvard Architecture - RTL. (3)"
                },
                {
                    "title": "ALU DESIGN:",
                    "content": "Arithmetic micro operations – Logic micro operations – Shift micro operations – Arithmetic, logic, shift units. (5)"
                },
                {
                    "title": "CONTROL UNIT:",
                    "content": "Computer Instructions - Instruction codes- Instruction Cycle –Timing & Control – Types of  Instructions – Memory Reference, Register Reference , Input & Output,  Interrupt Instructions. (9)"
                },
                {
                    "title": "CPU DESIGN:",
                    "content": "General Register organization–Stack Organization–Instruction formats–Addressing modes. (6)"
                },
                {
                    "title": "INPUT OUTPUT ORGANIZATION:",
                    "content": "I/O devices and interface – Asynchronous data transfer- Modes of data transfer- Direct Memory Access (DMA) – I/O processor. (7)"
                },
                {
                    "title": "MEMORY ORGANIZATION:",
                    "content": "Memory hierarchy – Main memory – Auxiliary memory – Associative memory – Cache memory -  Virtual memory. (8)"
                },
                {
                    "title": "MULTIPROCESSOR:",
                    "content": "Characteristics – Interconnection structures –Parallel Processing-Pipelining. (7)"
                }
            ],
            "textbooks": [
                "1.\tMorris Mano, “Computer Systems Architecture”, Prentice Hall, 2017.",
                "2.\tWilliam Stallings, “Computer Organization & Architecture Designing for Performance”, Pearson Education, 2019."
            ]
        },
        {
            "code": "21X204",
            "title": "DATA STRUCTURES",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Data structures - Abstract data Types - Primitive data structures – Asymptotic Notations – Best and Worst case complexities (7)"
                },
                {
                    "title": "ARRAYS:",
                    "content": "Operations - one, two, and multi- dimension arrays – Sparse matrices – Applications. (3)"
                },
                {
                    "title": "STACKS:",
                    "content": "Primitive operations - sequential implementation - Applications: Function  handling - Recursion – Expression  Processing, Parentheses matching. (4)"
                },
                {
                    "title": "QUEUES:",
                    "content": "Primitive operations - sequential implementation - Priority Queues - Dequeue - Applications. (5)"
                },
                {
                    "title": "LISTS:",
                    "content": "Primitive Operations - Singly linked lists, doubly linked lists, Circular lists, Multiply linked lists - Applications: Addition of Polynomials – Linked Stacks -   Linked queues - Linked Priority queues - Dynamic Storage Management. (9)"
                },
                {
                    "title": "TREES:",
                    "content": "Terminologies - implementation - BINARY TREE: Properties - sequential and linked representation - binary tree operations - traversals - Expression trees - Infix, Postfix and Prefix expressions - Threaded trees - Tournament trees. (8)"
                },
                {
                    "title": "HASH TABLE:",
                    "content": "Introduction – Operations – Implementation – Hash Function -– successful and unsuccessful search - Collision Resolution handling. (4)"
                },
                {
                    "title": "SORTING AND SEARCHING:",
                    "content": "Insertion sort, Bubble sort, Selection sort, Radix sort – time complexity and analysis - linear search – Binary search. (5)"
                }
            ],
            "textbooks": [
                "1.\tMichael T. Goodrich, Roberto Tamassia, and David M. Mount, “Data Structures and Algorithms in C++”, Wiley, 2017",
                "2.\tSahni Sartaj, \"Data Structures, Algorithms and Applications in C++\", Silicon Press, 2011"
            ]
        },
        {
            "code": "21X205",
            "title": "OBJECT ORIENTED PROGRAMMING WITH C++",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "PRINCIPLES OF OBJECT ORIENTED PROGRAMMING:",
                    "content": "Software  crisis - Software Evolution - Procedure Oriented Programming - Object Oriented Programming Paradigm -  Basic  Concepts and Benefits of OOP - Object Oriented  Programming Language  -  Application of  OOP -  Structure   of   C++   - Tokens, Expressions and  Control  Structures  - Operators in C++ - Manipulators (6)"
                },
                {
                    "title": "FUNCTIONS IN C++:",
                    "content": "Function Prototyping - Call by Reference - Return by reference - Inline functions - Default, Const Arguments - Function overloading  -  Classes  and  Objects - Member  functions -  Nesting  of  member  functions  - Private member functions -  Memory  allocation  for  Objects - Static data members - Static Member Functions - Array of objects - Objects as Function Arguments -  Friend Functions - Returning Objects - Const Member functions - Pointers to Members. (10)"
                },
                {
                    "title": "CONSTRUCTORS:",
                    "content": "Parameterized Constructors - Multiple Constructors in a Class - Constructors with Default Arguments - Dynamic Initialization of Objects - Copy and Dynamic Constructors – Constructor overloading - Destructors.  (3)"
                },
                {
                    "title": "OPERATOR OVERLOADING:",
                    "content": "Overloading Unary and Binary Operators - Overloading Binary Operators using Friend functions –\tOperator Type conversion. (3)"
                },
                {
                    "title": "INHERITANCE:",
                    "content": "Defining Derived Classes - Single Inheritance - Making a Private Member Inheritable - Multiple Inheritance - Hierarchical Inheritance - Hybrid Inheritance – Function overriding – Virtual functions - Virtual Base Classes - Abstract Classes - Constructors in Derived Classes - Nesting of Classes – Composition – Aggregation (9)"
                },
                {
                    "title": "POLYMORPHISM:",
                    "content": "Basics of polymorphism – Types of polymorphism - Compile and Run time polymorphism - Virtual functions  –\tObject Slicing – Virtual destructor – Dynamic binding. (5)"
                },
                {
                    "title": "TEMPLATES & EXCEPTION HANDLING:",
                    "content": "Introduction to Templates, Generic Functions and Generic Classes – Exception Handling – Examples. (4)"
                },
                {
                    "title": "STREAMS:",
                    "content": "String I/O -Character I/O - Object I/O - I/O with multiple Objects - File pointers - Disk I/O with member functions. (5)"
                }
            ],
            "textbooks": [
                "1.\tBjarne Stroustrup, “The C++ Programming Language”, Pearson Education, 2014.",
                "2.\tStanley B. Lippman, Josee Lajoie and Barbara E. Moo, “The C++ Primer”, Addison Wesley, 2013."
            ]
        },
        {
            "code": "21X206",
            "title": "PYTHON PROGRAMMING LABORATORY",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Development Tools (IDE) – Python shell - Python Basics – Data types - Control flow."
                },
                {
                    "title": "CORE PYTHON LANGUAGE:",
                    "content": "Lists - Tuples - Dictionaries - Strings – Regular expressions - Functions - File input/output – Exception hand ling."
                },
                {
                    "title": "OBJECT-ORIENTED DESIGN:",
                    "content": "Inheritance – Polymorphism."
                },
                {
                    "title": "PACKAGING AND DISTRIBUTION:",
                    "content": "Modules – Packages – Python standard libraries - pip."
                },
                {
                    "title": "STANDARD PACKAGES:",
                    "content": ": NumPy – Matplotlib – SciPy – SymPy – Pandas"
                },
                {
                    "title": "EXERCISES:",
                    "content": "1.\tTest basic coding skills in Python using data types, control statements and iteration. \n                            2.\tImplement Python data structures like lists, tuples, dictionaries, and sets.  \n                            3.\tGeneral programming concepts such as functions, strings, regular expressions, reading / writing files and exceptions.      \n                            4.\tImplement object oriented concepts.  \n                            5.\tPackaging programs into reusable libraries.   \n                            6.\tUse libraries for numerical programming and data visualization.  \n                            7.\tUse libraries to perform the following:  \n                            a)\tPlot 2D and 3D functions.  \n                            b)\tPrograms on differentiation and integration.  \n                            c)\tSolving system of Linear equations.  \n                            d)\tDetermination of Vector space under given operations.  \n                            e)\tDetermination of linear independence and basis.  \n                            f)\tFinding Row space, Column space and null space.  \n                            g)\tPrograms for Linear transforms on R2 .  \n                            h)\tCovert a standard basis into an orthonormal basis.  \n                            i)\tCompute Eigen values and Eigen bases for a given system.  \n                            j)\tApply the orthogonal Diagonalization technique to reducing a Quadratic form."
                }
            ],
            "textbooks": [
                "1.\tMark Lutz, “Learning Python”, O‟Reilly Media, 2013.",
                "2.\tTony Gaddis, “Starting out with Python”, Pearson, 2017."
            ]
        },
        {
            "code": "21X207",
            "title": "DATA STRUCTURES LABORATORY",
            "credits": "0 0 4 2"
        },
        {
            "code": "21X208",
            "title": "OBJECT ORIENTED PROGRAMMING WITH C++ LABORATORY",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "Exercises pertaining to the following outlines are to be experimented using C++:",
                    "content": "1.\tCreating and processing array of objects of a class. \n                        2.\tUsage of static member to count the number of instances of a class. \n                        3.\tIllustration of the need of default arguments and function overloading. \n                        4.\tCreation of a class having read-only member function and processing the objects of that class.  \n                        5.\tInitializing the object of a class using constructor and destroying the same using destructor. \n                        6.\tIllustration of a data structure using dynamic objects. \n                        7.\tUsage of a function to perform the same operation on more than one data type. \n                        8.\tCreation of a class with generic data member. \n                        9.\tOverloading the operators to do arithmetic operations on objects. \n                        10.\tOverloading stream operators and creation of user-defined manipulators. \n                        11.\tAcquisition of the features of an existing class and creation of a new class with added features in it. \n                        12.\tImplementation of run time polymorphism. \n                        13.\tImplementation of derived class which has direct access to both its own and public members of the base class. \n                        14.\tImplementation of streams to store and maintain Library system, with the features of Book Issue and Book Return."
                }
            ]
        },
        {
            "code": "21X301",
            "title": "PROBABILITY AND STATISTICS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "PROBABILITY BASIC CONCEPTS:",
                    "content": "Introduction - Sample space and events - Axiomatic approach to probability – Basic theorems. Conditional Probability - Law of multiplication - Law of total probability and Bayes‟ Theorem - Independence. (8+5)"
                },
                {
                    "title": "RANDOM VARIABLES:",
                    "content": "Discrete and continuous random variables - probability mass function and density function - distribution function - Expectation and variance. Discrete distributions: Binomial, Poisson and Geometric - Continuous distributions: Uniform, Normal, Exponential and Weibull. (9+7)"
                },
                {
                    "title": "JOINT PROBABILITY DISTRIBUTIONS:",
                    "content": "Marginal and conditional distributions - statistical independence, Conditional expectation – Moments and moment generating functions. (5+3)"
                },
                {
                    "title": "STATISTICAL INFERENCE:",
                    "content": "Sampling distribution - Estimation:  Point estimation, interval estimation - Criteria of a good estimator –Interval estimation of mean, proportion, and variance (single sample and two samples) - Maximum likelihood estimator. Hypothesis Testing: General concepts - Errors in Hypothesis testing - One-and two-tailed tests - Tests concerning mean, proportion, and variance - Tests for Goodness of fit and independence of attributes (12+8)"
                },
                {
                    "title": "CORRELATION AND REGRESSION:",
                    "content": "introduction - Estimation using the regression line - Correlation analysis -Limitations, errors, and caveats of using regression and correlation analyses - Multiple regression analysis. (7+5)"
                },
                {
                    "title": "ANALYSIS OF VARIANCE:",
                    "content": "Introduction to design of experiments, Analysis of variance - Completely Randomized Design and Randomized Block Design. (4+2)"
                }
            ],
            "textbooks": [
                "1.\tSaeed Ghahramani, “Fundamentals of Probability with Stochastic Processes”, Pearson Education, 2018.",
                "2.\tJay L. Devore, “Probability and Statistics for Engineering and Sciences”, Cengage Learning, 2015.",
                "3.\tRichard I. Levin, David S. Rubin, “Statistics for Management”, Pearson Education, 2013"
            ]
        },
        {
            "code": "21X302",
            "title": "DATABASE MANAGEMENT SYSTEMS",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "BASIC CONCEPTS",
                    "content": "Introduction to databases – Conventional file processing – Purpose of database system – Characteristics of database approach – Advantages of using DBMS – Database concept and architecture – Data Abstraction – Data Models – Instances and Schema – Data Independence – Schema Architecture – Components of a DBMS – Database Languages – Database Manager – Database Administrator – Database Users. (6)"
                },
                {
                    "title": "DATA MODELING:",
                    "content": "Introduction – Data associations – Entities, attributes, relationships – Constraints  - Design of Entity Relationship data models (ERD) – Generalization – Aggregation – Conversion of ERD into tables –  Introduction to Network data model and Hierarchical data model. (7)"
                },
                {
                    "title": "FILE ORGANIZATION:",
                    "content": ": Storage device characteristics – Constituents of a file – Operations on file – Serial files – Sequential files – Index sequential files – Direct files – Binary and Secondary Key Retrieval – Indexing using Tree Structures. (6)"
                },
                {
                    "title": "RELATIONAL MODEL:",
                    "content": "Introduction to Relational Data Model – Basic concepts – Enforcing data Integrity constraints – Relational Algebra Operations – Extended Relational Algebra Operations. (5)"
                },
                {
                    "title": "RELATIONAL DATABASE MANIPULATION:",
                    "content": "Introduction to Structured Query Language (SQL) – SQL Commands for defining Database, Constructing database, Manipulations on database – Basic data retrieval operations – Advanced Queries in SQL – \n                        Functions in SQL – Aggregation – Categorization – Updates in SQL – Views in SQL – embedded SQL – Introduction to NoSQL Databases. (6)"
                },
                {
                    "title": "DATABASE DESIGN THEORY:",
                    "content": "Data base design process – Relational Database Design – Relation Schema – Anomalies in a database – Functional dependencies – Axioms – closure of a set of FD's - minimal covers - Normal forms based on primary keys – Second Normal form, Third Normal form, Boyce–Codd Normal form – Properties of relational decomposition - Multivalued dependencies  – Fourth Normal form – Practical database design tuning. (9)"
                },
                {
                    "title": "DATABASE SECURITY, INTEGRITY CONTROL:",
                    "content": "Security and Integrity threats – Defense mechanisms – Transaction and concurrency control mechanisms- ACID properties, Serializability and concurrency control, Lock based concurrency control (2PL, Deadlocks), Time stamping methods, optimistic methods, Database recovery management. (6)"
                }
            ],
            "textbooks": [
                "1.\tSilberschatz A., Korth H. and Sudarshan S., “Database System Concepts”, Tata McGraw Hill, 2011.",
                "2.\tElmasri R. and Navathe S.B., “Fundamentals of Database Systems”, Pearson Education, 2017."
            ]
        },
        {
            "code": "21X303",
            "title": "MICROPROCESSORS AND MICROCONTROLLER",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO MICROPROCESSORS:",
                    "content": "Introduction to Microprocessors – Architecture of 8086 – Memory address space and Data organization - Generating memory address - Addressing modes – Bus cycles and timing diagram. (7)"
                },
                {
                    "title": "ASSEMBLY LANGUAGE PROGRAMMING:",
                    "content": "Instruction Set Architecture (ISA) -Instruction format -  8086 Arithmetic and Logic Instructions – Control flow instructions and program structures - Array processing- String processing - Assembler directives - Procedures and Macros. (10)"
                },
                {
                    "title": "INTERRUPT SYSTEMS:",
                    "content": "Introduction - Types of interrupts – Priorities of interrupt – Interrupt Instructions in 8086 - Implementing Interrupt schemes in 8086 processors – 8259 Programmable Interrupt Controller.  (8)"
                },
                {
                    "title": "INTERFACING CONCEPTS:",
                    "content": "I/O Interfacing concepts - Interfacing I/O devices–   8255 Programmable Peripheral Interface DMA – 8237 DMA Controller – Timer (6)"
                },
                {
                    "title": "MICROCONTROLLER ARCHITECTURE:",
                    "content": "Introduction- Architecture of 8051 – Special Function Registers (SFRs) - I/O pins ports and circuits – Instruction Set-Addressing modes – Assembly Language Programming. (7)"
                },
                {
                    "title": "INTERFACING MICROCONTROLLER:",
                    "content": "Programming 8051 timers - Serial port programming –Interrupts programming – LCD and keyboard interfacing – ADC, DAC & Sensor interfacing – External Memory interface (7)"
                }
            ],
            "textbooks": [
                "1.\tWalter A. Triebel, Avtar Sing, “8088 and 8086 Microprocessors Programming”, Pearson Education, 2017",
                "2.\tWalter A. Triebel, Kenneth J Ayala, “The 8088 and 8086 Microprocessors Programming, Interfacing, Software, Hardware and Applications”, Pearson Education, 2018.",
                "3.\tMohamed Ali Mazidi, Janice Gillispie Mazidi, Rolin McKinlay, “The 8051 Microcontroller and Embedded Systems: Using Assembly and C”, Pearson Education, 2017."
            ]
        },
        {
            "code": "21X304",
            "title": "OPERATING SYSTEMS",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Abstract view of an operating system - Operating Systems Objectives and Functions – Evolution of Operating Systems - Dual-mode operation - System calls- Structure of Operating System. (3)"
                },
                {
                    "title": "PROCESS DESCRIPTION AND CONTROL:",
                    "content": "Process concepts - Process Creation – Process Termination - Process states - Process Description – Process Control. (4)"
                },
                {
                    "title": "PROCESS AND THREADS:",
                    "content": "Relationship between process and threads – Thread States – Thread Synchronization – Types of Thread – Multithreading model. (3)"
                },
                {
                    "title": "PROCESS SCHEDULING:",
                    "content": "Scheduling basics - CPU-I/O interleaving- (non-)preemption - context switching- Types of Scheduling – Scheduling Criteria - Scheduling Algorithms – Algorithm evaluation – Real-time scheduling. (5)"
                },
                {
                    "title": "PROCESS SYNCHRONIZATION:",
                    "content": "Concurrent Process – Principles of Concurrency – Race Condition - Mutual Exclusion – Critical section problems – Software support – Hardware Support – Operating System Support: Semaphore, Monitor – Classical problems of synchronization – Synchronization examples. (7)"
                },
                {
                    "title": "DEADLOCK:",
                    "content": "Principles- Characterization – Methods for handling deadlock - Deadlock prevention, Avoidance, Detection, and recovery. (2)"
                },
                {
                    "title": "MEMORY MANAGEMENT:",
                    "content": "Memory hierarchy –Memory Management requirements - Memory partitioning: Fixed partitioning, Dynamic partitioning, Buddy systems – Simple paging – Page table structures – Simple Segmentation – segmentation and paging. (7)"
                },
                {
                    "title": "VIRTUAL MEMORY MANAGEMENT:",
                    "content": "Need for Virtual Memory management – Demand Paging –Copy on write -Page Fault handling - Page replacement - Frame allocation- Thrashing - working set model. (3)"
                },
                {
                    "title": "I/O MANAGEMENT AND DISK SCHEDULING:",
                    "content": "Organization of I/O function – Evolution of I/O function – Types of I/O devices – Logical Structure of I/O functions – I/O Buffering – Disk I/O – Disk Scheduling algorithms – RAID - Disk Cache. (5)"
                },
                {
                    "title": "FILE SYSTEM MANAGEMENT:",
                    "content": "Files – Access methods - File system architecture – Functions of file management –Directory and disk structure -Mounting - File sharing –File system implementation – Directory implementation - File Allocation – Free space management. (6)"
                }
            ],
            "textbooks": [
                "1.\tSilberschatz A, Galvin, PB. and Gagne, G. “Operating System Concepts Essentials”, John Wiley,2018",
                "2.\tWilliam Stallings, “Operating Systems”, Pearson Education, 2017.",
                "3.\tAndrew S Tanenbaum, \"Modern Operating System\", Prentice Hall, 2018."
            ]
        },
        {
            "code": "21X305",
            "title": "ADVANCED DATA STRUCTURES AND ALGORITHMS ANALYSIS",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Algorithm – analysis of algorithms – best case and worst case complexities, asymptotic notations - analysis of some algorithms using simple data structures – amortized analysis - Master‟s theorem  (5)"
                },
                {
                    "title": "SORTING:",
                    "content": "Quick sort – Merge sort – time complexity and analysis. (5)"
                },
                {
                    "title": "HEAPS:",
                    "content": "Max heap - Min heap - Insertion and deletion of elements - Build-heap – Applications: Huffman codes - Priority Queue – Heap sort.  (6)"
                },
                {
                    "title": "BINARY SEARCH TREES:",
                    "content": "Searching – Insertion and deletion of elements – Analysis. (6)"
                },
                {
                    "title": "AVL TREES:",
                    "content": "Definition – Height – searching – insertion and deletion of elements, AVL rotations  (6)"
                },
                {
                    "title": "MULTIWAY SEARCH TREES:",
                    "content": "Indexed Sequential Access – m-way search tree - B-Tree – searching, insertion and deletion  - B+ tree - searching, insertion and deletion - Tries  (7)"
                },
                {
                    "title": "GRAPHS:",
                    "content": "Introduction – Representations - Depth First Search – Breadth First Search – Minimum cost spanning tree Kruskal‟s and prim‟s algorithms - Topological sorting – Dijkstra‟s algorithm  (10)"
                }
            ],
            "textbooks": [
                "1.\tThomas H. Cormen, Charles E. Leiserson and Ronald L. Rivest, “Introduction to Algorithms”, Prentice Hall, 2009.",
                "2.\tSahni Sartaj, “Data Structures, Algorithms and Application in C++”, Silicon Press, 2013."
            ]
        },
        {
            "code": "21X306",
            "title": "DATABASE MANAGEMENT SYSTEMS LABORATORY",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "SQL – ORACLE, SQL SERVER",
                    "content": "1.\tWorking with DDL and DML commands of SQL for creation and manipulation of single, multiple tables. \n                            2.\tWorking with PL/SQL, Triggers and stored procedures. \n                            3.\tEmbedded SQL \n                            4.\tDeveloping a Package using a database."
                }
            ]
        },
        {
            "code": "21X307",
            "title": "OPERATING SYSTEMS LABORATORY (Linux)",
            "credits": "0 0 4 2"
        },
        {
            "code": "21X308",
            "title": "ADVANCED DATA STRUCTURES AND ALGORITHMS ANALYSIS LABORATORY",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "Implementation of the following problems:",
                    "content": "1.\tSorting and Searching. \n                        2.\tBinary Search Tree – Insertion and Deletion 3. Demonstration of AVL rotations. \n                        4.\tB tree, B+ tree, Trie. \n                        5.\tGraphs – DFS & BFS \n                        6.\tImplementation of Topological sort, Minimum cost spanning tree. \n                        7.\tDijkstra‟s algorithm"
                }
            ]
        },
        {
            "code": "21X401",
            "title": "COMPUTER NETWORKS",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Network goals - Applications of Networks - Design issues for the layers - OSI Reference Model - Types of Network - Network Topologies - Network Performance Measures: Bit Rate, Baud Rate – Band width. (8)"
                },
                {
                    "title": "PHYSICAL LAYER:",
                    "content": "Transmission media- SWITCHING: Circuit switching - Packet switching. (6)"
                },
                {
                    "title": "ERROR DETECTION AND CORRECTION :",
                    "content": "Transmission Impairments -  Types of Errors – Single bit – Multiple bit – Burst Error – Detection – Vertical redundancy Check – Longitudinal Redundancy Check – Cyclic redundancy Check – Error Correction – Single bit Error Correction – Hamming Code.  (8)"
                },
                {
                    "title": "DATA LINK CONTROL AND PROTOCOLS:",
                    "content": "Line Discipline – Flow Control – Error control - Stop and Wait - Sliding Window Protocols- Random access protocols - Ethernet – IEEE 802.3. Internetworking devices: Repeaters – Hubs - Bridge- Switches – Routers. (10)"
                },
                {
                    "title": "TCP/IP:",
                    "content": "TCP/IP Protocol Structure - Internet Protocol – IP addressing and Sub netting – IP datagram – Routing –Distance vector routing - Link state Routing – TCP – UDP.  (8)"
                },
                {
                    "title": "APPLICATIONS:",
                    "content": "SMTP, DNS, HTTP. (5)"
                }
            ],
            "textbooks": [
                "1.\tBehrouz A Forouzan, “Data Communication and Networking”, Tata McGraw Hill, 2017.",
                "2.\tBehrouz A Forouzan, “TCP / IP Protocol Suite”, Tata McGraw Hill, 2017."
            ]
        },
        {
            "code": "21X402",
            "title": "JAVA PROGRAMMING",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "JAVA PROGRAMMING:",
                    "content": "Introduction - Data Types -  Operators -  Declarations - Control Structures - Enhanced for Loop - Arrays and Strings -  Fundamentals - Methods - Constructors - Scope rules - this keyword- Composing Classes–Inheritance - Reusability -  Polymorphism - Abstract classes.  (8)"
                },
                {
                    "title": "INTERFACES AND PACKAGES:",
                    "content": "Interface - Defining and Implementing Interface - Applying Interface - Packages - Access protection - Importing packages. (8)"
                },
                {
                    "title": "EXCEPTION HANDLING:",
                    "content": "Exception types - Uncaught Exception - Using Try and Catch - Multiple catch clauses - Nested try statements - Throw - Throws - Java Built-in Exception – Custom exception. (5)"
                },
                {
                    "title": "MULTI THREADED PROGRAMMING:",
                    "content": "Java thread model - Priorities - Synchronization - Messaging - Thread class and runnable Interface -  Main thread – Creating threads - Synchronization – Interthread Communication - Deadlock. (8)"
                },
                {
                    "title": "GUI PROGRAMMING:",
                    "content": "Applets - GUI Components - Event handling – Swing. (6)"
                },
                {
                    "title": "I/O AND JAVA COLLECTION API:",
                    "content": "I/O basics - Stream Classes -   File  I/O – Lambda Expressions – Collection     Framework - Manipulating group of objects -  Generic classes – List – Set – Queue – ArrayList - Map. (6)"
                },
                {
                    "title": "JDBC:",
                    "content": "Establishing a Connection - Manipulating Data - Error Handling - Closing a Connection. (4)"
                }
            ],
            "textbooks": [
                "1.\tHerbert Schildt, \"JAVA - The Complete Reference\", Tata McGraw Hill, 2019.",
                "2.\tCay S Horstmann, “Core Java Volume1 - Fundamentals”, Pearson Education, 2020."
            ]
        },
        {
            "code": "21X403",
            "title": "SOFTWARE ENGINEERING",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Nature of a software –Software Engineering -Objectives & Benefits of Software Engineering – Management Spectrum-People involved in the systems development -Quality attributes of a software product. (4)"
                },
                {
                    "title": "SOFTWARE PROCESS :",
                    "content": "Software Process Structure– Generic Process Model – Prescriptive Process Model – Specialized Process Model – Unified Process Model – Agile Development – Agile Process – Extreme programming-Agile process models. (6)"
                },
                {
                    "title": "SOFTWARE PLANNING:",
                    "content": "Software Project Estimation - Decomposition Techniques –Empirical Estimation model - COCOMO & PUTNAM models. (5)"
                },
                {
                    "title": "REQUIREMENTS ENGINEERING:",
                    "content": "Requirements Engineering –Establishing the Ground Work– Eliciting Requirements – Building the Analysis Model-Negotiating Requirements. (5)"
                },
                {
                    "title": "REQUIREMENT MODELING:",
                    "content": "Scenario Based Modeling-UML model that supplements the use case - Class Based Modeling – Creating a Behavioral Modeling – State Chart Diagrams – Package Diagrams – Component Diagrams – Deployment Diagrams. (8)"
                },
                {
                    "title": "DESIGN ENGINEERING:",
                    "content": "Design Process & Design Quality – Design Concepts – The Design Model: Architectural Design– User Interface Design – Component level Design – Pattern Based Design. (6)"
                },
                {
                    "title": "SOFTWARE TESTING & IMPLEMENTATION:",
                    "content": "Testing Strategies – Testing Tactics – Testing Methodologies and Debugging Methods – Quality Concepts: Software quality- The Cost of Quality-Software Quality Factors - Quality Assurance versus Quality Control Reviews Techniques. (7)"
                },
                {
                    "title": "CASE STUDIES:",
                    "content": "Project Scheduling and Tracking – Agile Framework-User story Scrum board, Sprint planning, Tools for Agile project management- JIRA ,Kanban. (4)"
                }
            ],
            "textbooks": [
                "1. Pressman R S, “Software Engineering – A Practitioner‟s Approach”, Tata McGraw Hill, 2019."
            ]
        },
        {
            "code": "21X404",
            "title": "PRINCIPLES OF COMPILER DESIGN",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "SYSTEMS PROGRAMMING:",
                    "content": "Need and working of Assemblers, Macro processors, Linkers, Loaders, Interpreters and Compilers. (6)"
                },
                {
                    "title": "LEXICAL ANALYSIS:",
                    "content": "Role of a Lexical Analyzer – Deterministic Finite Automata and Nondeterministic Finite Automata - Regular Expressions to Nondeterministic Finite Automata – Regular expressions to Deterministic Finite Automata – Nondeterministic Finite Automata to Deterministic Finite Automata - Minimizing  the number of states of Deterministic Finite Automata – Implementation of a lexical analyzer. (10)"
                },
                {
                    "title": "SYNTAX ANALYSIS :",
                    "content": "Context free grammars – Derivations and Reductions - Parse trees – Ambiguity – Capabilities of context  free grammars. Top down and bottom up parsing – Shift reduce parsing – Operator precedence parsing – Recursive descent parsing -Predictive parsing – Construction of Predictive parsing table - LR parsing – Construction of Simple LR parsing tables – Construction of Canonical LR parsing tables. (14)"
                },
                {
                    "title": "SYNTAX DIRECTED TRANSLATION AND INTERMEDIATE CODE GENERATION :",
                    "content": "Semantic actions – Implementations of syntax directed translators – Intermediate code formats : Postfix notation, Quadruples, Triples , Indirect triples –Methods of translation of assignment statements, Boolean expressions and control statements - Representing information in a symbol table. (10)"
                },
                {
                    "title": "CODE OPTIMIZATION AND CODE GENERATION :",
                    "content": "Introduction to code optimization – Basic blocks – Loop optimization techniques - DAG representation – Error detection and recovery – A simple code generator. (5)"
                }
            ],
            "textbooks": [
                "1.\tJohn J. Donovan, “Systems Programming”, Tata McGraw Hill, 2012.",
                "2.\tAlfred V.Aho, Monica S.Lam, Ravisethi and Jeffrey D Ullman, “Compilers : Principles, Techniques and Tools”, Pearson Education, 2013"
            ]
        },
        {
            "code": "21X405",
            "title": "OPTIMIZATION TECHNIQUES",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "LINEAR PROGRAMMING:",
                    "content": "Introduction to Operations Research – Modeling with linear programming - Graphical method for two dimensional problems – Simplex Algorithm – Two Phase Simplex Method – Special cases of Simplex Method – Sensitivity analysis - Revised Simplex Method. (14)"
                },
                {
                    "title": "SIMPLEX MULTIPLIERS :",
                    "content": "Dual and Primal – Dual Simplex Method– Transportation problem and its solution – Assignment problem and its solution by Hungarian method. (10)"
                },
                {
                    "title": "DECISION THEORY:",
                    "content": "Decision  Analysis – Decision making under certainty, uncertainty and risk. (6)"
                },
                {
                    "title": "NON LINEAR PROGRAMMING (UNCONSTRAINED OPTIMIZATION):",
                    "content": "Introduction – Random search method – Univariate method Gradient of a function – steepest descent method – Conjugate gradient method. (5)"
                },
                {
                    "title": "DYNAMIC PROGRAMMING:",
                    "content": "Introduction – multistage decision processes – Principles of optimality – Computation procedures. (5)"
                },
                {
                    "title": "CPM AND PERT:",
                    "content": "Critical path network model – CPM computations – PERT calculations. (5)"
                }
            ],
            "textbooks": [
                "1.\tHamdy A Taha, “Operations Research – An introduction”, Pearson, 2016.",
                "2.\tHillier and Lieberman, “Introduction to Operations Research”, McGraw Hill,  2017."
            ]
        },
        {
            "code": "21X406",
            "title": "COMMUNICATION SKILLS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "SOFT SKILLS:",
                    "content": "Process of Communication - Types: Intra & Interpersonal Communication, Cross – Cultural Communication - Barriers. (6)"
                },
                {
                    "title": "VERBAL AND NON-VERBAL COMMUNICATION:",
                    "content": "Body language, Etiquette: Types - Business, Telephonic, Interview, Social and Dining Etiquette (6)"
                },
                {
                    "title": "PRESENTATION SKILLS:",
                    "content": "Professional Presentation - Public Speaking - Group Communication  - Case Study based Presentation-  - Meetings - Interview Techniques. (12)"
                },
                {
                    "title": "READING SKILLS:",
                    "content": "Reading Comprehension and Techniques  – Focus on Syntax, Vocabulary use, Discourse Markers, and Variety of expression. (12)"
                },
                {
                    "title": "WRITING SKILLS:",
                    "content": "Professional Reports: Characteristics - Categories - Format and style and writing techniques, The 7Cs of Writing letters - Official and Business letters - Effective Email writing - Resume Writing practices. (12)"
                },
                {
                    "title": "PRACTICALS:",
                    "content": "Professional Presentations - Group Discussions  and Meetings - Mock Interviews. (12)"
                }
            ],
            "textbooks": [
                "1. Meenakshi Raman, Sangeetha Sharma,”Technical Communication:Principles and Practices”, Oxford University Press, New Delhi, 2018."
            ]
        },
        {
            "code": "21X407",
            "title": "COMPUTER NETWORKS LABORATORY",
            "credits": "0 0 4 2"
        },
        {
            "code": "21X408",
            "title": "JAVA PROGRAMMING LABORATORY",
            "credits": "0 0 4 2"
        },
        {
            "code": "21X501",
            "title": "MOBILE COMPUTING AND APPLICATION DEVELOPMENT",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Introduction to mobile and wireless devices -  wireless networking, Advantages and disadvantages of wireless networking, Evolution of mobile communication generations- Challenges in mobile computing – Vertical and horizontal mobile applications - Wireless LAN and Wireless WAN. (6)"
                },
                {
                    "title": "CELLULAR CONCEPT:",
                    "content": "Wireless transmission - Frequencies  for  radio transmission  -  Regulations -  Signals,  Antennas, Signal propagation ,Path loss of radio signals , Additional signal propagation effects - Multi-path propagation -  Multiplexing -  Space division multiplexing - Frequency division multiplexing -Time division multiplexing  - Code division multiplexing - Spread spectrum - Direct sequence spread spectrum - Frequency hopping spread spectrum. (10)"
                },
                {
                    "title": "CELLULAR NETWORK :",
                    "content": "Cellular Concepts –Factors determining cell size and shapes –GSM - Mobile services - System architecture -- Handover – GPRS – Mobile services – System architecture – LTE Network architecture and interfaces. (10)"
                },
                {
                    "title": "MOBILE APPLICATIONS ARCHITECTURE:",
                    "content": "Smart Client – Smart Client Architecture – Messaging Architecture – The ModelView-Controller Model- Delegate Pattern- Building Smart Client Applications - Design, Development, implementation, testing and deployment phase-MVVM mobile architecture Design. (5)"
                },
                {
                    "title": "MOBILE APPLICATION DEVELOPMENT:",
                    "content": "Introduction to Android Platform – Android  architecture overview -  Application life cycle -  UI design for Android -  Different types of layouts – Widgets – List view and Adapters  - Dialogs and Toasts – Intent filters -  Files and database – SQLite on Android -  Security model – Comparison with IOS application development – Building cross-platform applications using React Native. (14)"
                }
            ],
            "textbooks": [
                "1.\tJochen Schiller, “Mobile Communications”, Pearson Education, 2016.",
                "2.\tMartyn Mallick, “Mobile and Wireless Design Essentials”, Wiley, 2014.",
                "3.\tBill Philips, Kristin Marsicano and Chris Stewart, “Android Programming: The big Nerd Ranch Guide”. O‟Reilly, 2017."
            ]
        },
        {
            "code": "21X502",
            "title": "COMPUTER GRAPHICS AND MULTIMEDIA",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION AND OVERVIEW OF GRAPHICS SYSTEMS:",
                    "content": "Use of Computer graphics, Video Display Devices, Refresh \n                        Cathode-Ray Tubes, Raster and Random Scan Displays, Colour CRT Monitors, Direct View Storage Tubes, Flat Panel \n                        Displays, Three-Dimensional Viewing Devices, Stereoscopic & Virtual Reality Systems, Raster and Random Scan Systems, \n                        Different Input and Hard Copy Devices, Graphics Softwares. (6)"
                },
                {
                    "title": "OUTPUT PRIMITIVES:",
                    "content": "Points and Lines, Line Drawing Algorithms (DDA & Bresenham‟s), Circle and Ellipse Generating \n                        Algorithms. (5)"
                },
                {
                    "title": "TWO-DIMENSIONAL GEOMETRIC TRANSFORMATIONS:",
                    "content": "Different types of transformations and their matrix representations, \n                        Homogeneous Coordinates, Composite Transformations, transformations between Coordinate Systems, Affine transformations, Window-to-Viewport Coordinate transformation, Clipping-Point, Line, Polygon, Curve and Text Clipping. (8)"
                },
                {
                    "title": "THREE-DIMENSIONAL CONCEPTS AND OBJECT REPRESENTATION:",
                    "content": "Three Dimensional Display Methods, Polygon \n                        Surfaces, Curved Lines & Surfaces, Quadric Surfaces, Spline Representations, Cubic Spline interpolation methods, Bezier \n                        Curves and Surfaces. (6)"
                },
                {
                    "title": "THREE DIMENSIONAL TRANSFORMATIONS AND VIEWING:",
                    "content": "Translation, Rotation, Scaling, Reflection, Shears, Composite \n                        Transformations, Projections- Parallel and Perspective, Projection Transformations, Clipping. (6)"
                },
                {
                    "title": "VISIBLE SURFACE DETECTION METHODS:",
                    "content": "Classification of Visible Surface Detection Algorithms, Back Face Detection, \n                        Depth Buffer Method, A-Buffer Method, Scan-Line Method, Depth Sorting Method, BSP-Tree Method & Area Subdivision Method. Polygon- Rendering Methods. (6)"
                },
                {
                    "title": "INTRODUCTION TO MULTIMEDIA SYSTEMS DESIGN:",
                    "content": "An Introduction – Multimedia applications – Multimedia System Architecture – Defining objects for Multimedia systems – Multimedia Data interface standards – Multimedia Databases. (4)"
                },
                {
                    "title": "COMPRESSION & DECOMPRESSION:",
                    "content": "Data & File Format standards – Multimedia I/O technologies - Digital voice and audio \n                        – video image and animation – Full motion video – Multimedia Authoring & User Interface – Hypermedia messaging. (4)"
                }
            ],
            "textbooks": [
                "1.\tHearn D. & M.P. Baker, “Computer Graphics with open GL”, Pearson Education, 2014.",
                "2.\tPrabat K. Andleigh and Kiran Thakrar, “Multimedia Systems and Design”, Prentice Hall, 2009"
            ]
        },
        {
            "code": "21X503",
            "title": "MACHINE LEARNING",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Machine learning – Basics - Convex set - Convex functions – Unconstrained Convex Optimization - Gradient Ascent/Descent -  Loss functions  in ML –  Types – Supervised learning, unsupervised, Reinforcement learning. (4)"
                },
                {
                    "title": "SUPERVISED LEARNING:",
                    "content": "Regression – Linear – Polynomial – Multiple regression – Evaluation measures – Bias –variance – overfitting – underfitting – regularization. (6)"
                },
                {
                    "title": "CLASSIFICATION :",
                    "content": "Linear classifier - Logistic Regression – Support Vector Machines – Linear, Soft margin, Linearly non separable data - Kernel functions (8)"
                },
                {
                    "title": "NEURAL NETWORKS :",
                    "content": "Perceptron - Multilayer perceptron  - Back propagation – Training - Naïve Bayes Classifier - Maximum Likelihood Estimation – Maximum a Posteriori Estimate – Multivariate classification –   K nearest neighbor classifier (6)"
                },
                {
                    "title": "DECISION TREES :",
                    "content": "Introduction – Purity measures – Entropy, cross entropy,  information gain, gain ratio, Gini Index – Regression trees – ID3 – Pruning – Model selection –  Model selection and evaluation – Performance Measures – Receiver operating characteristic curve (ROC) – AUC  (8)"
                },
                {
                    "title": "UNSUPERVISED LEARNING:",
                    "content": "Clustering – K-means – EM - Mixture of Gaussians –Spectral clustering - Cluster validity measures – Applications : image segmentation – Image compression  (6)"
                },
                {
                    "title": "DIMENSIONALITY REDUCTION:",
                    "content": "Principal components analysis (PCA) – Linear discriminant analysis (LDA) -  Independent components analysis (ICA)  (5)"
                },
                {
                    "title": "RECENT TRENDS:",
                    "content": "Overview - Federated Learning – Automated Machine Learning (2)"
                }
            ],
            "textbooks": [
                "1.\tChristopher M Bishop, “Pattern Recognition and Machine Learning”, Springer, 2016.",
                "2.\tAlpaydin Ethem, “Introduction to Machine Learning”, Massachusetts Institute of Technology Press, 2020."
            ]
        },
        {
            "code": "21X504",
            "title": "MOBILE COMPUTING AND APPLICATION DEVELOPMENT LABORATORY",
            "credits": "0 0 4 2"
        },
        {
            "code": "21X505",
            "title": "COMPUTER GRAPHICS AND MULTIMEDIA LABORATORY",
            "credits": "0 0 4 2"
        },
        {
            "code": "21X506",
            "title": "MACHINE LEARNING LABORATORY",
            "credits": "0 0 4 2"
        },
        {
            "code": "21X601",
            "title": "DISTRIBUTED ENTERPRISE COMPUTING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "DISTRIBUTED SYSTEM COMPUTING:",
                    "content": "Types of UI – CSS – Validation - Operating System Services for Client – Server Types – Server Side Scripting – Operating System Services for Server – Client and Server Software Requirements. (8)"
                },
                {
                    "title": "DISTRIBUTED MULTI-TIER COMPUTING:",
                    "content": "Basis of Distributed Computing – Decomposition Approaches – Layers and Tiers – Component Based Software Development for Enterprise – Enterprise Architectural Overview – Java Enterprise System - EJB. (7)"
                },
                {
                    "title": "COMMUNICATION:",
                    "content": "Message Passing - Features and Issues – Synchronization – Buffering – Process addressing – Failure handling – Remote Procedure Call: Model – Implementation – Stub generation – RPC messages – Marshaling –Server management – Call semantics – IDL – UUID. (8)"
                },
                {
                    "title": "MIDDLEWARE:",
                    "content": "Architecture – Classification of Middleware – Architecture of Middleware – Communication Middleware – ODBC – JDBC – Connection – Statement - Transaction Middleware – Isolation – Interfacing – Overview of RMI – Web Services . (8)"
                },
                {
                    "title": "ENTERPRISE WEB COMMUNICATION:",
                    "content": "Java Servlets – Packages - Generic Servlets - HTTP Servlet  – Session Management - JSP – Elements of JSP – Directives - Java Beans in JSP – JSTL - Libraries. (8)"
                },
                {
                    "title": "FRAMEWORKS:",
                    "content": "Introduction to Frameworks – Spring – Hibernate - Laravel. (6)"
                }
            ],
            "textbooks": [
                "1.\tRobert Orfali, Dan Harkey and Jeri Edwards, “Client / Server survival Guide”, Wiley, 2011",
                "2.\tLiu M L, “Distributed Computing: Principles and Applications”, Pearson Education, 2013"
            ]
        },
        {
            "code": "21X602",
            "title": "SOFTWARE TESTING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Need for testing – Psychology of testing – Testing economies – Software Testing Life Cycle: Requirements Analysis/Design– Traceability Matrix– Test Planning– Objective, Scope of Testing, Schedule, Approach, Roles & Responsibilities, Assumptions, Risks & Mitigations, Entry & Exit Criteria, Test Automation, and Deliverables - SDLC vs STLC. (6)"
                },
                {
                    "title": "TYPES OF TESTING:",
                    "content": "Unit Testing, Integration Testing, System Testing, Smoke, Regression Testing, Acceptance Testing, Acceptance testing - Installation testing, Functional/Non-Functional Testing, Manual Testing, Automation Testing. (6)"
                },
                {
                    "title": "SOFTARE TESTING METHODOLOGIES:",
                    "content": "Validation  &  Verification– White/Glass Box Testing - Black Box Testing - Grey Box Testing - Statement Coverage  Testing -  Branch  Coverage  Testing-  Path  Coverage  Testing- Conditional Coverage Testing- Loop Coverage Testing- Boundary Value Analysis-  Equivalence  Class  Partition-  State Based Testing-  Decision Table - Testing GUI.  (15)"
                },
                {
                    "title": "TEST PLAN & TEST EXECUTION:",
                    "content": "Types of Test cases– Preparation of test plan – Test script – Execute test cases – Error/Defect Detecting and Reporting – DRE (Defect Removal Efficiency) – Object – Types of Bugs – Debugging Approaches – Reporting the Bugs –Test Closure – Criteria for test closure – Test summary report. (8)"
                },
                {
                    "title": "TEST METRICS:",
                    "content": "Test Measurements, Test Metrics, Metric Life Cycle, Types of Manual Test Metrics, Static metrics: Halsted Metrics & Cyclomatic Complexity. (3)"
                },
                {
                    "title": "TECHNIQUES FOR AUTOMATING TEST EXECUTION:",
                    "content": "Testing and test automation – the V model – common problems of test automation – limitations of automating software testing. (7)"
                }
            ],
            "textbooks": [
                "1. William Perry, \"Effective Methods for Software Testing\", Wiley, 2009.",
                "2.\tAlpaydin Ethem, “Introduction to Machine Learning”, Massachusetts Institute of Technology Press, 2020."
            ]
        },
        {
            "code": "21X0",
            "title": "A1 WEB SERVICES",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "XML:",
                    "content": "Introduction to XML – Comparison with HTML – XML Documents – Well–Formed XML Document – Markup and Character Data – Prolog and XML Declaration – Processing Instructions – XML Elements and its types– Attributes – Elements Vs Attributes – C DATA Sections – XML Namespaces – DTD. (7)"
                },
                {
                    "title": "XML SCHEMAS:",
                    "content": "Validating XML documents using XML Schema – Comparison with DTD – Creation of Simple Types – Specifying attribute constraints and defaults – Creation of Complex type – Specifying different types of content using Complex Type – Specifying data types and restrictions in Schema. – XML Applications and Development. (7)"
                },
                {
                    "title": "DOM AND SAX:",
                    "content": "Comparison –DOM and SAX parser – creation, Displaying and Filtering XML documents  (4)"
                },
                {
                    "title": "XML TECHNOLOGIES:",
                    "content": "XLINK, XPOINTERS, XQUERY, SVG, RDF. (4)"
                },
                {
                    "title": "WEB SERVICES:",
                    "content": "Introduction – Interacting with Web Services – Technology of Web Services. (5)"
                },
                {
                    "title": "SOAP:",
                    "content": "SOAP Message Exchange Model – Relation to XML – SOAP Envelope – Head – Body – Fault – SOAP Encoding – SOAP and HTTP – Using SOAP for RPC  (5)"
                },
                {
                    "title": "WSDL:",
                    "content": "WSDL Document structure – Types, Messages, Port types, Bindings, Ports, Services – SOAP binding – HTTP GET and POST Binding. (6)"
                },
                {
                    "title": "UDDI:",
                    "content": "Introduction – UDDI Data Structure – Business Entity – Business Service – Binding Template – tModel – UDDI API – Inquiry API, Publication API – Security. (5)"
                },
                {
                    "title": "APPLICATIONS:",
                    "content": "Real world examples and implementation  (2)"
                }
            ],
            "textbooks": [
                "1.\tRon Schmalzer, Travis Vandersypen, Jason Bloomberg, “XML and Web Services Unleashed”, Pearson Education, 2014.",
                "2.\tMartin KAlin, “Java Web Services: Up and Running”, O‟Reilly, 2013"
            ]
        },
        {
            "code": "21X0",
            "title": "A2 OPEN SOURCE SOFTWARE",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Proprietary Software, Free Software, Open Software, Licenses, Version Control, Explore GitHub – GitHub Workflows, Git Basics, Git Branching, Git on the Server, Distributed Git, GitHub, Git Tools, Customizing Git. (6)"
                },
                {
                    "title": "PHP PROGRAMMING LANGUAGE:",
                    "content": "Basics – Data types – operators and flow control – String – Arrays – Functions – PHP with HTML – Client side validation – Working with Databases  (9)"
                },
                {
                    "title": "PYTHON PROGRAMMING LANGUAGE:",
                    "content": "Basic Syntax, Functions, Conditionals and Recursion, Iteration, Strings, Lists, Dictionaries, Tuples, Files, Classes and Objects, Inheritance, CGI, Multithreading, Networking, Python GUI - Tkinter, Distributing Python Modules, Python Standard Library, Django Framework. (9)"
                },
                {
                    "title": "RUBY PROGRAMMING LANGUAGE:",
                    "content": "Foundations and Scaffolding – Ruby Building Blocks, Ruby Ecosystem, The Core of Ruby - Classes, Objects, and Modules, Projects and Libraries, Error Handling, Files and Databases, Deploying Ruby Applications, Ruby Online  (8)"
                },
                {
                    "title": "RUBY ON RAILS:",
                    "content": "Scaling Rails, rails server, Deploying – Heroku Setup, User Resource, Microposts Resource, Static and Slightly Dynamic Pages, Rails Flavoured Ruby, Filling in the Layout, Modeling Users, Sign Up, Sign In, Sign Out, Updating, Showing, Deleting Users, User Microposts, Following Users.  (8)"
                },
                {
                    "title": "WEB SERVER:",
                    "content": "Application Server Vs Web server– Characteristics of Web server – Case Study: Apache Tomcat Web Server  (5)"
                }
            ],
            "textbooks": [
                "1.\tSteven Holzner, “PHP: The Complete Reference”, Tata McGraw Hill, 2010",
                "2.\tAllen B Downey, “Think Python”, O'Reilly, 2012",
                "3.\tMichael Hartl, “Ruby on Rails Tutorial”, Addison Wesley, 2012"
            ]
        },
        {
            "code": "21X0",
            "title": "A3 ARTIFICIAL INTELLIGENCE",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "The foundations of AI - The History of AI - Intelligent agents - Agent based system. (2)"
                },
                {
                    "title": "PROBLEM SOLVING:",
                    "content": "State Space models - Searching for solution - Uninformed/Blind search - Informed/ Heuristic search  A* , Hill-climbing  - Meta Heuristic: Genetic Algorithm - Adversary based search : Minimax ,  Expectimax – Alpha Beta pruning – Constraint satisfaction problem  -  Backtracking search  (10)"
                },
                {
                    "title": "KNOWLEDGE REPRESENTATION AND REASONING:",
                    "content": "Knowledge representation - Logic - inference - Fuzzy logic: membership - Fuzzy rules and reasoning - Fuzzy inference  (8)"
                },
                {
                    "title": "UNCERTAIN KNOWLEDGE AND PROBABILISTIC REASONING:",
                    "content": "Uncertainty - Probabilistic reasoning - Semantics of Bayesian network - Exact inference in Bayesian network- Approximate inference in Bayesian network  (10)"
                },
                {
                    "title": "DECISION-MAKING:",
                    "content": "Basics of utility theory, Utility functions - Sequential decision problems - Markov decision process - Value iteration - Policy iteration - Decisions in Multi agent system:  Multi agent decision theory - Group decision making.  (10)"
                },
                {
                    "title": "LEARNING:",
                    "content": "Learning from observation – Supervised Learning - Unsupervised - Reinforcement learning  (5)"
                }
            ],
            "textbooks": [
                "1.\tStuart Russell and Peter Norvig, “Artificial Intelligence: A Modern Approach”, Pearson Education, 2015.",
                "2.\tDavid Pool and Alan Mackworth, “Artificial Intelligence: Foundations of Computational agents”, Cambridge University Press, 2017."
            ]
        },
        {
            "code": "21X0",
            "title": "A4 DATA MINING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Motivation for Data Miniing – Importance – Definition – Kinds of data for  Data Mining – Data Mining functionalities – Patterns – Classification of Data Mining Systems – Major issues in Data Mining. (5)"
                },
                {
                    "title": "DATA PREPROCESSING:",
                    "content": "Types of data - Data cleaning – Data Aggregation – Data Discretization - Sampling – Data Reduction – LDA and PCA - Feature subset selection – Correlation analysis – Numerical attributes and Categorical attibutes.  (6)"
                },
                {
                    "title": "MINING FREQUENT PATTERNS, ASSOCIATION AND CORRELATIONS:",
                    "content": "Basic concepts – Efficient and scalable frequent item set mining methods – Apriori, FP tree, ECLAT.  (8)"
                },
                {
                    "title": "ENSEMBLE OF CLASSIFIERS:",
                    "content": "Classification  – Ensemble Learning – Bagging, Boosting, Cascading – Ensemble Pruning.  (9)"
                },
                {
                    "title": "CLUSTER ANALYSIS:",
                    "content": "A categorization of major clustering  methods – partitioning methods – hierarchical methods – density based methods – DBSCAN, OPTICS, DENCLUE - Outlier analysis.  (9)"
                },
                {
                    "title": "MINING DATA STREAMS:",
                    "content": "Challenges-Mining time series databases and sequence data –Stationary data stream learning- Hoeffding trees- Evolving data stream mining.   (4)"
                },
                {
                    "title": "APPLICATIONS AND TRENDS IN DATA MINING:",
                    "content": "Spatial Data Mining –Graph Mining- Web Mining –Text Mining.  (4)"
                },
                {
                    "title": "Tutorial Practice:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1.\tJiwei Han and Micheline  Kamber , “Data Mining – Concepts and Techniques”, Morgan Kaufmann,  2011.",
                "2.\tTan, Steinbach, Kumar, “Introduction to Data Mining”, Pearson Education, 2007."
            ]
        },
        {
            "code": "21X0",
            "title": "A5 NATURAL LANGUAGE PROCESSING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION :",
                    "content": "Natural language processing techniques - analysis in NLP: morphological – syntactic, semantic – pragmatic – Applications  (2)"
                },
                {
                    "title": "WORDS :",
                    "content": "Regular expressions – Automata – Morphology – Finite state Transducers – Finite state morphological parsing – Combining FST lexicon and rules – Porter Stemmer Algorithm – Probabilstic models for Spelling – Bayes method, Minimum edit distance - N-Grams – Counting words in Corpora – Simple n-grams – Smoothing – Evaluating language models : Entropy, Perplexity- Part of Speech Tagging (POS) – Rule based tagging – Stochastic based tagging – Transformation based tagging - Context Free Grammars - Top down parser – Earley Algorithm – Bottom-up parsing – CYK parser – Probabilistic parsing.  (12)"
                },
                {
                    "title": "SEMANTICS & PRAGMATICS:",
                    "content": "First order predicate calculus – Syntax driven sematic analysis – Attachments for a fragment of English – Word Sense Disambiguation – Machine learning approaches – Dictionary based approaches – Pragmatics : Discourse –Textcoherence. (10)"
                },
                {
                    "title": "DEEP LEARNING in NLP :",
                    "content": "Text representation – Word2Vec models – Recurrent neural network (RNN) – Long short term memory (LSTM )  (6)"
                },
                {
                    "title": "NATURAL LANGUAGE GENERATION :",
                    "content": "Architecture of NLG Systems- Generation Tasks and Representations- Application of NLG. Machine Translation: Language similarities and differences – The transfer metaphor – Direct translation – Statistical translation - Translation involving Indian Languages. (11)"
                },
                {
                    "title": "CASE STUDIES :",
                    "content": "Mail spam, web spam detection, Fake news detection - Sentiment Analysis - Information extraction - Automatic summarization - Question answering - Named entity recognition and relation extraction - IE using sequence labeling - Open problems  (4)"
                },
                {
                    "title": "Tutorial Practice:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1.\tDaniel Jurafsky and James H. Martin, “Speech and Language Processing: An Introduction to Natural Language Processing, Computational Linguistics and Speech Recognition”, Prentice Hall,2014.",
                "2.\tJacob Eisenstein, \"Introduction to Natural Language Processing\", The MIT Press, 2019."
            ]
        },
        {
            "code": "21X0",
            "title": "A6 DESIGN AND ANALYSIS OF ALGORITHMS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Fundamentals of algorithmic problem solving, deciding an appropriate data structure and algorithm design technique – Methods of specifying an algorithm – proving the correctness – Review of analysis of algorithms, analysis of recursive algorithms – Master‟s Theorem. (5)"
                },
                {
                    "title": "DIVIDE AND CONQUER:",
                    "content": "Binary search-merge sort-quick sort-Large Integer multiplication,- Strassen‟s matrix multiplication- Closest pair.  (7)"
                },
                {
                    "title": "GREEDY METHOD:",
                    "content": "Minimum cost spanning tree (Kruskal and Prim‟s algorithms) - Topological sorting - Huffman codes and data compression. (6)"
                },
                {
                    "title": "DYNAMIC PROGRAMMING:",
                    "content": "Principles of dynamic programming – 0/1 knapsack problem-Llongest common subsequence problem -All pairs shortest problem - Travelling salesman problem. (7)"
                },
                {
                    "title": "STRING MATCHING:",
                    "content": "The naïve string-matching algorithm - Rabin-Karp algorithm and analysis.  (4)"
                },
                {
                    "title": "NETWORK FLOW:",
                    "content": "Flow networks and Flows – Flow networks with multiple sources and sinks, -The Ford – Fulkerson method- Augmenting paths – Max flow min cut theorem-The Edmonds – Karp algorithm. (5)"
                },
                {
                    "title": "NP AND COMPUTATIONAL INTRACTABILITY:",
                    "content": "Basic concepts – Polynomial time reductions- 3 SAT and Independent Set- efficient certification and NP, NP hard and NP complete problems. (5)"
                },
                {
                    "title": "COPING WITH NP-COMPLETENESS:",
                    "content": "Backtracking-n queens problem, Graph coloring problem - Branch and bound - 0/1 Knap sack problem , Traveling salesman problem, Assignment problem- Approximation algorithm – Introduction – Traveling salesman problem. (6)"
                },
                {
                    "title": "Tutorial Practice:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1.\tThomas H. Cormen, Charles E Leiserson and Ronald L Rivest, “Introduction to Algorithms”, MIT Press, 2015",
                "2.\tAlfred V Aho, John E Hopcraft, Jeffrey D Ullman, ”Data structures and Algorithms”, Pearson Education, 2009"
            ]
        },
        {
            "code": "21X0",
            "title": "A7 CLOUD COMPUTING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "OVERVIEW OF COMPUTING PARADIGM:",
                    "content": "Recent trends in Computing - Grid Computing, Cluster Computing, Distributed Computing, Utility Computing, Cloud Computing - Evolution of Cloud Computing - Business driver for adopting Cloud Computing – Web Services – SOA – Web 2.0.  (8)"
                },
                {
                    "title": "INTRODUCTION TO CLOUD COMPUTING:",
                    "content": "Cloud Computing - Introduction to Cloud Computing, History of Cloud Computing, Cloud Service Providers - Properties, Characteristics & Disadvantages - Pros and Cons of Cloud Computing - Comparison of Cloud Computing with Grid, Cluster and Utility Computing – Role of Open Standards.  (6)"
                },
                {
                    "title": "CLOUD COMPUTING ARCHTECTURE:",
                    "content": "Cloud Computing Stack - Comparison with traditional computing architecture (client/server) - Services at Various Levels - Role of Networks in Cloud computing - Role of Web Services - Service Models (XaaS) - Infrastructure as a Service(IaaS), Platform as a Service(PaaS), Software as a Service(SaaS) - Deployment Models - Private Cloud, Public Cloud, Hybrid cloud, Community cloud.  (6)"
                },
                {
                    "title": "VIRUTUALIZATION:",
                    "content": "Basics of Virtualization - Types of virtualization - Implementation Levels of virtualization: Application level, Server level, Storage level and Networking - Tools for Virtualization – KVM, VMware - Virtualization for Cloud.  (5)"
                },
                {
                    "title": "MAP REDUCE PARADIGMS:",
                    "content": "Introduction, GFS Architecture, HDFS Architecture, HBase, Google Big Table, Hive, MongoDB as DaaS, Firebase - Map Reduce programming examples. (6)"
                },
                {
                    "title": "CLOUD SECURITY:",
                    "content": "Infrastructure Security - Network level security, Host level security, Application level security. Data security and Storage - Data privacy and security Issues, Jurisdictional issues raised by Data location: Identity & Access Management, Access Control, Trust, Reputation, Risk, Authentication, Client Access in Cloud, Cloud Contracting Model, Commercial and Business Considerations. (7)"
                },
                {
                    "title": "CASE STUDY ON OPEN SOURCE AND COMMERCIAL CLOUDS:",
                    "content": "Amazon EC2, Amazon S3, Google Compute Engine, Microsoft Azure, Cloudfoundry, OpenStack. (7)"
                },
                {
                    "title": "Tutorial Practice:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1.\tAnthony T. Velte, Toby J. Velte and Robert Elsenpeter, “Cloud Computing: A Practical Approach”, Tata McGraw Hill, 2017.",
                "2.\tRajkumar Buyya, James Broberg and Andrzej Goscinski, “Cloud Computing: Principles and Paradigms”, John Wiley and Sons, 2013"
            ]
        },
        {
            "code": "21X0",
            "title": "A8 DEEP LEARNING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Basic concepts – Convex sets, convex functions – loss functions – Gradient descent – Variants - Perceptron – Activation functions - Geometric representation – Perceptron Convergence theorem  (4)"
                },
                {
                    "title": "FEED FORWARD NETWORKS:",
                    "content": "Multi layer Perceptron – back propagation - Learning XOR – Auto encoder - Deep neural networks  (6)"
                },
                {
                    "title": "TRAINING NEURAL NETWORKS:",
                    "content": "Optimization methods for neural networks - Adagrad, Adadelta, rmsprop, adam, NAG - second order methods for training, Saddle point problem in neural networks, Regularization methods - dropout, batch normalization, Ridge and Lasso  (10)"
                },
                {
                    "title": "CONVOLUTIONAL NETWORKS:",
                    "content": "Structure – properties – Region based CNN - LeNet – Alex net  (5)"
                },
                {
                    "title": "RECURRENT NETWORKS :",
                    "content": "Recurrent neural networks(RNN) – Gated Recurrent unit – Long Short Term Memory - Bidirectional RNNs - Deep recurrent network – Methodology – Applications.  (8)"
                },
                {
                    "title": "DEEP LEARNING RESEARCH :",
                    "content": "Linear Factor Models, variants of Autoencoders, Representational Learning, Structured probabilistic models for deep learning, Monte Carlo Methods, Generative adversarial networks – Deep generative models  (9)"
                },
                {
                    "title": "APPLICATIONS:",
                    "content": "Natural language processing, Big Data, Brain Computer Interface, Vision, IoT  (3)"
                }
            ],
            "textbooks": [
                "1.\tIan Goodfellow, YoshuaBengio, and Aaron Courville ,”Deep Learning”, The MIT Press, 2016.",
                "2.\tYoshuaBengio, “Learning Deep Architectures for AI, Foundations & Trends in Machine Learning”, 2009."
            ]
        },
        {
            "code": "21X0",
            "title": "A9 BIG DATA ANALYTICS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Big Data Sources – Acquisition  - Features of big data - Security, Compliance, Auditing and Protection  - Evolution of Big Data - characteristics.  (3)"
                },
                {
                    "title": "MASSIVE DATASETS MINING:",
                    "content": "MapReduce – Algorithms using MapReduce – Finding Similar Items: Applications of Near-Neighbor Search – Shingling of Documents – Locality Sensitive Hashing for Documents.  (10)"
                },
                {
                    "title": "MINING DATA STREAMS:",
                    "content": "Sampling Data in a Stream – Filtering Streams – Counting Distinct Elements in a Stream.   (5)"
                },
                {
                    "title": "LINK ANALYSIS:",
                    "content": "PageRank – Efficient Computation of PageRank – Topic Sensitive PageRank – Link Spam – Hubs and Authorities – Advertising on the Web: Issues – The Adwords Problem - Social Network analysis  (8)"
                },
                {
                    "title": "DATA MODELING FOR BIG DATA:",
                    "content": "Big Data and Challenges, NoSQL data models, Basic principles of NoSQL models, SQL databases VsNoSQL databases. (4)"
                },
                {
                    "title": "NOSQL DATABASES :",
                    "content": "Key - Value Stores: Oracle Coherence – Amazon DynamoDB, Key -Value Stores (in-memory) :Redis  Key-value Stores (B-tree): Berkeley DB, Column Oriented Store: Google BigTable , Apache Cassandra -  Hbase.  Document Oriented Stores – MongoDB - Apache CouchDB - XML databases, Graph databases: Neo4J - OrientDB, Object Database: Db4o  (13)"
                },
                {
                    "title": "DATA VISUALIZATION",
                    "content": "(2)"
                }
            ],
            "textbooks": [
                "1.\tPaul Zikopoulos, Dirk Deroos, Krishnan Parasuraman, Thomas Deutsch, David Corrigan, James Giles, “Harness the power of Big Data”,Tata McGraw  Hill, 2013.",
                "2.\tPeter Zadrozny, Raghu Kodali, “Big Data Analytics using Splunk”, Apress, 2013.",
                "3.\tAnand Rajaraman and Jeffrey David Ullman, “Mining of Massive Datasets”, Cambridge University Press, 2016."
            ]
        },
        {
            "code": "21X0",
            "title": "AA GRAPH THEORY",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "BASIC CONCEPTS:",
                    "content": "Graphs - subgraphs, graph models, graph representations, degree sequence, Havel-Hakimi theorem (statement only), Hand-shaking lemma. Walk, path, distance, diameter, connectedness.  Isomorphic graphs. Common classes of graphs – regular, complete, Petersen, cycle, path, tree, bipartite, hypercube. Trees, Spanning trees – Minimum Spanning Tree, Shortest Path problem.  (11)"
                },
                {
                    "title": "CONNECTIVITY:",
                    "content": "Vertex and edge connectivity, Vertex and edge cuts, relationship between vertex and edge connectivity, bounds for connectivity.  Harary‟s construction of k-connected graphs.  (8)"
                },
                {
                    "title": "EULERIAN AND HAMILTONIAN GRAPHS:",
                    "content": "Eulerian graphs, Route inspection problem, Hamiltonian graphs, Dirac‟s and Ore‟s theorems, Gray codes, traveling salesman problem. \t (8)"
                },
                {
                    "title": "MATCHING:",
                    "content": "Maximum matching – augmenting paths, Berge‟s theorem, Bipartite matching - Hall‟s theorem, Perfect matching – Tutte‟s theorem, Edmonds‟ algorithm.  (8)"
                },
                {
                    "title": "COLORING & PLANAR GRAPHS:",
                    "content": "Vertex-coloring – chromatic number, bounds, sequential and largest degree first algorithms – Chromatic Polynomial. Plane and Planar graphs, dual graphs, Kuratowski's graphs, Euler's formula, Characterization of Planar Graphs, Planarity testing.  (10)"
                }
            ],
            "textbooks": [
                "1.\tJonathan L. Gross, Jay Yellen, Mark Anderson, “Graph Theory and its Applications”, 3rd Edition, CRC Press, 2019.",
                "2.\tDouglas B. West, “Introduction to Graph Theory” 2nd Edition, Pearson Education India, 2015."
            ]
        },
        {
            "code": "21X0",
            "title": "AB SOFTWARE PATTERNS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Reusable Software, Reusable object oriented software, Patterns, Definition, Overview & motivation, Categories, Relationship between patterns, Pattern description.  (5)"
                },
                {
                    "title": "DESIGN PATTERNS:",
                    "content": "Creational patterns - Abstract factory, Builder, Factory method, Prototype, Singleton. Structural patterns – Adapter, Bridge, Composite, Decorator, Façade, Flyweight, Proxy. Behavioral patterns – Command, Interpreter, Iterator, Mediator, Memento, Observer, State, Strategy, Template method, Visitor, Case Studies.  (15)"
                },
                {
                    "title": "ARCHITECTURE PATTERNS:",
                    "content": "From Mud to Structure – Layers, Pipes and Filters, Blackboard.  Distributed systems – Broker. Interactive Systems - Model View Controller (MVC), Presentation Abstraction Control, Adaptable Systems, Reflection, Microkernel.   (5)"
                },
                {
                    "title": "REFACTORING AND CODE SMELLS:",
                    "content": "Refactoring, Principles in Refactoring, Bad smells in Code,  A Catalog of Refactoring with examples. (10)"
                },
                {
                    "title": "Idioms:",
                    "content": "Antipatterns in Software development, Pattern mining, Pattern Language.  (10)"
                }
            ],
            "textbooks": [
                "1.\tErich Gamma, Richard Helm, Ralph Johnson and John Vlissides, “Design Patterns: Elements of Reusable Object-Oriented Software”, Pearson Education, 2005.",
                "2.\tFrank Buschman, Regine Meunier, Hans Rohnert, Peter Sommerlad and Michael Stal, “Pattern-Oriented Software Architecture: A System of Patterns”, John Wiley and Sons, 2001."
            ]
        },
        {
            "code": "21X0",
            "title": "AC MODERN DATABASE MANAGEMENT SYSTEMS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "QUERY PROCESSING:",
                    "content": "Database Catalog - Query Processing Methodology - Query Evaluation - Query Interpretation - Equivalence of Expressions – Selection, Projection and Natural Join Operations  - Estimation of Query Processing Cost - Estimation of access costs  using Indices - Algorithm for executing query operations – Query Optimization - Heuristic Query optimization– Cost based query optimization.  (8)"
                },
                {
                    "title": "OBJECT  DATABASES:",
                    "content": "Introduction to Object Relational Data Model - Complex data types- Structured types and InheritanceNesting -un nesting of Relations – Query Processing in ORDBMS- Object oriented data model - Object Identity - Persistent Programming Languages - Type and Class Hierarchies and Inheritance - Complex Objects - Object Oriented Database Design - Query Processing in object oriented database-Comparison of Object Oriented and Object Relational databases.  (5)"
                },
                {
                    "title": "SPATIAL DATABASES:",
                    "content": "Fundamentals of GIS - Spatial Data Types- Spatial relations – Spatial Queries -Spatial indexing techniques - R-trees, KD trees - Quad trees-Applications of spatial databases   (4)"
                },
                {
                    "title": "PARALLEL AND DISTRIBUTED DATA BASES:",
                    "content": "Architecture of parallel databases – Parallel query evaluation, Paralyzing individual operations, Parallel query optimization -  Homogeneous and Heterogeneous databases - Architecture of distributed data bases - Storing data in distributed data bases, Distributed Transactions - Concurrency control in Distributed databases - Distributed query processing.  (10)"
                },
                {
                    "title": "MODERN NOSQL DATABASES:",
                    "content": "Key - Value Stores – Amazon‟s DynamoDB, Key -Value Stores (in-memory) : Redis , Wide Column Store: Cassandra, Google BigTable -  Document Oriented Stores – MongoDB  - Graph databases: Neo4J.  (10)"
                },
                {
                    "title": "DATABASE INTEGRATION:",
                    "content": "Data integration: schema directed data integration - Data exchange: Schema mapping and information preservation - automatic schema matching - Information Preserving XML Schema Embedding.   (8)"
                }
            ],
            "textbooks": [
                "1.\tElmasri R and Navathe SB, “Fundamentals of Database Systems”, Pearson Education,  2016.",
                "2.\tSilberschatz A, Korth H  and Sudarshan S, “Database System Concepts”, McGraw Hill, 2011.",
                "3.\tTamer O Zsu M and Patrick Valduriez, “Principles of Distributed Database Systems”, Pearson Education, 2011."
            ]
        },
        {
            "code": "21X0",
            "title": "AD EMBEDDED SYSTEM AND DESIGN",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "Introduction to Embedded Systems:",
                    "content": "Definition of Embedded System, Embedded Systems Vs General Computing Systems, History of Embedded Systems, Classification, Major Application Areas, Purpose of Embedded Systems, Characteristics and Quality Attributes of Embedded Systems. (9)"
                },
                {
                    "title": "Typical Embedded System:",
                    "content": "Core of the Embedded System: General Purpose and Domain Specific Processors, ASICs, PLDs, Commercial Off-The-Shelf Components (COTS), Memory: ROM, RAM, Memory according to the type of Interface, Memory Shadowing, Memory selection for Embedded Systems, Sensors and Actuators, Communication Interface: Onboard and External Communication Interfaces. \t (10)"
                },
                {
                    "title": "Embedded Firmware:",
                    "content": "Reset Circuit, Brown-out Protection Circuit, Oscillator Unit, Real Time Clock, Watchdog Timer, Embedded Firmware Design Approaches and Development Languages.  (8)"
                },
                {
                    "title": "RTOS Based Embedded System Design:",
                    "content": "Operating System Basics, Types of Operating Systems, Tasks, Process and Threads, Multiprocessing and Multitasking, Task Scheduling.  (9)"
                },
                {
                    "title": "Task Communication:",
                    "content": "Shared Memory, Message Passing, Remote Procedure Call and Sockets, Task Synchronization: Task Communication/Synchronization Issues, Task Synchronization Techniques, Device Drivers. An example of RTOS.    (9)"
                }
            ],
            "textbooks": [
                "1.\tDavid E Simon, “An Embedded Software Primer “, Pearson Education, 2013.",
                "2.\tShibu K.V , “Introduction to Embedded Systems”  Mc Graw Hill,2017",
                "3.\tMarilyn Wolf, “Computers as components: principles of embedded computing system design”, Elsevier, 2014"
            ]
        },
        {
            "code": "21X0",
            "title": "AE INFORMATION RETRIEVAL AND WEB SEARCH",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Overview of IR Systems - Historical Perspectives - Goals of IR -   The impact of the web on IR - The role of artificial intelligence (AI) in IR. (3)"
                },
                {
                    "title": "TEXT REPRESENTATION:",
                    "content": "Statistical Characteristics of Text: Zipf's law; Porter stemmer; morphology; index term selection; using thesauri. Basic Tokenizing, Indexing:  Simple tokenizing, stop-word removal, and stemming; inverted indices; Data Structure and File Organization for IR - efficient processing with sparse vectors.  (6)"
                },
                {
                    "title": "RETRIEVAL MODELS:",
                    "content": "Similarity Measures and Ranking -  Boolean Matching – Extended Boolean models - Ranked retrieval - Vector Space Models -,  text-similarity metrics - TF-IDF (term frequency/inverse document frequency) weighting - cosine similarity, Probabilistic Models, Evaluations on benchmark text collections. (8)"
                },
                {
                    "title": "QUERY PROCESSING:",
                    "content": "Query Operations and Languages- Query expansion; Experimental Evaluation of IR: Performance metrics: recall, precision, and F-measure. (5)"
                },
                {
                    "title": "TEXT CATEGORIZATION AND CLUSTERING:",
                    "content": "Categorization: Rocchio; Naive Bayes, kNN; Clustering:  Agglomerative clustering; k-means; Expectation Maximization (EM); Dimension Reduction: LSI, PCA.  (6)"
                },
                {
                    "title": "WEB SEARCH: IR Systems and the WWW - Search Engines: Spidering, Meta Crawlers and near duplicate pages, Question answering,  ; Link analysis: Hubs and Authorities, Google PageRank, Duplicate Detection.   (5)",
                    "content": ""
                },
                {
                    "title": "INFORMATION FILTERING TECHNIQUES:",
                    "content": "introduction to Information Filtering, Relevance Feedback - Applications of Information Filtering: RECOMMENDER SYSTEMS: Collaborative filtering and Content-Based recommendation of documents and products.   (6)"
                },
                {
                    "title": "INFORMATION EXTRACTION AND INTEGRATION:",
                    "content": "Extracting data from text; Basic Techniques: Named Entity Recognition, Co-reference Resolution, Relation Extraction, Event Extraction; Extracting and Integrating specialized information on the Web, Web Mining and Its Applications.  (6)"
                }
            ],
            "textbooks": [
                "1.\tChristopher D. Manning, Prabhakar Raghavan and Hinrich Schütze, “Introduction to Information Retrieval”, Cambridge University Press, 2012.",
                "2.\tStefan Büttcher, Charles L. A. Clarke, Gordon V. Cormack, “ Information Retrieval – Implementing and Evaluating Search Engines “, The MIT Press, 2016",
                "3.\tB.Croft, D. Metzler, T. Strohman, “Search Engines: Information Retrieval in Practice”, Pearson Education, 2015."
            ]
        },
        {
            "code": "21X0",
            "title": "AF AUGMENTED AND VIRTUAL REALITY",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO VR AND AR:",
                    "content": "Overview of class, logistics, history of VR/AR.  (5)"
                },
                {
                    "title": "THE GRAPHICS PIPELINE AND OPENGL:",
                    "content": "Overview and Transformations: rotation, translation, scaling, model view matrix, projection matrix, Lighting and Shading.  (7)"
                },
                {
                    "title": "OPENGL SHADING LANGUAGE (GLSL):",
                    "content": "GLSL vertex and fragment shaders.   (5)"
                },
                {
                    "title": "THE HUMAN VISUAL SYSTEM:",
                    "content": "Perception of depth, color, contrast, resolution, Stereo Rendering.  (5)"
                },
                {
                    "title": "HEAD MOUNTED DISPLAY OPTICS:",
                    "content": "Magnifier designs, stereo rendering for HMDs, lens distortion correction, advanced HMD optics.    (7)"
                },
                {
                    "title": "INERTIAL MEASUREMENTS UNITS:",
                    "content": "gyros, accelerometers, magnetometers, sensor fusion, complementary filter, Arduino  (6)"
                },
                {
                    "title": "POSITIONAL TRACKING:",
                    "content": "Tracking with the light house, advanced positional tracking – Spatial Sound.  (5)"
                },
                {
                    "title": "CREATING CONTENT IN VR AND AR:",
                    "content": "Assessing design software – Capturing real life – Assessing development Software-Distributing content – Applications of AR and VR   (5)"
                }
            ],
            "textbooks": [
                "1.\tMarschner, Shirley, “Fundamentals of Computer Graphics”, CRC Press, 2016.",
                "2.\tLa Valle, “Virtual Reality”, Cambridge University Press, 2016.",
                "3.\tErin Pangilinan, Steve Lukas and Vasanth Mohan, “Creating Augmented and Virtual Realities: Theory and Practice for Next Generation Spatial Computing”, O‟Reilly Publisher, 2019"
            ]
        },
        {
            "code": "21X0",
            "title": "AG COMPUTER VISION",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "OVERVIEW:",
                    "content": "Computer Imaging Systems: Image formation and Sensing, Color representation, Image Acquisition, Image digitization, Noise, Image Representation.  (4)"
                },
                {
                    "title": "DIGITAL IMAGE ANALYSIS:",
                    "content": "Preprocessing, Binary Image Analysis, Edge detection - First order derivative, Second order detection, Color edge detection, Pyramid edge detection, Edge linking and boundary detection, Segmentation - Region based segmentation, clustering techniques, boundary detection, thresholding.  (10)"
                },
                {
                    "title": "IMAGE ENHANCEMENT:",
                    "content": "Gray-Scale Modification, Image Sharpening, Image Smoothing - Image Restoration - Noise Models, Noise removal using spatial filters, Geometric transforms, Image Reconstruction.  (7)"
                },
                {
                    "title": "IMAGE FEATURE ANALYSIS:",
                    "content": "Overview, Feature Extraction - Shape, histogram, color, spectral, textural features, feature Analysis.   (6)"
                },
                {
                    "title": "MORPHOLOGICAL OPERATIONS:",
                    "content": "Binary Dilation, Erosion, Opening and Closing, Hit-or-Miss Transform, Basic Morphological Algorithms, Extension to Gray-Scale Images.   (5)"
                },
                {
                    "title": "IMAGE COMPRESSION:",
                    "content": "Basic requirements, Types of compression, Coding Algorithms.  (5)"
                },
                {
                    "title": "APPLICATIONS:",
                    "content": "Image Classification, CBIR, CBVR, Object Recognition, Biometrics, Document processing, Augmented Reality.   (8)"
                }
            ],
            "textbooks": [
                "1.\tUmbaugh, S. E., “Digital image processing and analysis: human and computer vision applications with CVIP tools”, CRC press, 2010.",
                "2.\tNagabhushan S, “Computer Vision and Image Processing”, New Age International, 2005."
            ]
        },
        {
            "code": "21X0",
            "title": "AH DEVOPS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "DEVOPS :",
                    "content": "Introduction – Need for DevOps - DevOps Perspective - DevOps and Agile - Team Structure – Barriers   (3)"
                },
                {
                    "title": "THE CLOUD AS A PLATFORM:",
                    "content": "Introduction – Features of Cloud – DevOps Consequences of the unique cloud Features   (3)"
                },
                {
                    "title": "OPERATIONS:",
                    "content": "Introduction – Operations Services – Operations and DevOps – Overall Architecture Structure  (3)"
                },
                {
                    "title": "BUILDING AND TESTING:",
                    "content": "Moving a System through Deployment pipeline – Production – Incidents – Deployment – Monitoring.  (9)"
                },
                {
                    "title": "SECURITY AND SECURITY AUDITS:",
                    "content": "Security Threats – Identity Management – Access Control – Repeatability – Performance – Reliability – Recoverability – Interoperability – Testability – Modifiability Measurement and compliance to DevOps practices - Points of Interaction between Dev and Ops.  (10)"
                },
                {
                    "title": "SUPPORTING MULTIPLE DATACENTERS:",
                    "content": "Implementing a continuous deployment pipeline for Enterprises - Migrating to Microservices - Operators as a process - The Future of DevOps.  (12)"
                },
                {
                    "title": "CASE STUDIES: Tools – Jenkins – Kamatera – Docker.  (5)",
                    "content": ""
                }
            ],
            "textbooks": [
                "1.\tLen Bass, Ingo Weber, Liming Zhu, “DevOps: A Software Architect‟s Perspective”, Addison-Wesley Professional, 2015",
                "2.\tGene Kim, John Willis, Patrick Debois, Jez Humble, John Allspaw, “DevOps Handbook”, IT Revolution Press, 2016."
            ]
        },
        {
            "code": "21X0",
            "title": "O1 CRYPTOGRAPHY",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "MATHEMATICS OF CRYPTOGRAPHY:",
                    "content": "Fundamental theorem of arithmetic (statement only) - Divisibility - Euclidean and \n                            Extended Euclidean algorithms, Primes - Euler totient function- Fermat‟s little theorem, Modular arithmetic- Computing modular \n                            inverse – modular exponentiation - efficient algorithms, generators and primitive roots in groups - Solving linear congruence‟s -\n                            Chinese remainder theorem(9)"
                },
                {
                    "title": "BASIC CRYPTOGRAPHIC TECHNIQUES:",
                    "content": "Encryption and Decryption, Classical ciphers- Substitution ciphers -\n                            Monoalphabetic ciphers -Polyalphabetic ciphers – one time pad – transposition ciphers – Cryptanalysis.(8)"
                },
                {
                    "title": "SYMMETRIC KEY CRYPTOGRAPHY:",
                    "content": "Stream ciphers – Block ciphers – DES – Modes of operation.(6)"
                },
                {
                    "title": "PUBLIC KEY CRYPTOGRAPHY:",
                    "content": "Concept of public key cryptography – Hard problem - Factorization Problem - Discrete Log \n                            Problem - RSA cryptosystem - ElGamal cryptosystem – Cryptanalysis (6)"
                },
                {
                    "title": "DATA INTEGRITY TECHNIQUES:",
                    "content": "Symmetric techniques - Cryptographic hash functions – MAC, Asymmetric techniques –\n                            Digital signatures – RSA signature - ElGamal signature.(10)"
                },
                {
                    "title": "AUTHENTICATION AND KEY DISTRIBUTION PROTOCOLS:",
                    "content": "Data origin authentication and entity authentication – \n                            password based authentication– Challenge response protocols – Fiat Shamir protocol - Symmetric key distribution –\n                            Kerberos – Symmetric Key Agreement Protocol – Diffie-Hellman key Agreement – Public key distribution - Digital \n                            Certificates.(8)"
                },
                {
                    "title": "Tutorial Practice:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1. Douglas R Stinson, “Cryptography Theory and Practice”, CRC Press,2018.",
                "2. Jonathan Katz, Yehuda Lindell, “Introduction to Modern Cryptography”,CRC press, 2015.",
                "3. Victor Shoup, “A Computational introduction to Number Theory and Algebra”, Cambridge University Press, 2012"
            ]
        },
        {
            "code": "21X0",
            "title": "O2 NUMERICAL ANALYSIS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "TYPES OF ERRORS:",
                    "content": "types of errors.(3)"
                },
                {
                    "title": "SOLUTION OF ALGEBRAIC EQUATIONS:",
                    "content": "Bisection method, method of false position, Newton Raphson method, modified \n                            Newton Raphson method, Graeffe‟s method, Bairstow‟s method(8)"
                },
                {
                    "title": "SOLUTION OF ALGEBRAIC SIMULTANEOUS EQUATIONS:",
                    "content": "elimination, Gauss Jordan, Crout‟s method - Cholesky \n                            method, Gauss Jacobi method, Gauss – Seidel method. (8)"
                },
                {
                    "title": "EIGENVALUES AND EIGENVECTORS:",
                    "content": "Power method, inverse power method, Jacobi method  (4)"
                },
                {
                    "title": "FINITE DIFFERENCES AND INTERPOLATION:",
                    "content": "difference operators – Interpolation: Newton‟s divided difference \n                            formula, Lagrange‟s interpolation formula, Newton‟s - Gregory forward and backward interpolation. (8)"
                },
                {
                    "title": "DIFFERENTIATION AND INTEGRATION:",
                    "content": "Numerical differentiation using Newton‟s - Gregory forward and backward \n                            polynomials. Numerical Integration: Gaussian Quadrature, Trapezoidal rule, Simpson‟s one third rule(6)"
                },
                {
                    "title": "ORDINARY DIFFERENTIAL EQUATIONS:",
                    "content": "Taylor series method, Euler method and its Modifications, Runge-Kutta methods, \n                            Runge Kutta Fehlberg method, multi-step methods: Adams fourth-order formula, Adams-Moulton method, boundary value \n                            problems : Shooting method. (8)"
                },
                {
                    "title": "Tutorial Practice:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1. Steven C. Chapra and Raymond P. Canale, “Numerical Methods for Engineers with Software and Programming",
                "2. Curtis F. Gerald, and Patrick O. Wheatley, “Applied Numerical Analysis” Pearson, 2011.",
                "3. Yousef Saad. “Numerical methods for large eigen value problems”, University Press, 2011"
            ]
        },
        {
            "code": "21X0",
            "title": "O2 NUMERICAL ANALYSIS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO CYBER CRIME:",
                    "content": "Cyber Crime and Information Security-Types of cyber-crime- Nature of crime-Categories \n                            of cyber-crime-Social engineering-Identify theft.(6)"
                },
                {
                    "title": "CYBERCRIME FUNDAMENTALS & ISSUES:",
                    "content": "access to computers, Internet hacking & Cracking, Viruses & \n                            malicious code, Software piracy- Cyberstalking - Social media crimes-Understanding social media marketing - Best practices \n                            with use of Social marketing tools - Case studies. (8)"
                },
                {
                    "title": "HACKING NETWORKS:",
                    "content": "Web application & Web server hacking - Hacking wireless networks: Standards – protocols\u0002Architectures – Vulnerability – Network protection and Security devices (8)"
                },
                {
                    "title": "INVESTIGATION:",
                    "content": "Cybercrime Investigations-Evidence handling - Collection & Preservation -E-mail & Mobile tracking - IP \n                            tracking - Password cracking and Evidence recovery. (8)"
                },
                {
                    "title": "DEFENSE AND ANALYSIS TECHNIQUES:",
                    "content": "Threat, Types of Threat, Vulnerabilities, Controls and Counter measures, Attacks \n                            examples – Reconnaissance attack, Access attacks, Masquerading, IP Spoofing, and Denial of Service attack, Distributed \n                            Denial of Service- Honeypots – DNS-Firewall.(8)"
                },
                {
                    "title": "LAWS & ACTS:",
                    "content": "perspective-India & global, IT ACT, CrPC, IPC, IPR in cyberspace, Cyber ethics, Evidence Act & Privacy \n                            Act-Guidelines and computer usage policy.(7)"
                },
                {
                    "title": "Tutorial Practice:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1. James Graham, Richard Haward and Ryan Olson, “Cyber Security Essentials” CRC Press, 2011.",
                "2. Charles P. Pfleeger and Shari Lawrence Pfleeger, “Analyzing Computer Security – A threat/vulnerability / Counter measure",
                "3. Charles J. Brooks, Christopher Grow, Philip Craig and Donald Short, “Cyber Security Essentials”, Wiley 2018."
            ]
        },
        {
            "code": "21X0",
            "title": "O4 ENTERPRENEURSHIPS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO ENTREPRENEURSHIP:",
                    "content": "– Characteristics and Functions of an Entrepreneur – Common myths \n                            about entrepreneurs – Importance or Entrepreneurship. Seminar in R5 & R6(5)"
                },
                {
                    "title": "CREATIVITY AND INNOVATION:",
                    "content": "The role of creativity – The innovation Process – Sources of New Ideas – Methods of \n                            Generating Ideas – Creative Problem Solving – Entrepreneurial Process (6)"
                },
                {
                    "title": "DEVELOPING AN EFFECTIVE BUSINESS MODEL:",
                    "content": "Importance of a Business Model – Starting a small scale industry -\n                            Components of an Effective Business Model. (5)"
                },
                {
                    "title": "APPRAISAL OF PROJECTS:",
                    "content": "Importance of Evaluating Various options and future investments- Entrepreneurship incentives \n                            and subsidies – Appraisal Techniques. (8)"
                },
                {
                    "title": "FORMS OF BUSINESS ORGANIZATION:",
                    "content": "Proprietorship – Partnership – Limited liability partnership - Joint Stock \n                            Companies and Cooperatives.(4)"
                },
                {
                    "title": "FINANCING THE NEW VENTURE:",
                    "content": "Determining Financial Needs – Sources of Financing – Equity and Debt Funding – Case \n                            studies in Evaluating Financial Performance.(8)"
                },
                {
                    "title": "THE MARKETING FUNCTION:",
                    "content": "Analysis – Competitor Analysis – Marketing Research for the New Venture – Defining \n                            the Purpose or Objectives – Gathering Data from Secondary Sources – Gathering Information from Primary Sources –\n                            Analyzing and Interpreting the Results – The Marketing Process.(5)"
                },
                {
                    "title": "INTELLECTUAL PROPERTY PROTECTION AND ETHICS:",
                    "content": "– Copyright - Trademark- Geographical indications –\n                            Ethical and social responsibility and challenges.(4)"
                },
                {
                    "title": "Tutorial Practice:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1. Donald F.Kuratko and Richard M.Hodgetts, “Entrepreneurship : Theory, Process and Practice”, South-Western, 2007.",
                "2. Vasant Desai, “The Dynamics of Entrepreneurial Development and Management”, Himalaya Publishing House, 2010."
            ]
        },
        {
            "code": "21X0",
            "title": "O5 HUMAN COMPUTER INTERFACE DESIGN",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "Introduction:",
                    "content": "Human – Machine – Interaction – Paradigms. (8)"
                },
                {
                    "title": "Interaction Design:",
                    "content": "Process – Navigation – Screen Design and Layout – HCI in the Software Process – Design Rules – Evaluation Techniques – Universal Design – User Support. (8)"
                },
                {
                    "title": "Interaction Models:",
                    "content": "Cognitive Models – Socio-organizational Issues and Stakeholder Requirements – Communication and Collaboration Models. (8)"
                },
                {
                    "title": "Task Analysis:",
                    "content": "Introduction - Task Decomposition – Knowledge Based Analysis – ER based Techniques – Uses. (8)"
                },
                {
                    "title": "User Interface Design:",
                    "content": "Dialog Design – Diagrammatic Notations – Textual Dialog notations – Dialog Semantics – Dialog Analysis and Design - Modelling Rich Interaction. (8)"
                },
                {
                    "title": "Utilities:",
                    "content": "Groupware – Ubiquitous Computing and Augmented Realities – Hypertext, Multimedia and WWW. (5)"
                },
                {
                    "title": "Tutorial Practice:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1. Alan Dix, Janet Finlay, Gregory D. Abowd, Rusell Beale, “Human Computer Interaction”, Pearson Education, 2009",
                "2. Ben Shneiderman, Catherine Plaisant, Maxine S.Cohen, Steven M.Jacobs, Nicholas Diakopoulos and Niklas Elmqvist, “Designing the User Interface: Strategies for Effective Human-Computer Interaction”, Addison Wesley, 2017."
            ]
        },
        {
            "code": "21X0",
            "title": "O6 INTERNET OF THINGS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO IoT:",
                    "content": "Introduction to Internet of Things (IoT) – Machine to Machine (M2M) –- Features and Definition of IoT– Recent Trends in the Adoption of IoT – Societal Benefits. (2)"
                },
                {
                    "title": "IoT ARCHITECTURE:",
                    "content": "Functional Requirements - IoT Enabling Technologies – IPv6 - Basic Architecture - Components of IoT:  Embedded Computation Units, Microcontrollers, System on Chip (SoCs) - Sensors –  Actuators – Communication Interfaces. (7)"
                },
                {
                    "title": "RF COMMUNICATION TECHNOLOGIES IN IoT:",
                    "content": "Wireless Sensor Networks (WSN): Overview, Fault Tolerance - RFID – NFC - Low Power Personal Area networks (LowPAN): Overview, 6LowPAN, IEEE 802.15.4, BLE, Zigbee, Zwave, and Thread - WiFi - Low Power Wide Area Networks (LPWAN): Concepts and features, SigFox, LoraWAN, LPWAN-3GPP, Comparing different LPWAN technologies. (7)"
                },
                {
                    "title": "APPLICATION LAYER PROTOCOLS IN IoT:",
                    "content": "Rest Architecture - HTTP – CoAP: Architecture, Features, Applications - MQTT: Architecture, Feature, Applications - Comparing different IoT Application Layer Protocols. (7)"
                },
                {
                    "title": "MODERN NETWORKING:",
                    "content": "Cloud Computing: Introduction to the Cloud Computing, Cloud service options, Cloud Deployment models, Load balancing, Hypervisors, Comparison of Cloud providers - Software Defined Networking(SDN): Overview, Architecture, Rule placement, OpenFlow Protocol, Relevance of SDN to IoT. (7)"
                },
                {
                    "title": "SECURITY IN IoT:",
                    "content": "IEEE 802.11 Wireless Networks Attacks: Basic Types, WEP Key Recovery Attacks, Keystream Recovery Attacks against WEP – RFID Security – Security Issues in ZigBEE: Eavesdropping Attacks, Encryption Attacks – Bluetooth Security: Threats to Bluetooth Devices and Networks – Blockchain in IoT security. (9)"
                },
                {
                    "title": "PROTOTYPING:",
                    "content": "Prototyping embedded devices - Open Source versus Closed Source - Embedded Computing Basics - Arduino - Raspberry Pi - Implementation. (2)"
                },
                {
                    "title": "APPLICATIONS IN IoT:",
                    "content": "Smart homes – Energy – Health Care – Smart Transportation – Smart Living – Smart Cities- Smart Grid – Smart Agriculture. (2)"
                },
                {
                    "title": "ROBOTS:",
                    "content": "Introduction to Robotic Process Automation. (2)"
                },
                {
                    "title": "Tutorial Practice:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1.\tDieter Uckelmann, Mark Harrison, Florian Michahelles, “Architecting the Internet of Things”, Springer, 2011",
                "2.\tAdrian McEwen and Hakim Cassimally, “Designing the Internet of Things”, John Wiley and Sons, 2014.",
                "3.\tThomas Erl, Dr.ZaighamMahmood, Professor Ricardo Puttini,\"Cloud Computing: Concepts, Technology & Architecture\", PHI, 2013",
                "4.\tBrian Russell, Drew Van Duren, \"Practical Internet of Things Security\", Packt Publishing, 2016."
            ]
        },
        {
            "code": "21X0",
            "title": "O7 ENVIRONMENTAL SCIENCE AND GREEN COMPUTING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "NATURAL RESOURCES, ECOSYSTEMS AND BIODIVERSITY:",
                    "content": "Environment, Definition, Scope and importance, Forest resources, Use and overexploitation, Water resources: Use and over utilization. Eco system; Structure and functions of an eco system, energy flow in the eco system.  Bio Diversity; values of biodiversity, biodiversity at global, national and local levels – threats to bio diversity.  Conservation of bio diversity – In-situ & Ex-situ conservation. (9)"
                },
                {
                    "title": "ENERGY SOURCES:",
                    "content": "Growing energy needs, Renewable and non renewable energy sources, Hydro power, Solar Power:  Photovoltaic Energy – Motivation for going Solar – Solar Electricity – PV cells. Wind Power: – Using the Wind: Generating Power at Remote Sites,– Measuring the Wind – Estimating the output.  Use of alternate energy sources. (9)"
                },
                {
                    "title": "ENVIRONMENTAL POLLUTION AND DISASTER MANAGEMENT:",
                    "content": "Definition – causes, effects and control measures of air pollution, water pollution, soil pollution, noise pollution, thermal pollution and nuclear hazards. Disaster management - floods, earthquake, cyclone and landslides. Solid waste management - causes, effects and control measures of municipal solid wastes (Biomedical wastes, hazardous wastes). Role of an individual in prevention of pollution. (9)"
                },
                {
                    "title": "SOCIAL ISSUES AND THE ENVIRONMENT:",
                    "content": "From unsustainable to sustainable development, Urban problems related to energy, Water conservation, Rain water harvesting, Watershed management, Environment and human health, Role of information technology in environment and human health. Environment Protection Act: Air (Prevention and Control of Pollution) Act – Water Act,   Forest Conservation Act, Wildlife Protection Act,   Introduction to EIA and ISO 14000. (9)"
                },
                {
                    "title": "GLOBAL ATMOSPHERIC CHANGE & GREEN  FUNDAMENTALS:",
                    "content": "The Atmosphere of Earth – Global Temperature – Global Energy Balance, The  Greenhouse Effect  - Environmental Issues and Green Computing,  Electronic waste management: Introduction;- Environment and society,  producer responsibility legislation – the Waste Electrical and Electronic Equipment (WEEE) directive,  Materials Composition of WEEE: Mobile Phones – Television – Washing Machines, - Current and new electronic waste recycling technology- Future perspectives of electronic scrap. (9)"
                },
                {
                    "title": "Tutorial Practice:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1.\tMackenzie L. Davis, and David A. Cornwell, “Introduction to Environmental Engineering”, Tata McGraw Hill, 2012.",
                "2.\tChetan Singh Solanki, “Solar Photovoltaics”, PHI Learning Private Ltd., 2015.",
                "3.\tSiraj Ahmed, “Wind Energy : Theory and Practice”, PHI Learning Private Ltd., 2016",
                "4.\tMahajan S. P. Pollution Control in Process Industries, Tata McGraw Hill, 2011",
                "5.\tHester R.E. and Harrison R.M. “Electronic Waste Management”, Royal Society of Chemistry, 2009."
            ]
        }
    ],
    "url": "https://amcsregulations.psgtech.ac.in/curriculum/bsccsd/2020/syllabi.html",
    "coordinator": "Dr.Poomagal S"
}