{
    "program_name": "M.Sc Cyber Security",
    "year": "2020",
    "courses": [
        {
            "code": "20XC11",
            "title": "CALCULUS AND ITS APPLICATIONS",
            "semester": 1,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "LIMITS AND CONTINUITY:",
                    "content": "Graphs of standard functions of single variable, Limit, continuity, piecewise continuity, periodic, differentiable, Riemann sum, integrable functions, fundamental theorem of calculus. (10+6)"
                },
                {
                    "title": "SEQUENCES & SERIES:",
                    "content": "Sequences – increasing, decreasing, bounded, function limit properties - Series – convergence and divergence – alternating series test, absolute convergence – ratio test, power series, Taylor series (single variable). (8+6)"
                },
                {
                    "title": "FUNCTIONS OF TWO VARIABLES:",
                    "content": "Models, partial derivative and its geometrical interpretation.  Stationary points – maxima and minima- saddle points. Taylor series. Constrained maxima and minima – Lagrange multiplier method. (6+4)"
                },
                {
                    "title": "MULTIPLE INTEGRALS:",
                    "content": "Evaluation of multiple integrals – Cartesian and polar forms, Change of order of integration - Applications of multiple integrals to find area and volume. (9+6)"
                },
                {
                    "title": "ORDINARY DIFFERENTIAL EQUATIONS:",
                    "content": "Linear Differential Equations of first order - Exact differential equations, Integrating factors, Bernoulli equations -Linear Differential Equations of higher order with constant coefficients -Euler's equation with variable coefficients - Simultaneous equations - Method of variation of parameters. Modeling simple systems. \t\t(12+8)"
                }
            ],
            "textbooks": [
                "1.\tThomas G B Jr., Maurice D Wier, Joel Hass, Frank R. Giordano, “Thomas’ Calculus”, Pearson Education, 2017.",
                "2.\tErwin Kreyszig, “Advanced Engineering Mathematics”, John Wiley, 2014."
            ]
        },
        {
            "code": "20XC12",
            "title": "ENGLISH FOR PROFESSIONAL SKILLS",
            "semester": 1,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "COMMUNICATION SKILLS USING SCIENTIFIC TEXTS:",
                    "content": "Comprehension and critical evaluation of Scientific Essays – Focus on Language Style, Word Formation, Use of Prefixes and Suffixes, Synonyms, Antonyms, Abbreviations and Acronyms and Technical Vocabulary.(6)"
                },
                {
                    "title": "FOCUS ON GRAMMAR:",
                    "content": "Identifying Common Errors In Articles And Prepositions, Common Errors-Misplaced Modifiers-Tenses-Redundancies And Clichés-Practice Exercises In Common Errors. (6)"
                },
                {
                    "title": "READING:",
                    "content": "Reading and Importance-Techniques Of Effective Reading-Improving Comprehension Skills-Techniques For Good Comprehension-Skimming And Scanning-Comprehension-Intensive And Extensive Reading-Practice In Reading Comprehension.(4)"
                },
                {
                    "title": "WRITING:",
                    "content": "Formal Letters-Letter of Complaint, Requisition Letter- Job Application and Resume- Report Writing- Types Of Reports- Business And Technical Reports.(6)"
                },
                {
                    "title": "FOCUS ON SOFT SKILLS:",
                    "content": "Intra & Interpersonal Communication-Interview Techniques-Etiquette-Body Language-Telephone Conversation. (8)"
                },
                {
                    "title": "PRACTICALS:",
                    "content": "Presentations-Group Discussions-Listening Exercises-Mock Interviews. (15)"
                }
            ],
            "textbooks": [
                "1.\tN.P.Sudharshana, C. Savitha “English for Engineers”, Cambridge University Press, 2018."
            ]
        },
        {
            "code": "20XC13",
            "title": "APPLIED PHYSICS",
            "semester": 1,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "MECHANICS:",
                    "content": "Displacement. First, second and third order time-derivatives of displacement. Concept of generalised coordinates. Inertial mass, moment of inertia, force, torque. Equilibrium and principle of virtual work. 2D Motion in a gravitational field. Conservative and non-conservative force-fields. Conservation of momentum. Elastic and inelastic collisions. Energy loss and deformation in inelastic collisions. Energy absorbed in material fracture. Applications to packaging, protection and inspection of equipment. (12)"
                },
                {
                    "title": "MECHANICAL OSCILLATIONS:",
                    "content": "Hooke’s law. Characteristics of a spring and damper. Differential equation of a spring, mass and damper system and its solution. Natural frequency. Forced oscillations. Frequency response of the system and resonance. Damping and energy dissipation. Application to vibration control and shock absorbers. Considerations for mechanical isolation of equipment. Magneto-rheological fluids and application to adaptive dampers. (12)"
                },
                {
                    "title": "HEAT AND THERMAL CONTROL:",
                    "content": "Temperature, specific heat-capacity. Temperature and temperature gradient in heat flow. Temperature gradient due to internal and external heat sources. Thermal conductivity. Differential equation of one and two dimensional heat conduction. Boundary conditions and solutions. Thermal insulation. Principles of convective and radiative heat transfer. Heat sinks and heat pipes for heat removal from equipment. Forced air convection. (12)"
                },
                {
                    "title": "HYGROMETRY:",
                    "content": "Air and water-vapour mixtures. Saturation and condensation of moisture from air and its relation to temperature. Dew point. Moisture condensation in electronic equipment and its hazards. Relative humidity. Measurement of relative humidity by dry and wet bulb methods.  Humidity sensors and software support for hygrometry. Need  for  humidity control in installations and equipment. Methods to control humidity. Humidifiers, driers and dessicators. (12)"
                },
                {
                    "title": "OPTICS:",
                    "content": "Light propagation through non-homogeneous refractive media. Fermat’s principle and  determination of optical path. Application to light propagation through optical fibres. Numerical aperture. Step-index and graded-index fibres, single mode and multi-mode fibres. Multiplexing and modulation. Bandwidth advantage. Digital optical communication principles. Pulse-broadening in digital communication by optical fibres. Signal degradation due to attenuation and dispersion. Advantages of optical communication. (12)"
                }
            ],
            "textbooks": [
                "1. Halliday, David, Robert Resnick, and Jearl Walker. “Fundamentals of Physics”,  John Wiley & Sons, 2010",
                "2. Richard. Wolfson. “Essential University  Physics with Mastering Physics”, Pearson education Limited, 2015",
                "3. Young, Hugh D., Roger A. Freedman,” University Physics with Modern Physics”, Pearson Education, 2017."
            ]
        },
        {
            "code": "20XC14",
            "title": "DIGITAL SYSTEM DESIGN",
            "semester": 1,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Basic principles of System Design -Building blocks for Computer Systems; CPU, Storage, I/O, Multimedia devices - Functional components of a computer system- Workstations, Servers - Interaction among functional components. (4)"
                },
                {
                    "title": "NUMBER REPRESENTATION:",
                    "content": "Binary - Octal - Hexadecimal - BCD - excess three - Gray codes - Error correcting and detecting codes - Representation of signed numbers – arithmetic operation on signed numbers - Alphanumeric data representation. (5)"
                },
                {
                    "title": "BOOLEAN ALGEBRA AND LOGIC GATES:",
                    "content": "Boolean relations - Laws and theorems - AND, OR, NOT, NAND and NOR gates - exclusive OR gates - Positive and negative logic systems - Simplifications - Karnaugh maps and simplifications - Don’t care conditions - NAND-NAND realizations-PAL and PLA Logics. (8)"
                },
                {
                    "title": "DESIGN OF ARITHMETIC AND LOGIC UNIT:",
                    "content": "Combinational logic circuits – Encoder, Decoder, Multiplexer and Demultiplexer -Representation of integer data, Integer adders, Integer multipliers, Design of integer unit- floating point representation of real data-IEEE representation  Floating-point adder/subtractor- Floating-point multiplier, Design of Floating point unit- design of ALU. (10)"
                },
                {
                    "title": "DESIGN OF REGISTERS AND MEMORY UNIT:",
                    "content": "Flip-flops, Synchronous sequential circuits – Registers and Counters; Memory unit construction – State Machine Design - State machine as a sequential controller; Moore and Mealy state machines; Derivation of state graph and tables; Sequence detector (8)"
                },
                {
                    "title": "PROGRAM EXECUTION:",
                    "content": ": Processing of High Level Language Code:- Assembler- Code generation,-Application binary interface-Interpreter - simple compiler - Instruction set architecture of a simple CPU, Micro architecture of CPU, Generation and Execution of machine code- The hardware-software interface -Hardware features influenced by software requirements - Specifications of the performance of a system (10)"
                }
            ],
            "textbooks": [
                "1.\tC.H. Roth and L.L.Kinney, “Fundamentals of Logic Design”,  Cengage Learning, 2014",
                "2.\tWilliam Stallings, “Computer Architecture and Organization Designing for Performance”, Pearson Education, 2014.",
                "3.\tDavid A. Patterson, John L. Hennessy, “Computer Organization and Design: The Hardware/Software Interface”, Morgan Kaufmann, 2013.",
                "4.\tC.Hamacher, Z.Vranesic, S.Zaky and N.Manjikian, “Computer Organization and Embedded Systems”, McGraw-Hill, 2012.",
                "5.\tN. Nisan and S. Schocken, “The Elements of Computing Systems – Building a Modern Computer from First Principles”, The MIT Press, 2005."
            ]
        },
        {
            "code": "20XC15",
            "title": "PROBLEM SOLVING AND C PROGRAMMING",
            "semester": 1,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "PROBLEM SOLVING:",
                    "content": "Introduction to Problem Solving- Program development- Analyzing and Defining the Problem- Algorithm-Flow Chart - Programming languages-Types of programming languages- Program Development Environment. (5)"
                },
                {
                    "title": "C LANGUAGE:",
                    "content": "Introduction to C Language -  C Character Set - Identifiers and Keywords - Data Types – Literal Constants - Variables – l-value-r-value - Qualifiers – Modifiers - Operators and Expressions – Type conversions - Library Functions - Data Input and Output Functions – escape sequence characters – Formatted input and output. (6)"
                },
                {
                    "title": "CONTROL STATEMENTS:",
                    "content": "Making Decisions : If Statement – If/else Statement - If/else if Statement – Nested if Statements – dangling else - Switch Multiple Selection Statement– Repetition : Repetition Essentials - While Loop – do-While Loop – For Loop – Nested Loops  – Breaking out of a Loop  Continue statement  – goto Statement (6)"
                },
                {
                    "title": "FUNCTIONS:",
                    "content": "Modular Programming – Function Prototypes - Defining and Calling Functions –Function Call Stack and Activation Records - Passing Arguments to Functions – Returning a value from a function- Recursion – Recursion vs. Iteration – Scope and lifetime of variables – Memory layout of a C program - Storage Classes - Auto - Static - Extern and Register Variables. (8)"
                },
                {
                    "title": "ARRAYS:",
                    "content": "Defining Array –Array Initialization - Accessing array elements - Processing arrays - Arrays as function arguments - Multidimensional arrays – Memory address calculation of an array – Row major and column major order - String Handling. (8)"
                },
                {
                    "title": "POINTERS:",
                    "content": "Pointer Variable Definitions and Initializations – Passing Arguments to Functions by address – Pointer Expressions and Pointer Arithmetic - Relationship between Pointers and Arrays  - Pointers and multidimensional arrays –Constant Pointer – Pointer to Constant –NULL pointer- dangling pointers - Pointers to functions - passing functions to other functions – Introduction to Stack and Heap Memory - Dynamic Memory Allocation. (10)"
                },
                {
                    "title": "STRUCTURES AND UNIONS:",
                    "content": "Structure Definitions – Initializing Structures – Accessing Structure Members -  Processing a structure - typedef- Structures and pointers - Passing structures to functions – Self-Referential Structures- Bit fields - Unions – Enumeration Constants (8)"
                },
                {
                    "title": "FILES:",
                    "content": "Files and Streams - Operations on Files – Types of Files, Various Read and Write Functions for Sequential-Access and Random-Access Files -Command Line Arguments. (5)"
                },
                {
                    "title": "PREPROCESSOR DIRECTIVES:",
                    "content": ": #include Preprocessor Directive - #define Preprocessor Directive: Symbolic Constants - #define Preprocessor Directive : Macros - Conditional Compilation (5)"
                }
            ],
            "textbooks": [
                "1.\tBrian W. Kernighan and Dennis Ritchie, “The C Programming Language”, Pearson Education India, 2015",
                "2.\tR G Dromey, “How to solve it by Computer”, Pearson ,2008."
            ]
        },
        {
            "code": "20XC16",
            "title": "MATHEMATICAL FOUNDATIONS LAB",
            "semester": 1,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XC17",
            "title": "C PROGRAMMING LAB",
            "semester": 1,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XC18",
            "title": "APPLIED PHYSICS AND DIGITAL ELECTRONICS LAB",
            "semester": 1,
            "course_type": "regular",
            "credits": "0 0 2 1",
            "content": [
                {
                    "title": "APPLIED PHYSICS LABORATORY:",
                    "content": "1.  Determination of the moment of inertia of a flywheel.\n                        2.  Verification of Hooke's law using spring-mass system.\n                        3.  Determination of thermal conductivity of bad conductor - Lee's disc method.\n                        4.  Determination of thermal conductivity of good thermal conductor-Forbes method.\n                        5.  Determination of the relative humidity by using wet and dry bulb hygrometer.\n                        6.  Determination of refractive index of liquids using hollow prism."
                }
            ]
        },
        {
            "code": "20XC21",
            "title": "DISCRETE STRUCTURES",
            "semester": 2,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "MATHEMATICAL LOGIC:",
                    "content": "Proposition - Logical operators - Truth tables – Laws of Logic – Equivalences – Normal forms - Rules of \n                    inference - Validity of arguments – Consistency of specifications – Propositional  Calculus – Quantifiers and universe of discourse. (10+7)"
                },
                {
                    "title": "PROOF TECHNIQUES:",
                    "content": "Introduction – Methods of proving theorems – Direct proofs, Indirect proofs – Mathematical induction – Strong mathematical induction and well ordering. (6+4)"
                },
                {
                    "title": "RELATIONS AND FUNCTIONS:",
                    "content": "Definition and properties of binary  relations – Representing Relations – Closures of Relations – Composition of Relations – Equivalence Relations – Partitions and Covering of Sets – Partial Orderings – n-ary Relations and their Applications.  Functions - Injective, Surjective, Bijective functions, Composition, Identity and Inverse (9+7)"
                },
                {
                    "title": "COMBINATORICS:",
                    "content": "Basics of counting – The Pigeonhole principle - Permutations and Combinations with and without repetition, Permutations with indistinguishable elements, distribution of objects - Generating permutations and combinations in lexicographic order. (8+4)"
                },
                {
                    "title": "RECURRENCE RELATIONS:",
                    "content": "Some Recurrence Relation Models- Solutions of  linear homogeneous recurrence relations with constant coefficients- solution of linear non-homogeneous recurrence relations by the method of characteristic roots. (5+4)"
                },
                {
                    "title": "GRAPHS AND TREES:",
                    "content": "Graph terminologies - graph models – special types of graphs - ismorphic graphs- connectivity- Euler and Hamiltonian path--graph coluring- trees- spanning trees. (7+4)"
                }
            ],
            "textbooks": [
                "1.\tKenneth H Rosen, “Discrete Mathematics and its Application”, McGraw Hill, 2017.",
                "2.\tTremblay J P and Manohar R, “Discrete Mathematical Structures with application to Computer Science”, Tata McGraw Hill, 2017."
            ]
        },
        {
            "code": "20XC22",
            "title": "ALGEBRA AND NUMBER THEORY",
            "semester": 2,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "GROUPS:",
                    "content": "Groups - Definition and Example, Properties, Permutation Groups, Symmetric Groups, Cyclic Groups. Finite groups-Generators and primitive roots-Subgroups – Definition, Cosets -Lagrange’s theorem- Homomorphism.  (6+4)"
                },
                {
                    "title": "RINGS:",
                    "content": "Definition and Properties – Subrings- Ring of Quaternions – Homomorphism- Integral domain – Ideals and Quotient Rings. (6+4)"
                },
                {
                    "title": "FIELDS & POLYNOMIALS:",
                    "content": "Definition – subfields - Finite fields – structure of Finite field, GF (2n) - Polynomial Rings – Irreducible polynomial over finite fields - Factorization of Polynomials – Primitive polynomials.  (9+6)"
                },
                {
                    "title": "INTRODUCTION TO NUMBER THEORY:",
                    "content": "Divisibility and Primes – Greatest common divisors - fundamental theorem of arithmetic- Euclidean and Extended Euclidean algorithms. (6+4)"
                },
                {
                    "title": "MODULAR ARITHMETIC AND CONGRUENCE:",
                    "content": "Modular operator- Set of residues– modular exponentiation - fast exponentiation algorithms- inverse-congruence- Basic properties - Residue classes –Solving linear congruence’s- Chinese remainder theorem- Linear Diophantine equations–system of linear congruence’s with two unknowns.  (10+6)"
                },
                {
                    "title": "PRIMALITY AND FACTORIZATION:",
                    "content": ": Euler’s Phi function - Fermat’s little theorem - Euler’s theorem -Legendre and Jacobi symbols - Primality testing –Deterministic and probabilistic algorithms - Miller Rabin algorithm - factorization methods -- Pollard's Rho Algorithm-Integer factorization problem - Fermat method – Quadratic congruence - Quadratic residues - Discrete logarithms-Discrete log problem.  (8+6)"
                }
            ],
            "textbooks": [
                "1. Herstein I N., “Topics in Algebra”, John Wiley, 2012.",
                "2. Joseph A. Gallian, “Contemporary Abstract Algebra”, Brooks/Cole, 2013.",
                "3. Victor Shoup, “A Computational introduction to Number Theory and Algebra”, Cambridge University Press, 2012."
            ]
        },
        {
            "code": "20XC23",
            "title": "DATA STRUCTURES",
            "semester": 2,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Primitive Data Structures - Abstract Data Types - Analysis of algorithms – Best and worst case time complexities – Asymptotic notation – Growth of functions. (4)"
                },
                {
                    "title": "ARRAYS:",
                    "content": "Operations and Implementation – Linear search, non-recursive binary search – Sparse matrices – Operations (3)"
                },
                {
                    "title": "STACKS:",
                    "content": "Primitive operations-Applications: Expression Processing, parenthesis matching (4)"
                },
                {
                    "title": "QUEUES:",
                    "content": "Primitive operations – Linear queue, Circular queue, Double ended queue, Priority Queues – Applications (5)"
                },
                {
                    "title": "LISTS:",
                    "content": "Primitive Operations - Singly linked lists, doubly linked lists, Circular lists, multiply linked list– Linked Stacks - Linked queues (6)"
                },
                {
                    "title": "TREES:",
                    "content": "Terminologies - Binary Trees - Sequential and linked representation - Traversals - Expression trees - Infix, Postfix and Prefix expressions-Threaded trees - Max heap and Min heap and their operations. (6)"
                },
                {
                    "title": "DICTIONARY DATA STRUCTURES:",
                    "content": "Binary search tree: Searching – Insertion and deletion of elements – Analysis, Hash Table-hash Function –Collision resolution techniques –linear probing-chaining-   AVL Trees: Searching, insertion and deletion of elements –Analysis.  (10)"
                },
                {
                    "title": "MULTIWAY SEARCH TREES:",
                    "content": "Indexed Sequential Access – m-way search trees – B-Tree – searching, insertion and deletion – B+ trees. (7)"
                }
            ],
            "textbooks": [
                "1.\tYedidyah Langsam, Moshe J Augenstein and Aaron M Tenenbaum, \"Data structures using C and C++\", Prentice Hall, 2016.",
                "2.\tSartaj Sahni, \"Data Structures, Algorithms and Applications in C++\", Silicon Press, 2013",
                "3.\tMichael T. Goodrich, Roberto Tamassia and David Mount, “ Data Structures and Algorithms in C++”, John Wiley, 2016."
            ]
        },
        {
            "code": "20XC24",
            "title": "OBJECT ORIENTED PROGRAMMING",
            "semester": 2,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "PRINCIPLES OF OBJECT ORIENTED PROGRAMMING:",
                    "content": "Software crisis - Software Evolution - Procedure Oriented Programming - Object Oriented Programming Paradigm - Basic Concepts and Benefits of OOP - Object Oriented Programming Language - Application of  OOP - Structure   of   C++ - Tokens, Expressions and  Control  Structures -Operators in C++ - Manipulators. (6)"
                },
                {
                    "title": "FUNCTIONS IN C++:",
                    "content": "Function Prototyping - Call by Reference - Return by reference - Inline functions - Default, Const Arguments - Function -  Overloading -  Classes  and  Objects - Member  functions -  Nesting  of  Member  functions  - Private member functions -  Memory  allocation  for  Objects - Static data members - Static Member Functions - Array of Objects - Objects as Function Arguments -  Friend Functions - Returning Objects - Const Member functions - Pointers to Members  (10)"
                },
                {
                    "title": "CONSTRUCTORS:",
                    "content": "Parameterized Constructors - Multiple Constructors in a Class - Constructors with Default Arguments - Dynamic Initialization of Objects - Copy and Dynamic Constructors – Destructors overloading. (3)"
                },
                {
                    "title": "OPERATOR OVERLOADING:",
                    "content": "Overloading Unary and Binary Operators - Overloading Binary Operators using Friend functions – Operator Type conversion. (3)"
                },
                {
                    "title": "INHERITANCE:",
                    "content": "Defining Derived Classes - Single Inheritance - Making a Private Member Inheritable - Multiple Inheritance - Hierarchical Inheritance - Hybrid Inheritance – Function overriding – Virtual functions - Virtual Base Classes - Abstract Classes - Constructors in Derived Classes - Member Classes - Nesting of Classes – Composition – Aggregation.  (9)"
                },
                {
                    "title": "POLYMORPHISM:",
                    "content": "Basics of polymorphism – Types of polymorphism - Compile and Run Time Polymorphism - Virtual function – Object Slicing – Virtual Destructor – Dynamic binding. (5)"
                },
                {
                    "title": "TEMPLATES & EXCEPTION HANDLING:",
                    "content": "Introduction to Templates, Generic Functions and Generic Classes – Exception Handling – Examples  (4)"
                },
                {
                    "title": "STREAMS:",
                    "content": "String I/O -Character I/O - Object I/O - I/O with multiple Objects - File pointers - Disk I/O with member functions  (5)"
                }
            ],
            "textbooks": [
                "1.\tBjarne Stroustrup, “The C++ Programming Language”, Pearson Education, 2014.",
                "2.\tStanley B. Lippman, Josee Lajoie and Barbara E. Moo, “The C++ Primer”, Addison Wesley, 2013."
            ]
        },
        {
            "code": "20XC25",
            "title": "COMPUTER ARCHITECTURE",
            "semester": 2,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "BASIC ARCHITECTURE:",
                    "content": "Functional Units - Basic Operational Concepts-Performance –Instruction Set Architecture - Memory Locations and Addresses - Memory Operations - Instructions and Instruction Sequencing-- Addressing Modes -Stacks -Subroutines - Assembly Language -Additional Instructions- RISC and CISC instructions (9)"
                },
                {
                    "title": "BASIC PROCESSING UNIT:",
                    "content": "Fundamental Concepts--Instruction Execution-Hardware Components-Instruction Fetch and Execution Steps-Control Signals - Hardwired Control - CISC- Processors and RISC processors – Design of ALU (8)"
                },
                {
                    "title": "MEMORY SYSTEM:",
                    "content": "Basic Concepts- Internal Organization of Memory - Semiconductor RAM Memories - Static and Dynamic RAMs - Read-only Memories - Flash Memory - Direct Memory Access - -Cache Memories - Performance Considerations - Hit Rate and Miss Penalty- Caches on the Processor Chip-Virtual Memory--Secondary storage (10)"
                },
                {
                    "title": "INPUT/OUTPUT INTERFACES:",
                    "content": "Bus Structure -  Operation - Synchronous  and  Asynchronous Bus  -  FireWire - PCI Bus - SCSI Bus - SATA - SAS - PCI Express - Interface Circuits- Parallel/Serial /Universal Serial Bus (USB)  Program-Controlled I/O - I/O Programs for RISC and CISC - Interrupts - Handling Multiple Devices -  Exception handling  (10)"
                },
                {
                    "title": "PIPELINING:",
                    "content": "Basic Concept— Pipeline Organization - Pipelining Issues - Data Dependencies - Operand Forwarding - Handling Data Dependencies in Software - Memory Delays- Branch Delays - Branch Prediction -Resource Limitations -Performance Evaluation  (8)"
                }
            ],
            "textbooks": [
                "1.\tCarl Hamacher, Zvonkovranesic, Zaky, “Computer organization and Embedded Systems”, McGrawHill, 2012.",
                "2.\t  John Hennessy and David Patterson, \"Computer Architecture: A Quantitative approach\", Elsevier India Publishers, 2017.",
                "3.\tWilliam Stallings, “Computer Organisation and Architecture – Designing for performance”, Pearson Publishers,  2014"
            ]
        },
        {
            "code": "20XC26",
            "title": "DATA STRUCTURES LAB",
            "semester": 2,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "Implementation of the following problems:",
                    "content": "1.\tSparse and dense Matrix operations using arrays.\n                    2.\tLinked Lists: Singly linked, Doubly linked and Circular lists.\n                    3.\tProblems using Stacks and queues\n                    4.\tBinary trees, Binary search trees implementation and problems\n                    5.\tDictionary implementation using hash tables\n                    6.\tAVL tree implementation\n                    7.\tB-tree and it’s operations."
                }
            ]
        },
        {
            "code": "20XC27",
            "title": "OBJECT ORIENTED PROGRAMMING LAB",
            "semester": 2,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XC28",
            "title": "PYTHON PROGRAMMING LABORATORY",
            "semester": 2,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Development Tools (IDE) – Python shell - Python Basics – Data types - Control flow."
                },
                {
                    "title": "CORE PYTHON LANGUAGE:",
                    "content": "Lists - Tuples - Dictionaries - Strings – Regular expressions - Functions - File input/output – Exception handling."
                },
                {
                    "title": "OBJECT-ORIENTED DESIGN:",
                    "content": "Inheritance – Polymorphism."
                },
                {
                    "title": "PACKAGING AND DISTRIBUTION:",
                    "content": "Modules – Packages – Python standard libraries - pip."
                },
                {
                    "title": "STANDARD PACKAGES:",
                    "content": "NumPy – Matplotlib – SciPy – SymPy – Pandas."
                },
                {
                    "title": "LAB PROGRAMS:",
                    "content": "1.\tExercises to test basic coding skills in Python using data types, control statements and iteration.\n                    2.\tPrograms to implement Python data structures like lists, tuples, dictionaries, and sets.\n                    3.\tPrograms covering general programming concepts such as functions, strings, regular expressions, reading / writing files and exceptions.    \n                    4.\tStandalone programs to implement object oriented concepts.\n                    5.\tPackaging their programs into reusable libraries. \n                    6.\tWrite programs to use libraries for numerical programming and data visualization."
                }
            ],
            "textbooks": [
                "1.\tMark Lutz, “Learning Python”, O’Reilly Media, 2013.",
                "2.\tTony Gaddis, “Starting out with Python”, Pearson, 2017."
            ]
        },
        {
            "code": "20XC31",
            "title": "PROBABILITY AND STATISTICS",
            "semester": 3,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "SAMPLE SPACE AND PROBABILITY:",
                    "content": "Sets, probabilistic models, conditional probability, total probability theorem and Bayes’ rule,independence, gamblers ruin problem. (6+4)"
                },
                {
                    "title": "DISCRETE RANDOM VARIABLES:",
                    "content": "Random variables concept- Probability mass function. Expectation, mean, and variance. Bernoulli, Binomial, Poisson and Geometric random variables. Joint probability mass function of multiple random variables, conditioning, independence.  (6+4)"
                },
                {
                    "title": "CONTINUOUS RANDOM VARIABLES:",
                    "content": "Probability density function, cumulative distribution function, Uniform,Normal, Exponential, Weibull, and Gamma random variables. Joint probability density function of multiple random variables, conditioning, continuous Bayes’ rule. Sums of independent random variables, convolution, covariance, correlation, and conditional expectation (6+4)"
                },
                {
                    "title": "LIMIT THEOREMS:",
                    "content": "Markov and Chebyshev inequalities, Weak Law of Large Numbers, Convergence in probability, Central Limit Theorem, Strong Law of Large Numbers. (5+3)"
                },
                {
                    "title": "SAMPLE AND POPULATION:",
                    "content": "Sample mean, confidence interval construction, estimating the variance of the sample mean, confidence intervals for population means, standard error estimates (6+4)"
                },
                {
                    "title": "SIGNIFICANCE OF EVIDENCE:",
                    "content": "Significance, p-values, comparing the mean of two populations, other useful tests of significance (6+4)"
                },
                {
                    "title": "INFERRING PROBABILITY MODELS FROM DATA:",
                    "content": "Estimating model parameters with Maximum Likelihood, incorporating priors with Bayesian inference, Bayesian inference for Normal distributions  (6+4)"
                },
                {
                    "title": "REGRESSION:",
                    "content": "Regression to make predictions, to spot trends, linear regression and least squares, Producing Good Linear Regressions"
                }
            ],
            "textbooks": [
                "1. Dimitri P. Bertsekas and john N,Tsitsiklis, ‘Introduction to Probability’, Athena Scientific, 2008.",
                "2. David Forsyth, ‘Probability and Statistics for Computer Science’, Springer; 2018",
                "3. Michael J. Evans, Jeffrey S. Rosenthal, ‘Probability and Statistics - The Science of Uncertainty’. W H Freeman & Co,          2010"
            ]
        },
        {
            "code": "20XC32",
            "title": "MICROCONTROLLERS AND EMBEDDED SYSTEM",
            "semester": 3,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "MICROPROCESSOR ARCHITECTURE:",
                    "content": "Fundamentals of Microprocessor Architecture. 8-bit Microprocessor and Microcontroller architecture, Comparison of 8-bit microcontrollers, 16-bit and 32-bit Microcontrollers - 8086 Architecture-Functional diagram - Memory Segmentation, Programming Model- Physical Memory Organization, Architecture of 8086  (10)"
                },
                {
                    "title": "MICROCONTROLLER ARCHITECTURE:",
                    "content": "Introduction to Microcontroller- Role of microcontrollers in Embedded system - Types and Architecture, TIMERS and Counters, Interrupts - Watchdog - Programming model of Microcontroller- overview of Programming language, Compilers and assemblers - Open source hardware platform – ASIC embedded system – SoC Architecture – OS and Non OS based microcontroller  (15)"
                },
                {
                    "title": "SENSORS AND ACTUATORS:",
                    "content": "Types of Sensors - Analog, Digital -Models of Sensors and Actuators- Common sensors-Actuators (6)"
                },
                {
                    "title": "COMMUNICATION INTERFACE:",
                    "content": "On board Communication Interfaces- I2C Bus, SPI Bus, UART , Interfacing with LEDs, Seven Segment, Sensors, Basic concepts of LCD,ADC, DAC, Relays etc. and their interfacing to microcontroller- Debugging interface- JTAG emulator   (14)"
                },
                {
                    "title": "ARM ARCHITECTURE:",
                    "content": "ARM Processor fundamentals, ARM Architecture – Register, CPSR, Pipeline, exceptions and interrupts interrupt vector table, ARM instruction set – Data processing, Branch instructions, load store instructions, Software interrupt instructions, Program status register instructions, loading constants, Conditional execution, Introduction to Thumb instructions.   (15)"
                }
            ],
            "textbooks": [
                "1.\tWilliam Hohl and Christopher Hinds, “ARM Assembly Language Fundamentals and Techniques”, CRC Press,  2015.",
                "2.\tMuhammad Ali Mazidi, Rolin D. Mckinlay, Janice Gillispie Mazidi, “The 8051 Microcontroller: A Systems Approach”, Pearson Education, Limited, 2013",
                "3.\tDanny Causey, Muhammad Ali Mazidi and Rolin D. McKinlay, “PIC Microcontroller & Embedded System: Using Assembly and C for PIC18”, Pearson Education India, 2008.",
                "4.\tMyke Predko, “Programming and Customizing the PIC Microcontroller”, Tata McGraw Hill,  2008."
            ]
        },
        {
            "code": "20XC33",
            "title": "LINEAR ALGEBRA",
            "semester": 3,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "SYSTEM OF LINEAR EQUATIONS:",
                    "content": "System of linear equations, Gauss – elimination, Gauss-seIdal method- Application of Linear systems.  (5+3)"
                },
                {
                    "title": "VECTOR SPACES:",
                    "content": "Vector spaces and subspaces – Span, Linear independence and dependence– Basis and dimension - Row space, Column space, and Null space– Rank and nullity- Change of basis– Similarity - Isomorphism  (10+7)"
                },
                {
                    "title": "INNER PRODUCT SPACES:",
                    "content": "Inner products, Length and Angle in inner product spaces - Orthonormal bases, Gram Schmidt process - Orthogonal matrices- QR decomposition - Best Approximation and Least-squares. (10+7)"
                },
                {
                    "title": "LINEAR TRANSFORMATION:",
                    "content": "Introduction to linear transformations – General Linear Transformations – Kernel and range – Matrices of general linear transformation- Geometry of linear operators.  (6+4)"
                },
                {
                    "title": "SPARSE MATRICES :",
                    "content": "Introduction – Storage Schemes – Basic sparse matrix operations – Sparse  direct solutions – random walk problems. (4+2)"
                },
                {
                    "title": "EIGEN VALUES AND EIGEN VECTORS:",
                    "content": "In10r7duction to Eigen values Eigen vectors, Complex Eigen values, - Diagonalization - Orthogonal diagonalization- Positive definite matrices - Quadratic forms - Quadric surfaces - Singular value decomposition.  Applications to differential equations, dynamical systems (10+7)"
                }
            ],
            "textbooks": [
                "1.\tHoward Anton and Chris Rorres, “Elementary Linear Algebra”, John Wiley& Sons, 2017.",
                "2.\tDavid C. Lay, “Linear Algebra and its Applications’, Pearson Education, 2016"
            ]
        },
        {
            "code": "20XC34",
            "title": "DATABASE DESIGN",
            "semester": 3,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "BASIC CONCEPTS :",
                    "content": "Introduction to databases – Conventional file processing – Characteristics of a database – Data Models – Data abstraction - Three Schema architecture – Data Independence – Database Languages – Database System Environment – Database architecture - Advantages and disadvantages of DBMS – Users of DBMS.  (5)"
                },
                {
                    "title": "DATA MODELING:",
                    "content": "Introduction – entities, attributes, relationships – Structural and participation constraints – High Level conceptual data model - ER Diagrams(ERD) – Specialization and Generalization  Constraints – Enhanced ER diagrams(EER) – Mapping  of ER/EER into Relational Schema.  (5)"
                },
                {
                    "title": "RELATIONAL MODEL AND CONSTRAINTS:",
                    "content": "Introduction – Relational data model – Data Integrity Constraints – Introduction to Relational Algebra – Relational algebra queries. -RELATIONAL DATABASE MANIPULATION: Structured Query Language (SQL) - Basic data retrieval – SQL Joins – SQL complex queries – Views – Advanced  SQL  (8)"
                },
                {
                    "title": "FILE ORGANIZATION :",
                    "content": "Storage device characteristics – Constituents of a file – Operations on file -  Serial files – Sequential files – Hashing techniques - Index Sequential files – Direct files – Primary, secondary and cluster indexes – Indexing using Tree structures, SQL Query processing and optimization   (7)"
                },
                {
                    "title": "DATA BASE DESIGN THEORY:",
                    "content": "Functional dependencies – Normal forms based on primary keys – First, Second and Third Normal forms - Boyce Codd Normal form - Multivalued dependencies – Fourth Normal form  - Decomposition Algorithms for relational database design   (6)"
                },
                {
                    "title": "TRANSACTION AND SECURITY MANAGEMENT:",
                    "content": "Introduction - Serializability and concurrency control – Locking techniques - Times Stamping Method – Deadlock -  Recovery Techniques   (5)"
                },
                {
                    "title": "DATA BASE SECURITY AND ATTACK VULNERABILITIES:",
                    "content": "Security and Integrity threats – Access Controls and Defense mechanisms: Access Control Models, Properties of Access Control models, Statistical databases: Differential Privacy, Injection, SQL Injection attacks, Vulnerabilities - Data provenance  (9)"
                }
            ],
            "textbooks": [
                "1.\tElmasri R and Navathe SB, “Fundamentals of Database Systems”, Pearson Education,  2016.",
                "2.\tSilberschatz A, Korth H  and Sudarshan S, “Database System Concepts”, McGraw Hill, 2019."
            ]
        },
        {
            "code": "20XC35",
            "title": "DESIGN AND ANALYSIS OF ALGORITHM",
            "semester": 3,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Methods of specifying an algorithm-deciding an appropriate data structure and algorithm design technique-Best, worst and average case complexities –analysis of recursive algorithms - Master’s theorem   (3)"
                },
                {
                    "title": "SORTING ALGORITHMS:",
                    "content": "Insertion sort- Selection sort- Heap sort-Radix sort-time complexity analysis  (3)"
                },
                {
                    "title": "GRAPHS:",
                    "content": "Terminologies– Representations using Adjacency matrix, adjacency list - Graph Traversal Algorithms  -  Breadth first and Depth first - Analysis –Connected components- Shortest path- Analysis.    (4)"
                },
                {
                    "title": "DIVIDE AND CONQUER:",
                    "content": "Method– Binary search-  Merge sort and  Quick sort – Large integer multiplication- Strassen’s matrix multiplication.  (6)"
                },
                {
                    "title": "GREEDY METHOD:",
                    "content": "Optimization problems – Method  – Minimum cost spanning tree (Kruskal’s and prim’s algorithms), Topological sorting, Huffman codes   (6)"
                },
                {
                    "title": "DYNAMIC PROGRAMMING:",
                    "content": "Method – All pairs shortest path problem – Longest common subsequence-Traveling salesman problem   (6)"
                },
                {
                    "title": "STRING MATCHING:",
                    "content": "Naïve algorithm- Rabin Karp - Knuth Morris Pratt algorithm (3)"
                },
                {
                    "title": "NP-HARD, NP-COMPLETE CLASSES:",
                    "content": "Basic concepts – Non deterministic algorithms – Satisfiability problem – NP-hard and NP-complete Problems- Polynomial time reduction -3-SAT and independent set-–Space Complexity: class PSPACE- some hard problems in PSPACE complete-QSAT  (7)"
                },
                {
                    "title": "BACK TRACKING:",
                    "content": "Method – N-queen’s problem - Graph coloring  (3)"
                },
                {
                    "title": "BRANCH AND BOUND:",
                    "content": "Method  – 0/1 Knapsack, Traveling Salesman problem  (4)"
                }
            ],
            "textbooks": [
                "1. Thomas H. Cormen, Charles E Leiserson and Ronald L Rivest, “Introduction to Algorithms”, MIT Press, 2015.",
                "2. Jon Klienberg, Eva Tardoss, “Algorithm Design”, Pearson, 2013."
            ]
        },
        {
            "code": "20XC36",
            "title": "EMBEDDED SYSTEMS LAB",
            "semester": 3,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "Assembly language programming on",
                    "content": "1.\tData transfer instructions using different addressing modes and block transfer.\n                    2.\tArithmetic operations in binary and BCD-addition, subtraction, multiplication and division \n                    3.\tMulti-precision addition and subtraction.\n                    4.\tConversion of BCD numbers into ASCII characters and vice versa.\n                    5.\tDelay loop implementation.\n                    6.\tImplementation of Control Structures (FOR, LOOP, IF.. THEN, DO..WHILE etc.,). \n                    7.\tArray processing \n                    8.\tString processing \n                    9.\tProcedures and Interrupts"
                },
                {
                    "title": "Implement the following for embedded systems",
                    "content": "(Using 8051 or any other open source hardware platforms like PIC, Arduino, MSP430, ARM etc) \n                    1.\tDesign and Layout of an Embedded System \n                    2.\tInterfacing ADC and DAC.\n                    3.\tInterfacing LED and PWM.\n                    4.\tInterfacing real time clock and serial port.\n                    5.\tInterfacing keyboard and LCD.\n                    6.\tInterfacing EPROM and interrupt.\n                    7.\tStudy of ARM evaluation system\n                    8.\tImplementing zigbee protocol with ARM.\n                    9.\tInterrupt performance characteristics of ARM and FPGA.\n                    10.\tJTAG hardware debugging interface\n                    11.\tSoftware Drivers for an Embedded System"
                }
            ]
        },
        {
            "code": "20XC37",
            "title": "DESIGN AND ANALYSIS OF ALGORITHMS LAB",
            "semester": 3,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "Implementation of the following problems:",
                    "content": "1. Sorting algorithms implementation and it’s comparison \n                    2. Problems on graph traversals \n                    3. Strassen matrix multiplication and large integer multiplication using divide and conquer approach\n                    4. Prims minimum cost spanning tree \n                    5. Kruskal’s minimum cost spanning tree using min heap data structure, union and find operation\n                    6. Application of all pairs shortest path problem , longest common subsequence\n                    7. Application of N QUEENS using back tracking \n                    8. TSP, 0/1 knapsack Problem using branch – and - bound"
                }
            ]
        },
        {
            "code": "20XC38",
            "title": "DATA BASE DESIGN LAB",
            "semester": 3,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "Implementation of the following problems:",
                    "content": "1.\tWorking with DDL and DML for creation and manipulation of single, multiple tables, Report Generation.\n                    2.\tPractising DCL commands to control access privileges. \n                    3.\tWorking with TCL commands to manage transactions in databases.\n                    4.\tWorking with PL/SQL- Triggers and stored procedures.\n                    5.\tDeveloping Packages using databases."
                }
            ]
        },
        {
            "code": "20XC41",
            "title": "OPTIMIZATION TECHNIQUES",
            "semester": 4,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "CLASSICAL OPTIMIZATION :",
                    "content": "Introduction - Classification of optimization problems – Single variable optimization - Multi variable optimization with equality constraints and inequality constraints – solution by the method of Lagrange multipliers - Kuhn –Tucker conditions.  (12)"
                },
                {
                    "title": "LINEAR PROGRAMMING:",
                    "content": "Linear Programming model – Graphical method, Simplex method, Two phase simplex method – Revised Simplex method – Sensitivity Analysis - Dual and Primal problems – Dual Simplex method – Post Optimal Analysis.  (14)"
                },
                {
                    "title": "TRANSPORTATION MODEL AND ITS VARIANTS:",
                    "content": "Transportation problem and its solution – Assignment problem and its solution by Hungarian method  (6)"
                },
                {
                    "title": "DYNAMIC PROGRAMMING :",
                    "content": "Principle of optimality - Forward and Backward Recursion methods –  Shortest route problem -  Knapsack model – Work force size model  (6)"
                },
                {
                    "title": "NON LINEAR PROGRAMMING:",
                    "content": "Direct Search Methods – Univariate method, Hooke and Jeeves method – Indirect search methods – Steepest descent method, Conjugate gradient method.   (7)"
                }
            ],
            "textbooks": [
                "1. Hamdy A Taha,, “Operations Research :An Introduction”, Pearson Education, 2017.",
                "2. Singiresu S Rao, “Engineering Optimization Theory and Practice”, John Wiley, 2014."
            ]
        },
        {
            "code": "20XC42",
            "title": "COMPUTER NETWORKS",
            "semester": 4,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Network goals - Applications of Networks - Design issues for the layers - OSI Reference Model - Types of Network - Network Topologies- Analog and Digital data transmission- Data encoding- Bandwidth and data rate-.Bit Rate, Baud Rate- Sampling Rate.   (5)"
                },
                {
                    "title": "DATA COMMUNICATION:",
                    "content": "Multiplexing - Synchronous and Asynchronous TDM – FDM –CDM - Switching, Circuit Switching, Packet Switching.  (3)"
                },
                {
                    "title": "TRANSMISSION OF DIGITAL DATA:",
                    "content": "Transmission Impairments - Single and Multiple bit error correction-Error Detection  and Correction - Cyclic Redundancy Check Code -.Hamming Code.   (4)"
                },
                {
                    "title": "DATA LINK CONTROL AND PROTOCOLS:",
                    "content": "Line Discipline - Flow Control - Sliding Window Protocol - Error Control - Automatic Repeat Request – Stop and wait  - ARQ -  Go back by n ARQ - Selective Reject ARQ.  (5)"
                },
                {
                    "title": "LOCAL AREA NETWORKS:",
                    "content": "Random Access protocols- Ethernet – Fast Ethernet – Gigabit Ethernet – Wireless LANs- Internetworking- LAN -LAN Connections – Repeaters- Hubs - Bridge – Spanning tree-Switches – Routers     (5)"
                },
                {
                    "title": "IP:",
                    "content": "TCP/IP Protocol Structure - Internet Protocol – IP addressing-Subnetting-NAT- IPV6-ICMP-ARP-DHCP  (9)"
                },
                {
                    "title": "ROUTING:",
                    "content": "Distance vector routing _ Link state Routing – RIP – OSPF  (4)"
                },
                {
                    "title": "TRANSPORT LAYER:",
                    "content": "TCP concepts - Port number – Connection control – Flow control - Congestion Control  (5)"
                },
                {
                    "title": "APPLICATIONS:",
                    "content": "MTP - MIME Format, FTP, DNS, HTTP.   (5)"
                }
            ],
            "textbooks": [
                "1.\tBehrouz A Forouzan, “Data Communications and Networking”, Tata McGraw Hill, 2013",
                "2.\tBehrouz A Forouzan, “TCP/ IP Protocol Suite”, Tata McGraw Hill, 2017.",
                "3.\tPeterson, Larry L., and Bruce S. Davie. Computer networks: a systems approach. Elsevier, 2012."
            ]
        },
        {
            "code": "20XC43",
            "title": "OPERATING SYSTEMS",
            "semester": 4,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Abstract view of an operating system - Operating Systems Objectives and Functions – Evolution of Operating Systems - Dual-mode operation - System calls- Structure of Operating System.   (3)"
                },
                {
                    "title": ":PROCESS DESCRIPTION AND CONTROL:",
                    "content": "Process concepts - Process Creation – Process Termination - Process states - Process Description – Process Control.  (5)"
                },
                {
                    "title": "PROCESS AND THREADS:",
                    "content": "Relationship between process and threads – Thread States – Thread Synchronization – Types of Thread – Multithreading model.     (6)"
                },
                {
                    "title": "PROCESS SCHEDULING:",
                    "content": "Scheduling basics - CPU-I/O interleaving- (non-)preemption - context switching- Types of Scheduling – Scheduling Criteria - Scheduling Algorithms – Algorithm evaluation – Real-time scheduling.  (5)"
                },
                {
                    "title": "PROCESS SYNCHRONIZATION:",
                    "content": "Concurrent Process – Principles of Concurrency – Race Condition - Mutual Exclusion – Critical section problems – Software support – Hardware Support – Operating System Support: Semaphore, Monitor – Classical problems of synchronization – Synchronization examples.   (8)"
                },
                {
                    "title": "DEADLOCK:",
                    "content": "Principles- Characterization – Methods for handling deadlock - Deadlock prevention, Avoidance, Detection, and recovery.    (4)"
                },
                {
                    "title": "MEMORY MANAGEMENT:",
                    "content": "Memory hierarchy –Memory Management requirements - Memory partitioning: Fixed partitioning, Dynamic partitioning, Buddy systems – Simple paging – Page table structures – Simple Segmentation – segmentation and paging.  (8)"
                },
                {
                    "title": "VIRTUAL MEMORY MANAGEMENT:",
                    "content": "Need for Virtual Memory management – Demand Paging –Copy on write -Page Fault handling - Page replacement - Frame allocation- Thrashing - working set model.  (6)"
                },
                {
                    "title": "I/O MANAGEMENT AND DISK SCHEDULING:",
                    "content": "Organization of I/O function – Evolution of I/O function – Types of I/O devices – Logical Structure of I/O functions – I/O Buffering – Disk I/O – Disk Scheduling algorithms – RAID - Disk Cache.  (5)"
                },
                {
                    "title": "FILE SYSTEM MANAGEMENT:",
                    "content": "Files – Access methods - File system architecture – Functions of file management –Directory and disk structure -Mounting - File sharing –File system implementation – Directory implementation - File Allocation – Free space management.  (5)"
                },
                {
                    "title": "VIRTUALIZATION:>",
                    "content": "Requirements for Virtualization - Type 1, Type 2 Hypervisors – Paravirtualization- Memory Virtualization - I/O Virtualization - Virtual machines on Multicore CPUs–Virtualization in Multiprocessor environment.  (5)"
                }
            ],
            "textbooks": [
                "1.\tSilberschatz A, Galvin, PB. and Gagne, G. “Operating System Concepts”, John Wiley & Sons, Inc.,2018",
                "2.\tWilliam Stallings, “Operating Systems: Internals and Design Principles”, Pearson Education, 2017.",
                "3.\tAndrew S Tanenbaum, \"Modern Operating System\", Prentice Hall, 2018."
            ]
        },
        {
            "code": "20XC44",
            "title": "CRYPTOGRAPHY",
            "semester": 4,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Security goals- cryptographic attacks- Security services and mechanisms.  Encryption and Decryption- Cryptosystem- Symmetric-key ciphers- Monoalphabetic ciphers- Polyalphabetic ciphers – one time pad - Cryptanalysis.  (6+4)"
                },
                {
                    "title": "INFORMATION THEORY:",
                    "content": "Shannon theory- perfect secrecy- Entropy and Uncertainty- Huffman encodings-properties of entropy.  (3+2)"
                },
                {
                    "title": "SYMMETRIC KEY CRYPTOGRAPHY:",
                    "content": "Stream cipher – LFSR stream cipher- Block ciphers – Components - Product ciphers- DES– AES- Cryptanalysis– Modes of operation.     (6+4)"
                },
                {
                    "title": "PUBLIC KEY CRYPTOGRAPHY:",
                    "content": "Concept of public key cryptography – RSA cryptosystem – Hard problem - Factorization Problem-Discrete Log Problem - ElGamal cryptosystem–Elliptic curve cryptosystem - Homomorphic encryption - Paillier cryptosystem –cryptanalysis.    (9+6)"
                },
                {
                    "title": "DATA INTEGRITY TECHNIQUES:",
                    "content": "Message integrity- message authentication- iterated hash function- merkle- damgard scheme - Structure of MD4 and SHA 512 hash functions.  (3+2)"
                },
                {
                    "title": "DIGITAL SIGNATURE:",
                    "content": ": Services – attacks - RSA signature-ElGamal signature- Schnorr signature - Digital signature standard algorithm- Cryptanalysis- strong security notion for digital signatures- provable security for ElGamal signature- Random Oracle model. (6+4)"
                },
                {
                    "title": "ENTITY AUTHENTICATION:",
                    "content": "Data origin authentication and entity authentication – password based authentication– Challenge response protocols – Schnorr identification scheme -Zero knowledge protocols – Fiat-Shamir Protocol – Feige-Fiat-Shamir Protocol– Biometrics.  (6+4)"
                },
                {
                    "title": "KEY MANAGEMENT PROTOCOLS:",
                    "content": "Symmetric key distribution– Public key distribution - Needham-Schroeder Protocol – Otway-Rees Protocol – Kerberos – Symmetric Key Agreement Protocol – Diffie-Hellman key Agreement – Digital Certificate - Analysis of Diffie-Hellman – Station-to-Station Protocol.   (6+4)"
                }
            ],
            "textbooks": [
                "1.\tDouglas R Stinson, “Cryptography Theory and Practice”, CRC Press,2018.",
                "2.\tJonathan Katz, Yehuda Lindell, “Introduction to Modern Cryptography”,CRC press, 2015.",
                "3.\tBruce Schneier, ‘Applied Cryptography, Protocols, Algorthms, and Source Code in C’, John Wiley & Sons, 2012."
            ]
        },
        {
            "code": "20XC45",
            "title": "HARDWARE SECURITY",
            "semester": 4,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "HARDWARE SECURITY PRIMITIVES:",
                    "content": "Basics and Vulnerabilities-Sequential System Specification and Implementation - Testability and Verification of Cryptographic Hardware: Fault-tolerance of Cryptographic Hardware- Fault Attacks - Physical Attacks (PA) Basics - Physical Attacks and Countermeasures - Building Secure Systems     (6+4)"
                },
                {
                    "title": "SIDE CHANNEL ATTACKS AND COUNTERMEASURES:",
                    "content": "Introduction - Side-channel Attacks on Cryptographic Hardware- Current-measurement based Side-channel Attacks (Case Study: Kocher’s Attack on DES) - Design Techniques to Prevent Side-channel Attacks, Improved Side-channel Attack Algorithms (Template Attack, etc.),     (6+4)"
                },
                {
                    "title": "SECURE MEMORY COMPONENTS:",
                    "content": "Timing attacks on memory components - Cache Attacks - Secure cache architectures - Secure cache coherence directories - Secure TLBs - Secure memory controller designs - Mitigating memory bus side channel attack- Exploiting hardware prefetching to mitigate cache timing attacks (8+4)"
                },
                {
                    "title": "MICROARCHITECTURAL SECURITY :",
                    "content": "Introduction - Cold boot attack,- Remanence effect -Meltdown and Spectre- SWAPGS         (4+4)"
                },
                {
                    "title": "HARDWARE TROJANS:",
                    "content": "Hardware Trojan Taxonomy - Operating Modes, Countermeasures  to Prevent/Detect Hardware Trojans, Logic Testing and Side-channel Analysis based Techniques for Trojan Detection- Trusted IC Design with HT Prevention - Physical Design Obfuscation of Hardware - classical obfuscation approaches - Infrastructure Security: Impact of Hardware Security Compromise on Public Infrastructure, Defense Techniques (Case Study: Smart-Grid Security   (10+6)"
                },
                {
                    "title": "TRUSTED PLATFORM MODULE:",
                    "content": ": TPM Operations - Trusted boot-  Trusted execution environment (TEE) ; SGX and Trustzone - Secure Element (SE) - Global Platform Device - Trusted Personal Devices - Comparative Analysis of TPM/MTM Technology Contenders    (8+4)"
                },
                {
                    "title": "EMERGING TECHNOLOGIES:",
                    "content": "Physical Uncloneable Functions (PUF) Basics - PUF Implementations-  Design Techniques to Increase PUF Response Quality    (4+3)"
                }
            ],
            "textbooks": [
                "1.\tDebdeep Mukhopadhyay and R. Subhra Chakraborty, \"Hardware Security: Design, Threats, and Safeguards\", CRC Press, 2019.",
                "2.\tJ. Szefer and M. Martonosi, “Principles of Secure Processor Architecture Design”, Morgan and Claypool Publishers, 2018.",
                "3.\tWill Arthur, David Challener, Kenneth Goldman , “A Practical Guide to TPM 2.0,Using the New Trusted Platform Module in the New Age of Security”, Springer, Apress, Berkeley, 2015."
            ]
        },
        {
            "code": "20XC46",
            "title": "COMPUTER NETWORKS LAB",
            "semester": 4,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XC47",
            "title": "OPERATING SYSTEMS LAB",
            "semester": 4,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "textbooks": [
                "1.\tRobert Love, “Linux System Programming”, O’Reilly, 2013",
                "2.\tNeil Matthew and Richard Stones, “Beginning Linux programming”, John Wiley, 2011.",
                "3.\tDale Doughherty and Arnold Robbins, “SED & AWK programming”, O’Reilly, 2010."
            ]
        },
        {
            "code": "20XC48",
            "title": "JAVA PROGRAMMING LAB",
            "semester": 4,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "JAVA PROGRAMMING:",
                    "content": "Introduction - Data Types -  Operators -  Declarations - Control Structures - Arrays and Strings - Input/Output-Java Classes - Fundamentals - Methods - Constructors - Scope rules - this keyword - object based vs oriented programming – Inheritance-Reusability - Composing class - Method overloading - Abstract classes - Virtual Functions.    (10)"
                },
                {
                    "title": "PACKAGES AND INTERFACES:",
                    "content": "Packages - Access protection - Importing packages - Interface - Defining and Implementing Interface - Applying Interface - Variables in Interfaces.     (8)"
                },
                {
                    "title": "EXCEPTION HANDLING:",
                    "content": "Fundamentals - Exception types - Uncaught Exception - Using Try and Catch - Multiple catch clauses - Nested Try statements - Throw - Throws - Java Built-in Exception - Creating your own subclasses. (8)"
                },
                {
                    "title": "MULTI THREADED PROGRAMMING:",
                    "content": "Java thread model - Priorities - Synchronization - Messaging - Thread class and runnable Interface -  Main thread - Creating the Thread - Synchronization - Interthread Communication - Deadlock.         (12)"
                },
                {
                    "title": "I/O, APPLETS:",
                    "content": "I/O basics - Stream - Stream Classes - Predefined stream - Reading/Writing console input - Applet fundamentals - Native methods.- GUI Components - Applets - Java Scripts –Swing   (12)"
                },
                {
                    "title": "COLLECTIONS FRAMEWORK:",
                    "content": ": Generics – Autobox – Auto unboxing – Annotations – Collections Frame works – List – Set - Map    (7)"
                },
                {
                    "title": "NEW FEATURES :",
                    "content": "Functional Programming    (3)"
                },
                {
                    "title": "PRACTICALS:",
                    "content": "1.\tTo create runtime polymorphism using abstract class, interface.\n                        2.\tTo create callback feature using interface.\n                        3.\tTo create a program for interface inheritance.\n                        4.\tTo implement a user defined package.\n                        5.\tTo implement a user defined checked exception and unchecked exception.\n                        6.\tTo create threads, thread groups.\n                        7.\tTo create inter-thread communication using shared memory, piper stream.\n                        8.\tTo implement socket connections  (UDP, TCP)."
                }
            ],
            "textbooks": [
                "1.\tHerbert Schildt, “Java: the Complete Reference”, McGraw Hill, 2014."
            ]
        },
        {
            "code": "20XC51",
            "title": "NETWORK SECURITY",
            "semester": 5,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "NETWORK LEVEL SECURITY MECHANISMS:",
                    "content": "Packet Sniffing and Spoofing- Introduction to IPsec -IPsec Security Associations-Protection Mechanisms -Protection Policy and Enforcement Mechanisms-Transport and Tunnel Modes    (5)"
                },
                {
                    "title": "VIRTUAL PRIVATE NETWORK:",
                    "content": "Introduction- How a Virtual Private Network Works –An Overview of How TLS/SSL VPN Works -Building and testing a VPN-Using VPN to Bypass Egress Firewall      (6)"
                },
                {
                    "title": "IDS:",
                    "content": "Intrusion Detection and filters, Host-Based IDS vs Network-Based IDS, Snort - Dealing with unwanted traffic: Denial of service attacks – Botnets – Anonymized networks- Tor,I2P\t (8)"
                },
                {
                    "title": "TRANSPORT LAYER ATTACKS:",
                    "content": "The SYN Flooding Attack - Launching the SYN Flooding Attack - Countermeasure - TCP Reset Attack -Closing TCP -How the Attack Works - Launching the TCP Reset Attack- TCP Reset Attack on Telnet connections -TCP Reset Attack on SSH connections -TCP Reset Attack on Video-Streaming Connections - TCP Session Hijacking Attack -Launching TCP Session Hijacking Attack - Creating Reverse Shell          (10)"
                },
                {
                    "title": "TRANSPORT LAYER SECCURITY:",
                    "content": "Overview of TLS - Overview of the TLS Handshake Protocol -Certificate Verification -Key Generation and Exchange - TLS Data Transmission - Sending and receiving Data with TLS Record Protocol -TLS Programming – Attacks on TLS   (8)"
                },
                {
                    "title": "FIREWALL :",
                    "content": "Introduction - Types of Firewalls - Building a Simple Firewall using Netfilter -The iptables Firewall in Linux - The structure of the iptables Firewalls -Traversing Chains and Rule Matching -Stateful Firewall using Connection Tracking- Application/Proxy Firewall and Web Proxy-Evading Firewalls - Using SSH Tunneling to Evade Firewalls - Dynamic Port Forwarding - Reverse SSH Tunneling     (8)"
                }
            ],
            "textbooks": [
                "1.\tBehrouz A Forouzan, “Data Communications and Networking”, Tata McGraw Hill, 2017",
                "2.\tBehrouz A Forouzan, “TCP/ IP Protocol Suite”, Tata McGraw Hill, 2017.",
                "3.\tWenliang  Du, “Computers and Internet Security”, 2019"
            ]
        },
        {
            "code": "20XC52",
            "title": "WEB ENGINEERING",
            "semester": 5,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "WEB APPLICATION TECHNOLGIES:",
                    "content": "Rest Architecture – RESTful APIs ,HTTPS- dynamic web intro-Web functionality – Encoding Schemes -Building web applications with JS – Web assembly- Functions in web assembly-The Owasp project : introduction to web applications security - threats and OWASP principles - introduction to secure design  (7)"
                },
                {
                    "title": "WEB APPLICATION ATTACKS:",
                    "content": "CROSS SITE REQUEST FORGERY-CSRF Attacks on HTTP GET and POST Services-Countermeasures-Cross-Site Scripting Attack-Preventing XSS attacks SQL INJECTION ATTACK-Launching SQL Injection Attacks-Countermeasures-  Insecure Web Logic: Logic Flaws, HTTP Pollution, HTTP Parameter Tampering- Security issues in JS, Web Assembly   (10)"
                },
                {
                    "title": "BROWSER:",
                    "content": "general concepts, functionalities, browsers war - configuration (HTTP-cookies, contents, scripting, etc.) - WEB BROWSER ATTACKS- Code execution exploits in the browser-Code execution exploits in plug-ins-Man-in-the-middle attacks - browser security (add-ons, plugins, same-origin policy etc.) and secure browsing - Attacks on User Interfaces - Browser Design & Flaws- User Tracking, Browser Caching Flaws - Cookie Flaws. (9)"
                },
                {
                    "title": "DOMAIN NAME SYSTEM (DNS) AND ATTACKS:",
                    "content": "How DNS works- DNS Attacks: Overview -Local DNS Cache Poisoning Attack - Launch DNS Cache Poisoning Attack - Targeting the Authority Section -Remote DNS Cache Poisoning Attack - The Kaminsky Attack-Reply Forgery Attacks from Malicious DNS Servers-DNS Rebinding Attack-Protection Against DNS Spoofing Attacks - DNSSEC - TLS/SSL Solution - Denial of Service Attacks on DNS Servers  (9)"
                },
                {
                    "title": "EMAIL SECURITY:",
                    "content": "SMTP - Email Security Policies - Email Security Best Practices- SMIME-Secure E-Mail Implementation (5)"
                },
                {
                    "title": "PUBLIC KEY INFRASTRUCTURE:",
                    "content": "Attacks on PKI Infrastructure- Public Key certificates –Certificate Authority – How PKI defeats MITM –Types of digital certificates- LDAP and Enterprise Data Repository (5)"
                }
            ],
            "textbooks": [
                "1.\tStuttard D and Pinto M, “The Web Application Hacker's Handbook: Finding and Exploiting Security Flaws”, John Wiley & Sons, 2011.",
                "2.\tLeBlanc J and Messerschmidt T, “Identity and Data Security for Web Development: Best Practices\", O'Reilly Media, Inc, 2016."
            ]
        },
        {
            "code": "20XC53",
            "title": "MACHINE LEARNING",
            "semester": 5,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Machine learning – Types – Supervised learning, unsupervised, Reinforcement learning, semi supervised learning"
                },
                {
                    "title": "SUPERVISED LEARNING:",
                    "content": "Regression – Linear – Polynomial – Multiple regression – Evaluation measures – Bias –variance – overfitting – under fitting – Regularization     (8)"
                },
                {
                    "title": "CLASSIFICATION :",
                    "content": "Linear classification – Logistic regression – linear discriminant analysis – Optimization – Convex set - Convex functions – Loss functions  in machine learning - Gradient descent – variants – Perceptron - Support Vector Machines – Linear, Soft margin, Linearly non separable data - Kernel functions \t (10)"
                },
                {
                    "title": "NEURAL NETWORKS :",
                    "content": "Multilayer perceptron  - Back propagation – Training – Bayesian Classifier – Maximum A Posteriori estimate –  maximum likelihood estimation - K nearest neighbour classifier         (10)"
                },
                {
                    "title": "DECISION TREES :",
                    "content": "Introduction – Purity measures – Entropy, cross entropy,  information gain, gain ratio, Gini Index – Regression trees – ID3 – Pruning – Model selection – Bootstrapping and cross validation – Model evaluation – Performance Measures – Receiver operating characteristic curve (ROC) – AUC  (8)"
                },
                {
                    "title": "UNSUPERVISED LEARNING:",
                    "content": "Clustering –Types - K-means –Spectral clustering -  Cluster validity measures – dimensionality reduction-  PCA (Principal components analysis) - ICA (Independent components analysis)   - Outlier analysis    (5)"
                },
                {
                    "title": "GRAPHICAL MODELS:",
                    "content": "Bayesian networks – Hidden Markov models     (4)"
                }
            ],
            "textbooks": [
                "1.\tChristopher M Bishop, “Pattern Recognition and Machine Learning”, Springer, 2016.",
                "2.\tRichard O Duda, Peter E Hart and David G Stork, “Pattern Classification (Digitized)”, John Wiley, 2012."
            ]
        },
        {
            "code": "20XC54",
            "title": "COMPILERS AND PROGRAM ANALYSIS",
            "semester": 5,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "Introduction to formal languages:",
                    "content": "Introduction to grammars, Types of grammars, regular and context free grammars, Finite state automata, DFA and NFA.     (5)"
                },
                {
                    "title": "Introduction to compilers:",
                    "content": "Phases of compilers – compilers and interpreters –Lexical analysis – Specifications of tokens - Regular expressions  (5)"
                },
                {
                    "title": "Syntax analysis:",
                    "content": "Top-down Parsing – LL(1) parsing – LR(0), SLR(1) parsing – LALR and CLR(1) parsing – syntax directed definition  (7)"
                },
                {
                    "title": "Intermediate code generation:",
                    "content": "Syntax Tree, Three Address Code, Types and Declarations:  Translation of Expressions, conditional statements, looping statements, break and continue statements, array indexing, function calls – Quadrules, Triples and Indirect triples – Flow-of-control statements  (6)"
                },
                {
                    "title": "Run-time environments:",
                    "content": "Storage Allocation – Activation Trees- Activation Records – Parameter Passing Methods – Data Access with and without Nested Proceedures – Heap Management – Garbage Collection    (6)"
                },
                {
                    "title": "Code generation:",
                    "content": "Issues in the design of code generation - Program and Instruction Costs – Static and Stack Allocation of addresses in Target Code – Producing Code generators automatically.  \t  (5)"
                },
                {
                    "title": "Control and data flow analysis:",
                    "content": "Dominators and Postdominators – Loops and Strongly Connected Components – Reducibility – Iterative Data Flow Analysis – Lattices of flow functions – Control-Tree-based Data-flow analysis – Structural and Interval Analysis – Webs – Static Single-Assignment (SSA) Form\t  (7)"
                },
                {
                    "title": "Dependency analysis:",
                    "content": "Dependence Relations – Direction Vector - Basic Block Dependence DAGs – Dependence in Loops – Dependence Testing – Program-Dependence Graphs  (5)"
                },
                {
                    "title": "Code optimization and scheduling:",
                    "content": "Basic Blocks – Control Flow Graph – Value Numbering – Copy and Constant Propagation – Common Subexpression Elimination – Loop-invariant Code Motion - PeepHole Optimization – Instruction Scheduling – Software Pipeling    (5)"
                },
                {
                    "title": "Security analysis\t:",
                    "content": "Information flow, role of program analysis, applications, identifying string vulnerabilities, array out-of bound checks, null pointer analysis, dangling pointers, pointers beyond a range, type-based security, secure constructs and operations  (4)"
                }
            ],
            "textbooks": [
                "1.\tSteven Muchnick, “Advanced Compiler Design Implementation”, Morgan Kaufmann, 2003.",
                "2.\tAlfred Aho, Monica Lam, Ravi Sethi, Jeffrey Ullman, “Compilers: Principles, Techniques and Tools”, Pearson, 2014."
            ]
        },
        {
            "code": "20XC56",
            "title": "WINDOWS SYSTEM PROGRAMMING LAB",
            "semester": 5,
            "course_type": "regular",
            "credits": "0 0 2 1",
            "content": [
                {
                    "title": "INTRODUCTION TO WINDOWS SYSTEM:",
                    "content": "System architecture and evolution - Features of an operating system: kernel, virtual memory, multitasking, multithreading, sharing of resources, synchronization, concurrence - Working with the console - Windows SDK and Visual Studio - Gcc compiler, gdb debugger."
                },
                {
                    "title": "WINDOWS API (Win32 and Win64 API):",
                    "content": "Creation and use of static and dynamic libraries - Basic data types  - Tracking of system calls, reporting of errors,  - Management of exceptions - Obtaining of system information - Register handling - 32 and 64 bit application handling - .NET Framework. Development of System Libraries."
                },
                {
                    "title": "PROCESSES AND THREADS:",
                    "content": "Development of processes and threads, child processes - User space and kernel space - Process states - Process management, process groups - Process priorities - Process statistics, timers - Process suspending, time management - Console applications - Windows services - Aspects of security: process rights."
                },
                {
                    "title": "SYNCHRONIZATION:",
                    "content": "The concept of race - Critical sections, deadlock – Mutex – Semaphores – Events. Inter-process communication: Anonymous and named streams - Message Queues – Mail slot mechanism - Other mechanisms (clipboard, events)."
                },
                {
                    "title": "MEMORY:",
                    "content": "Memory access rights – Memory locking - Shared memory - Memory mapping."
                },
                {
                    "title": "OPERATIONS ON FILES:",
                    "content": "File system management - Write/read buffers - Symbolic and hard links - Temporary files - Asynchronous input/output - Aspects of security: file access rights."
                },
                {
                    "title": "NETWORK SERVICES:",
                    "content": "Client-service architecture - Winsock and Berkeley sockets - TCP socket programming - UDP socket programming - IPv4 and IPv6 protocol management."
                },
                {
                    "title": "PRACTICALS:",
                    "content": "1.\tDevelop, debug, and test Windows application programs using current Microsoft Visual Studio versions.\n                    2.\tUsage of basic I/O, including the file and console I/O, along with file and directory management and registry programming.\n                    3.\tUsage of structured exception handling (SEH) to simplify programming and increase reliability.\n                    4.\tUsage of memory management and memory-mapped files to improve performance and share memory between processes.\n                    5.\tUnderstand process management and inter-process communication using pipes.\n                    6.\tCreate networked client/server applications using named pipes as well as Windows Sockets.\n                    7.\tManage and synchronize threads using mutexes, semaphores, events, CRITICAL_SECTION objects, slim reader/writer (SRW) locks, and condition variables.\n                    8.\tUsage of Windows services to deploy manageable server systems.\n                    9.\tSecuring Windows objects.\n                    10.\tDevelop dynamic link libraries (DLLs) that can be shared by multiple processes and loaded dynamically at run time."
                }
            ],
            "textbooks": [
                "1.\tJohnson M. Hart, “Windows System Programming”, Addison-Wesley, 2010.",
                "2.\tJohnson M. Hart, “Win32 System Programming: A Windows 2000 Application Developer's Guide”, Addison-Wesley, 2001."
            ]
        },
        {
            "code": "20XC57",
            "title": "WEB ENGINEERING LAB",
            "semester": 5,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XC58",
            "title": "ETHICAL HACKING LAB",
            "semester": 5,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "INTRODUCTION TO HACKING :",
                    "content": "Introduction to Hacking – Importance of Security – Elements of Security – Phases of an Attack – Types of Hacker Attacks – Hacktivism – Vulnerability Research – Introduction to Footprinting – Information Gathering Methodology – Footprinting Tools – WHOIS Tools – DNS Information Tools – Locating the Network Range – Meta Search Engines."
                },
                {
                    "title": "SCANNING AND ENUMERATION :",
                    "content": "Introduction to Scanning – Objectives – Scanning Methodology – Tools – Introduction to Enumeration – Enumeration Techniques – Enumeration Procedure – Tools."
                },
                {
                    "title": "SYSTEM HACKING:",
                    "content": "Introduction – Cracking Passwords – Password Cracking Websites – Password Guessing – Password Cracking Tools – Password Cracking Counter measures – Escalating Privileges –Executing Applications – Keyloggers and Spyware."
                },
                {
                    "title": "VULNERABILITY ANALYSIS :",
                    "content": "Vulnerability Assessment Concept - Life-Cycle - Vulnerability Assessment Solutions - Vulnerability Scoring Systems - Vulnerability Scanning - Nessus Tool - Windows OS Vulnerabilities – Tools for Identifying Vulnerabilities – Countermeasures – Linux OS Vulnerabilities – Tools for Identifying Vulnerabilities – Countermeasures."
                },
                {
                    "title": "SOCIAL ENGINEERING AND DENIAL-OF-SERVICES :",
                    "content": "Social Engineering – Concepts - Phases of a Social Engineering Attack - Types of Social Engineering- Insider Attack- The process of Identity theft- Social Engineering Countermeasures – DoS/DDoS  - Attack Techniques - Basic Categories - Botnets - Other DDoS Attack tools - countermeasure Strategies"
                },
                {
                    "title": "PRACTICALS:",
                    "content": "1.\tMaltego Tool, Recon-ng Overview, FOCA Tool Overview Countermeasures of Footprinting \n                    2.\tGathering information using Windows Command Line Utilities, Downloading a Website using Website Copier tool (HTTrack), Gathering information using Metasploit\n                    3.\tCreating Network Topology Map using Tool Prepare Proxies\n                    4.\tServices Enumeration using Nmap NetBIOS Enumeration NetBIOS Enumeration Tool\n                    5.\tEnumeration using SuperScan Tool Enumerating Shared Resources Using Net View\n                    6.\tEnumeration using SoftPerfect Network Scanner Tool\n                    7.\tVulnerability Scanning using Nessus Vulnerability Scanning Tool\n                    8.\tPassword Cracking using Pwdump7 and Ophcrack tool. \n                    9.\tNTFS Stream Manipulation\n                    10.\tImage Steganography Covering Tracks \n                    11.\tClearing Audit Policies, logs on Windows and clearing logs on Linux\n                    12.\tHTTP RAT Trojan\n                    13.\tTo Defend Against DNS Spoofing Sniffing Tools - Wireshark\n                    14.\tSocial Engineering using Kali Linux"
                }
            ],
            "references": [
                "1.\tEc-Council, “Ethical Hacking and Countermeasures: Attack Phases”, Delmar Cengage Learning, 2009",
                "2.\tMichael T. Simpson, Kent Backman, James E. Corley, “Hands-On Ethical Hacking and Network Defense”, Cengage Learning, 2012.",
                "3.\tPatrick Engebretson, “The Basics of Hacking and Penetration Testing – Ethical Hacking and Penetration Testing Made Easy”, Syngress Media, 2013.",
                "4.\tJon Erickson, “Hacking: The Art of Exploitation”, No Starch Press, 2008.",
                "5.\tRafayBaloch, “Ethical Hacking And Penetration Testing Guide”, CRC Press, Taylor & Francis Group,2015"
            ]
        },
        {
            "code": "20XC61",
            "title": "CLOUD SECURITY",
            "semester": 6,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION TO PARALLEL AND DISTRIBUTED COMPUTING:",
                    "content": "Introduction, Architecture and Distributed computing models and technologies SOA, Web Services     (4)"
                },
                {
                    "title": "GRID, CLUSTER AND UTILITY COMPUTING",
                    "content": "Introduction, Architecture, Pros & Cons, Real time applications.(2)"
                },
                {
                    "title": "INTRODUCTION TO CLOUD COMPUTING:",
                    "content": "Definition, History, Comparison of Cloud Computing with Grid, Cluster and Utility Computing, Deployment models – Private, Public, Hybrid and Community - Pros and Cons of Cloud Computing.  SaaS, PaaS, IaaSetc,. (5)"
                },
                {
                    "title": "VIRTUALIZATION AND CONTAINERS:",
                    "content": "Types of Virtualization, Tools for Virtualization, Architecture of VMM, Virtualization for Cloud, Container Technology   (5)"
                },
                {
                    "title": "MAP REDUCE PARADIGMS:",
                    "content": "ntroduction, GFS Architecture, HDFS Architecture, Hbase, Google big Table, Amazon’s (key value) pair storage and Microsoft’s Azure infrastructure, Map reduce programming  examples (5)"
                },
                {
                    "title": "CLOUD COMPUTING FRAMEWORK AND APPLICATIONS",
                    "content": "Amazon EC2, S3 storage services, Distributed search engine and distributed data mining in the cloud.  \t  (2)"
                },
                {
                    "title": "SECURITY PATTERNS FOR CLOUD COMPUTING",
                    "content": "Trusted Platform Geo-tagging, Cloud VM Platform Encryption, Trusted Cloud Resource Pools, Secure Cloud Interfaces, Cloud Resource Access Control, Cloud Data Breach Protection, Permanent Data Loss Protection, In-Transit Cloud Data Encryption, Security Patterns for Cloud Computing – Network Security, Identity & Access Management      (7)"
                },
                {
                    "title": "CLOUD SECURITY:",
                    "content": "Concepts of security, Threats and Risk analysis, Attacks in cloud, STRIDE model, Infrastructure security Cloud security, regulatory mandates, audit policies and compliance requirements y guidelines prescribed by NIST, Cloud Security Alliance and ENISA, Virtualization and Container security.  (8)"
                },
                {
                    "title": "ADVANCED CLOUD SECURITY:",
                    "content": "Trustworthy cloud infrastructures, Differential privacy, secure computations, High-availability and integrity layer for cloud storage, Homomorphic encryption, , Cloud forensics.   (7)"
                }
            ],
            "textbooks": [
                "1.     Vic (J.R.) Winkler, “Securing the Cloud: Cloud Computing Security Techniques and Tactics”, Syngress / Elsevier, 2011.",
                "2.     Thomas Erl, “Cloud Computing Design Patterns”, Prentice Hall, 2015."
            ]
        },
        {
            "code": "20XC62",
            "title": "UBIQUITOUS  COMPUTING",
            "semester": 6,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "WIRELESS NETWORK OVERVIEW:",
                    "content": "Wired and wireless Networks- Effect of mobility on systems- Introduction to wireless technologies- RF Overview - Wireless Signal Propagation-Signal-to-Noise Ratio – Modulation - ISM Spectrum - Frequency Hopping Spread Spectrum (FHSS) - Direct Sequence Spread Spectrum (DSSS)- Orthogonal Frequency Division Multiplexing (OFDM) -Coordination mechanisms and MAC protocols for multi-user network access    (6)"
                },
                {
                    "title": "WIRELESS THREATS AND RISKS:",
                    "content": "Security breaches on wireless Networks- Eavesdropping-Jamming - RF interference -Covert wireless channels-Traffic Analysis Spoofing- DOS attack - Malicious Code -Cryptographic threats        (4)"
                },
                {
                    "title": "WIRELESS LOCAL AREA NETWORK (WLAN):",
                    "content": "IEEE 802.11 Standard-SSID- 802.1x – WPA -WPA2- WEP (wired Equivalence Privacy -  WLAN Security Architectures-Authentication - WPA and 802.1x Vulnerabilities - Authentication Server- (RADIUS)- Extensible Authentication Protocol (EAP)-  RADIUS Vulnerabilities-Rogue Access Points Detection-MAC Filtering Attacks - Attack on MiC - Wireless VPN Architecture Overview   \t (8)"
                },
                {
                    "title": "WIREELSS DATA NETWORKS:",
                    "content": "RFID – NFC - Low Power Personal Area networks (LowPAN): Overview, 6LowPAN, IEEE 802.15.4, BLE, Zigbee, Zwave, and Thread - Wi-Fi - Low Power Wide Area Networks (LPWAN): Concepts and features, SigFox, LoraWAN, LPWAN-3GPP - Comparing different LPWAN technologies.     (10)"
                },
                {
                    "title": "SECURITY IN WIREELSS DATA NETWORKS:",
                    "content": "Wireless Device security issues -- End-to-End Security-RFID Security - Security architecture in Bluetooth Networks, Sensor networks, Security Issues in ZigBEE:-BLE Security: Threats to BLE Devices and Networks -Architecture and Protocols for AAA in the Future Wireless Communications Networks.     (9)"
                },
                {
                    "title": "IoT ARCHITECTURE:",
                    "content": "IoT Enabling Technologies- Components of IoT – IPV6 – CoAP: Architecture, Features, Applications - MQTT: Architecture- Security in IoT:–Eavesdropping Attacks, Encryption Attacks –– Blockchain in IoT security.         (8)"
                }
            ],
            "textbooks": [
                "1.\tLei Chen, JiahuangJi, Zihong Zhang, Wireless Network Security, Springer Science & Business Media,2013",
                "2.\tHakimaChaouchi, Maryline Laurent, Maknavicius,” Wireless and Mobile Network security”, 2010.",
                "3.\tBrian Russell, Drew Van Duren, \"Practical Internet of Things Security\", Packt Publishing, 2016",
                "4.\tAdrian McEwen and Hakim Cassimally, “Designing the Internet of Things”, John Wiley and Sons  Ltd, UK, 2014.",
                "5.\tAaron E. Earle,”Wireless Security Handbook” ,Taylor & Francis Group, LLC,2006"
            ]
        },
        {
            "code": "20XC63",
            "title": "CYBER SECURITY ANALYTICS",
            "semester": 6,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Motivation for Data Mining – Importance – Definition – Kinds of data for  Data Mining – Data Mining functionalities – Patterns – Classification of Data Mining Systems – Major issues in Data Mining-Overview of  Data Mining Techniques. Data preprocessing: Types of data, Data cleaning-Smoothing, Handling missing values- Feature subset selection –Chi square and Information Gain- Sampling methods- Successful ML applications in Cyber security-Preprocessing raw security data for data mining and feature engineering     (10)"
                },
                {
                    "title": "MINING FREQUENT PATTERNS, ASSOCIATIONS AND CORRELATIONS:",
                    "content": "Basic concepts – Efficient and Scalable Frequent Itemset Mining methods – Apriori, FP Tree   (5)"
                },
                {
                    "title": "CLASSIFICATION AND CLUSTERING:",
                    "content": "Overview of Classification techniques –Ensemble Learning-bagging, boosting, cascading, stacking – Clustering  - density based clustering- Hierarchical clustering – Case studies like encrypted traffic classification ,clustering user activity to detect DDOS attacks and mass exploitation - ANOMALY DETECTION: Network Anomaly Detection – Detecting anomalous user behavior (10)"
                },
                {
                    "title": "TEXT MINING:",
                    "content": "Statistical Characteristics of Text: Zipf's law, Simple tokenizing, stop-word removal, and stemming; inverted indices, TF-IDF (term frequency/inverse document frequency) weighting - cosine similarity, Text Categorization: Rocchio; Naïve Bayes, Web Mining:  Link analysis: Hubs and Authorities, PageRank- Text mining in cybersecurity  (8)"
                },
                {
                    "title": "MINING DATA STREAMS:",
                    "content": "Challenges- Characteristics of Streaming Data, Issues and Challenges, Streaming Data Mining Algorithms, Any time stream Mining – Identifying  emerging class/patterns in streaming data- Applications in intrusion detection, insider threat detection, website fingerprinting, and textual stream  (6)"
                },
                {
                    "title": "VISUAL SECURITY ANALYSIS:",
                    "content": "Traffic monitoring and analysis – Firewall log analysis – Email data analysis – Vulnerabilty data visualization – Insider threat visualization – Data visualization tools      (6)"
                }
            ],
            "textbooks": [
                "1.\tJiawei Han and Micheline Kamber , “Data Mining – Concepts and Techniques”, Morgan Kaufmann  Publishers, 2012.",
                "2.\tTan, Steinbach and Kumar, “Introduction to Data Mining”, Pearson Education, 2014.",
                "4.\tChristopher D. Manning, Prabhakar Raghavan and Hinrich Schütze, “Introduction to Information Retrieval”, Cambridge University Press, 2012"
            ]
        },
        {
            "code": "20XC64",
            "title": "SECURE CODING",
            "semester": 6,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "The Need for Secure Systems, Trustworthy Computing, The Attacker’s Advantage and the Defender’s Dilemma,  Vulnerability Cycle, Principles of Security Architecture, Java  Sandbox          (6)"
                },
                {
                    "title": "SOFTWARE DEVELOPMENT PROCESS :",
                    "content": "Proactive Security Development Process, Secure Software Development Cycle, Security issues while writing SRS, Process Improvements, Design Phase, Development Phase, Test Pha se, Shipping and Maintenance Phases, Security Principles, Secure Product Development timeline                                 (12)"
                },
                {
                    "title": "THREAT MODELING :",
                    "content": "Secure Design Through Threat Modeling, Decompose the Application, Determine the Threats to the System, Rank the Threats by Decreasing Risk, Choose How to Respond to the Threats, Choose Techniques to Mitigate the Threats, Security Techniques, Authentication, Authorization, Tamper-Resistant and Privacy-Enhanced Technologies, Encryption, Hashes, MACs, and Digital Signatures, Auditing, Filtering, Throttling, and Quality of Service, Least Privilege          \t (8)"
                },
                {
                    "title": "SECURE CODING TECHNIQUES:",
                    "content": "Buffer Overrun, Stack Overruns, Heap Overruns, Array Indexing Errors, Format String Bugs, Preventing Buffer Overruns                 (7)"
                },
                {
                    "title": "ACCESS CONTROL:",
                    "content": "Determining Appropriate Access Control, Running with Least Privilege      (5)"
                },
                {
                    "title": "CRYPTOGRAPHY CODING:",
                    "content": "Poor Random Numbers, Using Passwords to Derive Cryptographic Keys, Key Management Issues, Creating Your Own Cryptographic Functions, Protecting Secret Data, Creating a Salted Hash         (8)"
                },
                {
                    "title": "CANONICAL REPRESENTATION:",
                    "content": "Canonical Filename Issues, Canonical Web-Based Issues,  Preventing Canonicalization Mistakes, Web-Based Canonicalization Remedies          (7)"
                },
                {
                    "title": "DENIAL OF SERVICE:",
                    "content": "Protecting Against Denial of Service Attacks, Application Failure Attacks, CPU Starvation Attacks, Memory Starvation Attacks, Resource Starvation Attacks, Network Bandwidth Attacks       (7)"
                },
                {
                    "title": "SECURITY TESTING:",
                    "content": "Building Security Test Plans from a Threat Model, Testing Clients with Rogue Servers, Testing with Security Templates, Test the End-to-End Solution, Determining Attack Surface,  Risk Assessment Methodologies   (8)"
                },
                {
                    "title": "MAINTENANCE:",
                    "content": "Performing a Security Code Review, Secure Software Installation, Building Privacy into Your Application, Writing Security Documentation and Error Messages     (6)"
                }
            ],
            "textbooks": [
                "1.\tMichael Howard, David LeBlanc, \"Writing Secure Code\", Microsoft Press, 2003.",
                "2.\tRobert C. Seacord, \"Secure Coding in C and C++: Secure Coding in C and C++\", Addision Wesley, 2013.",
                "3.\tKenneth van Wyk, Mark Graff, \"Secure Coding: Principles and Practices\", O'Reilly Media, 2009."
            ]
        },
        {
            "code": "20XC66",
            "title": "CLOUD SECURITY LAB",
            "semester": 6,
            "course_type": "regular",
            "credits": "0 0 2 1"
        },
        {
            "code": "20XC67",
            "title": "CYBER SECURITY ANALYTICS AND VISUALIZATION LAB",
            "semester": 6,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XC68",
            "title": "DISTRIBUTED ENTERPRISE COMPUTING LAB",
            "semester": 6,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "DISTRIBUTED MULTI-TIER COMPUTING:",
                    "content": "Introduction – Basis of distributed computing - Centralized vs Distributed systems – Distributed operation system – Single System image – transparencies– decomposition approaches – layers and tiers."
                },
                {
                    "title": "CLIENT/SERVER COMPUTING:",
                    "content": "Approaches to client server computing –enterprise architectural overview - component based software development for enterprise – java enterprise system - operating system services for client – server types – server side scripting – operating system services for server – client and server software requirements"
                },
                {
                    "title": "MIDDLEWARE:",
                    "content": "Architecture – classification of middleware – database middleware – drivers, connection, statements - communication middleware – transaction middleware – isolation – interfacing."
                },
                {
                    "title": "ENTERPRISE WEB COMMUNICATION:",
                    "content": "Java servlets – HTTP Servlet, generic servlets, Java server pages – elements of JSP – JSTL."
                },
                {
                    "title": "MULTI-TIER ENTERPRISE COMPUTING:",
                    "content": "Middleware services – development and deployment -  Enterprise Java Beans – types – lifecycle – entities – POJO – POJI – Java persistent query language  - accessing ejbs using JSP – XML processing APIs"
                },
                {
                    "title": "DISTRIBUTED ENTERPRISE COMMUNICATION:>",
                    "content": "RMI – CORBA – DCOM – Java Messaging Service – Message oriented middleware services – publish/subscribe messaging – AJAX – JSON"
                },
                {
                    "title": "JAVA WEB SERVICES:",
                    "content": "Web service standards – Describing and publishing – JAX-WS – SOAP"
                },
                {
                    "title": "DISTRIBUTED ENTERPRISE SYSTEMS:",
                    "content": "Services using EJB: Naming Services, Directory and Trading services, Activation Services, Transaction Services, Security Services"
                },
                {
                    "title": "FRAMEWORKS:",
                    "content": "NStruts - Java Server Faces – Spring – Hibernate – Ruby on Rails"
                },
                {
                    "title": "PRACTICALS:",
                    "content": "1.\tDevelop a host application and install it in another system.\n                    2.\tConvert the developed application to two, three and multi-tiered application using the latest front and back end technologies.\n                    3.\tMigrate the application to distributed environment.\n                    4.\tDemonstrate the communication between the tiers using interfaces.\n                    5.\tSession beans.\n                    6.\tEntity and Message Driven Beans.\n                    7.\tRMI communication between two applications.\n                    8.\tWeb Service with its client.\n                    9.\tConversion of entity bean to web service.\n                    10.\tJava Transaction API.\n                    11.\tApplication using any one of the frameworks."
                }
            ],
            "textbooks": [
                "1.\tRobert Orfali, Dan Harkey and Jeri Edwards, “Client / Server survival Guide”, Wiley, 2011.",
                "2.\tRima Patel Sriganesh, Gerald Brose and Micah Silverman, Mastering Enterprise JavaBeans 3.0”, Wiley, 2006.",
                "3.\tRod Johnson, Juergen Hoeller, Alef Arendsen, Thomas Risberg and Colin Sampaleanu, “Professional Java Development with the Spring Framework”, Wiley, 2008."
            ]
        },
        {
            "code": "20XCP1",
            "title": "PROJECT WORK II – INDUSTRY / RESEARCH PROJECT"
        },
        {
            "code": "20XC81",
            "title": "SOFTWARE SECURITY AND EXPLOITATION",
            "semester": 8,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "LINUX DEBUGGING SUPPORT:",
                    "content": "The Kernel Execution and Programming Context - Introduction to Linux kernel exploits - Kernel debugging - GDB scripting engine and developing helper scripts - Dynamic debugging with kprobes / jprobes – Dtrace: programming, implementation/design, internals - /proc internals - Path of packet through kernel.    (8)"
                },
                {
                    "title": "LINUX EXPLOITATION TECHNIQUES:",
                    "content": "Architecture-specific exploitation techniques - Fixating the system and recovering the kernel state - Information leaks (environment and code-based) - Out of bounds (OOB) access vulnerabilities - Integer vulnerabilities (signedness, typecasting, overflows). (8)"
                },
                {
                    "title": "ROP, ASLR and DEP:",
                    "content": "Race conditions and Privilege escalation techniques - Read/write (controlled, partially-controlled and uncontrolled) primitives and ret2usr attacks - Stack smashing – ret2libc attacks - Heap vulnerabilities (heap overflows, UAF, off-by-X) – Supervisor Mode Execution Protection / Access Protection / Kernel Page Table Isolation bypasses - Current UAF exploitation countermeasures and bypasses -  Universal heap sprays - Double fetches - Latest kernel exploitation mitigations – Return Oriented Programming (ROP), Address Space Layout Randomization (ASLR) and Data Execution Prevention (DEP).                      (8)"
                },
                {
                    "title": "WINDOWS KERNEL DEBUGGING AND EXPLOITATION:",
                    "content": "Understanding the Windows kernel - Navigating the Windows kernel - Modern kernel protections - Debugging the Windows 10 kernels and drivers – WinDbg - Analyzing kernel vulnerabilities and vulnerability types - Kernel exploitation techniques - Token stealing and information disclosure vulnerabilities.  (7)"
                },
                {
                    "title": "WINDOWS EXPLOITATION:",
                    "content": "Fuzzing – Triggering the vulnerability - Crafting the attack string - Return to stack vs Return through registers -  Windows Egg Hunting - Function pointer overwrites Windows Heap Spraying – Kernel Pool Exploitation – Windows Shellcode - Exploiting with Structured Exception Handlers (SEH) - Advanced stack-smashing on Windows – Using Windows ROP - Building ROP chains to defeat DEP and bypass ASLR -  Metaspoilt Exploit.  (6)"
                },
                {
                    "title": "OFFENSIVE POWERSHELL:",
                    "content": "Powershell fundamentals - Downloading and execution of payloads and scripts - Obfuscation, Information Gathering, and Post-Exploitation(Information Gathering and Exfiltration, Backdoors, Privilege Escalation, Getting system secrets, Passing the hashes/credentials, PowerShell Remoting, WMI and WSMAN for remote command execution, Web Shells, Achieving Persistence) – Powershell and Metaspoilt - “Living Off The Land” concept - Powershell pentesting frameworks and tools including, Nishang, PowerSploit, and Empire - mimikatz, privsec, persistence, lateral movement - Powershell log analysis, malicious cases with Powershell (scheduled tasks, jobs, HIDs).     (8)"
                }
            ],
            "textbooks": [
                "1.  Yang Lixiang, Liang Wenfeng, “The Art of Kernel Linux design”, CRC Press, 2016",
                "2.\tPhil Bramwel, “Hands-On Penetration Testing on Windows”, Packt, 2018.",
                "3.\tDavid das Neves, Jan-Hendrik Peters, “Learn PowerShell Core 6.0: Automate and Control Administrative Tasks using DevOps Principles”, Packt, 2018.",
                "4.\tEnrico Perla, Massimiliano Oldani, “A Guide to Kernel Exploitation: Attacking the Core”, Syngress, 2011."
            ]
        },
        {
            "code": "20XC82",
            "title": "MOBILE SECURITY",
            "semester": 8,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "FUNDAMENTALS OF ANDROID INTERNALS:",
                    "content": "The Android Architecture - Anatomy of Android Application - Android Packages (APK), Application Components, JNI – Android IPC – Android Framework Services- Application Internals – Dalvik Internals – Android Run Time (ART) Internals – Android Partitions and File Systems.   (5)"
                },
                {
                    "title": "INTRODUCTION TO ANDROID SECURITY:",
                    "content": "Mobile application threat model - What makes mobile application security so different? - The Android Linux OS security - The Android security mechanisms - Application file system isolation & insecure file access - The permission model - Database isolation - The Android emulator Vs Physical device - The debug bridge - Rooting.\t  (7)"
                },
                {
                    "title": "STATIC ANALYSIS – REVERSE ENGINEERING AND PATCHING THE APPLICATION BINARIES:",
                    "content": "The APK file package - APK extraction - Investigating layout, manifest, permissions and binaries - Extracting the content of the classes.dex file - Using smali/baksmali Dalvik assembler/disassembler - Decompilation - Using dex2jar - Reverse engineer the app and change its behavior - Decompile / disassemble the dex classes using smali/baksmali - Code patching - Modifying the code - Recompile  - Resign the APK. Device Rooting. (7)"
                },
                {
                    "title": "APPLICATION DYNAMIC RUNTIME ANALYSIS:",
                    "content": "Monitoring process activity - Observing file access - Monitoring network connectivity - Analyzing logs using logcat - Memory dumps and analysis – Smali Debugging - Setting breakpoints - Native debugging with IDA (building signatures, types etc.) - Runtime instrumentation and manipulation using ReFrameworker. (7)"
                },
                {
                    "title": "TRAFFIC ANALYSIS AND MANIPULATION:",
                    "content": "Common vulnerabilities related to traffic -Proxies and sniffers - Sensitive information transmission -Importing SSL certificates & trusted CA's - Bypassing server certificate validations - Exposing insecure traffic   -Validating server certificates and avoiding man-in-the-middle -SSL Pinning -Using the HostnameVerifier class - Using SSL with the HttpsURLConnection class -Client-side certificate authentication.  (7)"
                },
                {
                    "title": "COMPONENT & IPC SECURITY:",
                    "content": "Major component types – Activity, Service, Content provider, Broadcast receiver - The intent structure - The intent filter -Component permissions and visibility -Authenticating Callers of Components -Binder interface -Pending intents -Direct component invocation by unauthorized apps - Unprotected content providers -Sticky broadcasts -Securely activating components - Avoiding access to restricted screens.     (7)"
                },
                {
                    "title": "IDENTIFYING CODE LEVEL VULNERABILITIES & DEVICE AND DATA SECURITY:",
                    "content": "Verifying caller identity -Whitebox approach -using a code review - Locating interesting code - Detecting common code level vulnerabilities - Using Lint.\tData Storage – Device Administration API – Third Party Code – Device Tracking.     (5)"
                }
            ],
            "textbooks": [
                "1.\tJonathan Levin, “Android Internals – A Confectioners Cookbook, Volume II – The Developer’s View”, 2017.",
                "2.\tNeil Bergman, Mike Stanfield, Jason Rouse, Joel Scambray, “Hacking Exposed: Mobile Security Secrets and Solutions”, McGraw Hill, 2013.",
                "3.\tJoshua J. Drake, Zach Lanier, Collin Mulliner, Pau Oliva Fora,  Stephen A. Ridley, Georg Wicherski, “Android Hacker's Handbook”, Wiley, 2014."
            ]
        },
        {
            "code": "20XC83",
            "title": "DATA PRIVACY",
            "semester": 8,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Foundations of privacy :Conceptual framework - Fair information principles, Privacy and Contextual Integrity, Privacy regulations, Goals of Privacy engineering, taxonomy of privacy, Privacy engineering development process- Importance of Privacy Framework- General Data Protection Regulation (GDPR)- Attacks on private data            (8)"
                },
                {
                    "title": "DATA PRIVACY MODELS AND DISCLOSURE RISK MEASURES:",
                    "content": "Formal model of Data privacy, K-anonymity: Definition of k-anonymity, Practical Implications, Mechanism design, Differential Privacy: Definition of Differential Privacy (DP), Privacy and databases, Promise of DP, Formalizing DP, Lower bounds, Mechanism Design, Machine learning and Differential Privacy, Disclosure Risk Measures: Attribute disclosure, identity disclosure, Evaluating the risk  of disclosure - Limitations of K-anonymity, A statistical framework for Differential Privacy- DP for graphs & social networks, Weakness of Differential Privacy\t  (10)"
                },
                {
                    "title": "MASKING METHODS:",
                    "content": "Perturbative methods - Non-Perturbative methods - Synthetic Data Generators - Masking methods - Data protection procedures for constrained data - masking methods and Big data              (8)"
                },
                {
                    "title": "PRIVACY ENGINEERING PROCESS:",
                    "content": "Developing Privacy Policies - Elements of Privacy Engineering Development - Designing a Privacy Policy - Developing Privacy Engineering requirement - Privacy Requirements Engineering - Privacy Engineering Lifecycle Methodology                          (6)"
                },
                {
                    "title": "ORGANIZING FOR THE PRIVACY:",
                    "content": "Privacy Responsibilities - Privacy Awareness - Readiness Assessment - Building Operational Plan - Building  Communication and Training plan         (4)"
                },
                {
                    "title": "LEARNING WITH PRIVACY:",
                    "content": "Privacy Leakage in Machine Learning - Bias in Algorithms -Existence and Detection - Fairness in ML- Privacy Compliance in Big Data Systems      (7)"
                },
                {
                    "title": "CASE STUDIES:",
                    "content": "Tracking using cookies, linkage attacks, DP in biomedical datasets     (2)"
                }
            ],
            "textbooks": [
                "1.   Michelle Dennedy, Jonathan Fox, Tom Finneran,  \"The Privacy Engineer's Manifesto: Getting from Policy to Code to QA to Value\", Apress, 2014.",
                "2.   Vicenc Torra, \"Data Privacy: Foundations, New Developments and Big Data Challenge\", Springer, 2017.",
                "3.   Tianqing Zhu, Gang Li, Wanlei Zhou, Philip S. Yu, \"Differential Privacy and Applications\", Springer, 2017."
            ]
        },
        {
            "code": "20XC86",
            "title": "SOFTWARE SECURITY AND EXPLOITATION LAB",
            "semester": 8,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "LINUX EXPLOIT DEVELOPMENT",
                    "content": "1.\tHidden Function\n                    2.\tSet-UID Privileged Programs \n                    3.\tRace Condition Vulnerability\n                    4.\tShellshock Attack\n                    5.\tLinux Basic Stack Overflow \n                    6.\tStrict Firewall Bypass (Format String Exploitation + Socket Reuse Shellcode)\n                    7.\tLinux NX Bypass (ret2libc)\n                    8.\tLinux x64 NX Bypass (ret2libc + ROP) \n                    9.\tLinux NX & ASLR Bypass (Format String Exploitation + ROP) \n                    10.\tLinux Shellcoding\n                    11.\tOvercome ret2libc Limitations"
                },
                {
                    "title": "WINDOWS EXPLOIT",
                    "content": "1.\tWindows Basic Stack Overflow \n                    2.\tWindows SEH Overflow \n                    3.\tWindows Egghunting\n                    4.\tWindows Shellcoding\n                    5.\tFuzzing Windows Software\n                    6.\tWindows ROP \n                    7.\tWrite Metaspoilt Exploit\n                    8.\tLeveraging PowerShell During Exploitation\n                    9.\tPowerShell for Post-exploitation and Lateral Movement\n                    10.\tWorking with several powershell pentesting frameworks and tools including - Nishang, PowerSploit, and Empire"
                }
            ]
        },
        {
            "code": "20XC87",
            "title": "MOBILE SECURITY LAB",
            "semester": 8,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XC87",
            "title": "MALWARE ANALYSIS LAB",
            "semester": 8,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Malware - Types of malware, Malware history, Malware Behaviour, Spreading techniques- Social engineering, Using worms, Mass email campaign, Real world scenario, Attack scenarios, Obfuscation - Types of obfuscation, Obfuscation techniques."
                },
                {
                    "title": "GOALS:",
                    "content": "The Goals of Malware Analysis-Malware Analysis Techniques-Basic Static Analysis: Antivirus Scanning: A Useful First Step, Hashing: A Fingerprint for Malware, Finding Strings, Packed and Obfuscated Malware, Portable Executable File Format, Linked Libraries and Functions."
                },
                {
                    "title": "DOCUMENT FORMAT ANALYSIS:",
                    "content": "General Approach to Document Analysis, analyzing malicious documents, such as Microsoft Office, RTF and Adobe Acrobat (PDF) files. Case study on various open source Document Analysis Tools."
                },
                {
                    "title": "STATIC MALWARE ANALYSIS:",
                    "content": "Win32 Platform Overview, Platform Components Overview, Process Tracing and Analysis Tools, API Hooking Techniques, Debugging Tools for Windows, Scripted Debugging, x86 disassembly."
                },
                {
                    "title": "DYNAMIC MALWARE ANALYSIS:",
                    "content": "Indicators of Compromise (IOC's) such as file hashes, domain names, network traffic, strings, registry keys, files names, file paths, process names, URLs and IP addresses, Sandboxes, Running Malware, Monitoring with Process Monitor, debugging, exceptions, OllyDbg."
                },
                {
                    "title": "ANTI-REVERSE ENGINEERING:",
                    "content": "Anti-disassembly, anti-disassembly techniques Obscuring Flow Control, Anti-debugging technique."
                },
                {
                    "title": "CASE STUDIES:",
                    "content": "Case studies with different families of recent malwares."
                }
            ],
            "textbooks": [
                "1.\tMichael Sikorski and Andrew Honig, “ Practical Malware Analysis”, No Starch Press,2012",
                "2.\tDang, Gazet, Bachaalany, “Practical Reverse Engineering”,Wiley,2014",
                "3.\tYin, Heng, Dawn Song. “Automatic Malware Analysis: An Emulator Based Approach”, Springer Science & Business Media, 2012."
            ]
        },
        {
            "code": "20XC91",
            "title": "THREAT HUNTING",
            "semester": 9,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION TO THREAT HUNTING:",
                    "content": "Need for threat hunting - Incident Response - Incident Response Process  - Incident Response & Hunting - Risk Assessment  & Hunting  - Hunting mindset: Threat Intelligence - Using threat intelligence to hunt - Hunter mindset: Forensics - Using digital forensics to hunt - Intelligence Simulation - APT (Advanced Persistent Threat) - TTP (Tools, Tactics, and Procedures)  - Pyramid of Pain  - The Cyber Kill Chain Model  - The Diamond Model  - Ad hoc vs. Systematic approach for Threat Hunting.\t\t\t\t\t\t\t\t\t\t\t\t                (6)"
                },
                {
                    "title": "INTRODUCTION TO SECURITY OPERATIONS CENTER (SOC) & CLOUD SOC:",
                    "content": "The Importance of Building a Security Operations Center  -  SOC Functions - Optimizing a security operations model - Benefits and Challenges of Cloud Applications - Problems CloudSOC Solves - CloudSOC tools, information sources, and traffic flows. Understanding the CloudSOC data protection workflow - Using CloudSOC to control data exposure - Integrating CloudSOC with Information Centric Encryption (ICE) - Integrating CloudSOC with SIEM solutions.\t\t\t\t\t\t\t\t                                               (7)"
                },
                {
                    "title": "NETWORK LOGS, ENDPOINT LOGS, AD LOGS, WINDOWS EVENT LOGS, WEBLOGS:",
                    "content": "Endpoint logs: Understanding value - Methods of collection - Adding additional logging - Windows filtering and tuning - Analyze critical events based on attacker patterns - Host-based firewall logs - Credential theft and reuse - Monitor PowerShell. Event IDs, Logging and SIEMs: Windows Event Logs - Windows Event IDs - Windows Event Forwarding - Log Rotation & Log Clearing - PowerShell Logging – Sysmon – SIEM platforms - SIEM Architecture - SIEM Solution: ELK - Splunk –Security Onion. Network and Application Authentication Server Logs - Web Server Logs.\t\t\t\t\t\t\t\t\t\t\t\t              (10)"
                },
                {
                    "title": "LOG CORRELATION AND VISUALIZATION:",
                    "content": "Active Dashboards and Visualizations - Correlate network datasets - Build frequency analysis tables - Establish network baseline activity - Centralized log collection - Automate event log normalization and correlation - determining data for compliance and audits - Managing Endpoint Detection and Response (EDR) logs - Visualizing Log & Event Data - Exposing Significant Patterns -  Pinpointing data and Global Visibility. (7)"
                },
                {
                    "title": "ANOMALY DETECTION AND MACHINE LEARNING FOR THREAT HUNTING:",
                    "content": "How Machine Intelligence Applies to Threat Hunting - Building a Machine Intelligence Capability to Support Threat Hunting - Leveraging machine learning to orchestrate and automate SOC – Machine learning ranking model for validating the true and false positives in threat hunting.\t(5)"
                },
                {
                    "title": "IOC (Indicators of Compromise):",
                    "content": "IOC Editor - OpenIOC  - STIX (Structured Threat Information Expression) - CyBOX (Cyber Observable Expression) - TAXII (Trusted Automated Exchange of Indicator) - IOC-based Hunting - Introduction to Incident Response Playbooks: Incident Response – Reactive Incident Response – Proactive Incident Response - Incident Response and Hunting across Endpoints – Leveraging Incident response with Threat hunting IR Playbook.\t\t\t(6)"
                },
                {
                    "title": "HUNTING USING MITRE ATTACK MATRIX:",
                    "content": "MITRE's Adversarial Tactics, Techniques, and Common Knowledge (ATT&CK(TM)) – ATT&CK Matrix – ATT&CK Based Analytics Development Method: Identify Behaviors - Acquire Data - Endpoint Sensing - Develop Analytics - Develop an Adversary Emulation Scenario - Emulate Threat - Investigate Attack - Evaluate Performance.\t\t(5)"
                }
            ],
            "textbooks": [
                "1.\tD. W. Murdoch, Don Murdoch, “Blue Team Handbook: Soc, Siem, and Threat Hunting Use Cases: A Condensed Field Guide for the Security Operations Team”, CreateSpace Independent Publishing Platform, 2018.",
                "2.\tJeff Bollinger, Brandon Enright, Matthew Valites, “Crafting the InfoSec Playbook: Security Monitoring and Incident Response Playbook”,   O’Reilly, 2015."
            ]
        },
        {
            "code": "20XC92",
            "title": "CRYPTOECONOMICS",
            "semester": 9,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "cryptographic hash functions – hash pointers and data structures digital signatures – public key as identity             (4)"
                },
                {
                    "title": "BLOCKCHAIN:",
                    "content": "centralization vs decentralization – distributed consensus – consensus without identity -  task of mining blockchain - mining hardware –mining pools -. mining incentives and strategies     (8)"
                },
                {
                    "title": "SECURING BLOCK CHAINS :",
                    "content": "proof of work – proof of stake – proof of authority – forming consensus – transaction fees – incentives – attack vectors .                                                                               (12)"
                },
                {
                    "title": "BLOCKCHAIN IN ENTERPRISE:",
                    "content": "hyperledger framework tools and building blocks – hyperledger fabric component design – sample transaction – business networks powered by blockchain – business scenario and use cases   (12)"
                },
                {
                    "title": "CHAINCODE DEVELOPMENT:",
                    "content": "creating chaincode - access control- implementing functions – testing – design topics             (4)"
                },
                {
                    "title": "BUSINESS NETWORK:",
                    "content": "defining business network - introducing participant – introducing asset – introducing transaction – implementing business network                          (5)"
                }
            ],
            "textbooks": [
                "1.\tArvind Narayanan, Joseph Bonneau, Edward Felten, Andrew Miller, Steven Goldfeder, \"Bitcoin and Cryptocurrency Technologies\", Princeton University Press, 2016.",
                "2.\tSalman A. Baset, Luc Desrosiers, Nitin Gaur, Petr Novotny, Anthony O'Dowd, Venkatraman Ramakrishna, Weimin Sun, Xun Wu , \"Blockchain Development with Hyperledger\", Packt Publishing, 2019.",
                "3.\tKedarIyer, Chris Dannen, \"Building Games with Ethereum Smart Contracts\", Apress, 2018."
            ]
        },
        {
            "code": "20XC93",
            "title": "CRYPTOECONOMICS",
            "semester": 9,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "OVERVIEW OF COMPUTER FORENSICS TECHNOLOGY:",
                    "content": "Computer Forensics Fundamentals - Types of Computer Forensics Technology - Types of Computer Forensics Systems - Vendor and Computer Forensics Services. \t   (6)"
                },
                {
                    "title": "COMPUTER FORENSICS EVIDENCE AND CAPTURE:",
                    "content": "Data Recovery - Evidence Collection and Data Seizure-Duplication and Preservation of Digital Evidence - Forensic Identification and Analysis of Technical Surveillance Devices - Reconstructing Past Events.                                                           (5)"
                },
                {
                    "title": "FILE SYSTEM FORENSIC ANALYSIS:",
                    "content": "Volume Analysis - Examining FAT File System - Deleted File Recovery in FAT - Examining NTFS File System - Deleted File Recovery in NTFS - File Carving - File Signature Searching Forensics - Keyword Forensics -Timeline Analysis -  Data Hiding and Detection. Forensic Log Analysis.  (7)("
                },
                {
                    "title": "WINDOWS REGISTRY FORENSICS:",
                    "content": "The Architecture of the Windows Registry - Registry Analysis, Processes and Tools, Analyzing the System Hives. \t\t\t\t\t\t        (5)"
                },
                {
                    "title": "INTERNET FORENSICS:",
                    "content": "Domain Name Ownership Investigation – Email Forensics – Messenger Forensics – Browser Forensics    (6)"
                },
                {
                    "title": "MOBILE DEVICE FORENSICS:",
                    "content": "Hand-held devices and Forensics – Reconstructing user’s activities and deleted  data (4)"
                },
                {
                    "title": "MEMORY FORENSICS AND MALWARE ANALYSIS:",
                    "content": "Memory data collection and Examination – Analyzing Windows and Linux systems for malware – Reverse Engineering tools and Techniques.\t\t\t\t\t                                 (6)"
                },
                {
                    "title": "CASE STUDIES:",
                    "content": "User Hives - Securing the Registry - Hacks, Tweaks, and Common Changes.         (6)"
                }
            ],
            "textbooks": [
                "1.\tJohn R Vacca, “Computer Forensics: Computer Crime Scene Investigation”, Charles River Media, Inc. Boston, Massachusetts, 2005.",
                "2.\tXiaodong Lin, “Introductory Computer Forensic- A Hands-on Practical Approach”, Springer, 2018.",
                "3.\tHarlan Carvey, “Windows Registry Forensics- Advanced Digital Forensic Analysis of the Windows Registry”,Elsevier, 2016.",
                "4.\tMike Halsey, Andrew Bettany, “Windows Registry Troubleshooting”, Apress, 2015.",
                "5.\tCameron H. Malin, EoghanCasey ,James M. Aquilina,Curtis W. Rose, “Malware Forensics Field Guide for Windows Systems”, Elsevier, 2012."
            ]
        },
        {
            "code": "20XC96",
            "title": "THREAT HUNTING LAB",
            "semester": 9,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XC97",
            "title": "COMPUTER FORENSICS LAB",
            "semester": 9,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XC98",
            "title": "SECURITY CAPSTONE LAB",
            "semester": 9,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XCP2",
            "title": "PROJECT WORK II – INDUSTRY / RESEARCH PROJECT"
        },
        {
            "code": "20XCE1",
            "title": "INFORMATION AND CODING THEORY",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "MEMORYLESS FINITE SCHEMES :",
                    "content": "Self information measure – Entropy function – Conditional entropies – Characteristics of entropy function – Derivation of the noise characteristics of a channel – Mutual information – Redundancy – Efficiency and channel capacity – Capacities of channels with symmetric noise structure.\t                (10)"
                },
                {
                    "title": "CONTINUOUS CHANNELS:",
                    "content": "Definitions of different entropies – Mutual information – Maximization of the entropy of a continuous random variable – Entropy maximization problems – channel capacity under the influence of additive white Gaussian noise – parallel Gaussian channel.\t\t          \t\t\t\t\t\t\t\t\t\t(7)"
                },
                {
                    "title": "ELEMENTS OF ENCODING :",
                    "content": "Source coding techniques – Necessary and sufficient conditions for noise less coding – Fundamental theorem of discrete noise-less coding – Fundamental theorem of discrete coding in presence of noise.   (8)"
                },
                {
                    "title": "ERROR CONTROL CODING :",
                    "content": "Need for error control coding – Linear block codes – Optimum soft decision decoding of linear block codes – Hard decision decoding – Polynomial representation of codes – Cyclic codes – Convolutional codes – viterbi decoding algorithm – Other decoding methods of convolutional codes – Galois fields – BCH Codes – Reed Solomon codes – Berlecamp Algorithm – Interleaving and concatenated codes – Turbo codes – Low density parity check codes(10)"
                },
                {
                    "title": "ITERATIVE DECODING:",
                    "content": "Serial concatenation using inner block codes – serial concatenation using inner convolutional codes – product codes – generalized array codes – applications of multi stage coding – The BCJR algorithm – use of extrinsic information – recursive systematic convolutional codes – MAP decoding of RSC codes – Interleaving and Trellis termination – The soft output Viterbi algorithm – Galleger codes – Serial concatenation with iterative decoding – Performance and complexity issues – application  to mobile communication.\t          (10)"
                }
            ],
            "textbooks": [
                "1.\tReza F M, “An Introduction to Information Theory”, McGraw Hill, 2012.",
                "2.\tJoy A Thomas, Cover M, “Elements of Information Theory”, John Wiley, 2006.",
                "3.\tJ. C. Moreira, P. G. Farrell, “Essentials of Error Control Coding”, Wiley, 2006.",
                "4.\tA. G. Burr, “Modulation and Coding for Wireless Communications”, Prentice-Hall, 2000."
            ]
        },
        {
            "code": "20XCE2",
            "title": "QUANTUM COMPUTING",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION AND OVERVIEW:",
                    "content": "Introduction to quantum states and measurements with motivating examples. Comparison with discrete classical states- Qubits and pieces - Bloch sphere- quantum mechanical probabilities- quantum behaviours.-  Matrix Algebra- basis vectors and orthogonality- inner product and Hilbert spaces- unitary operators and projectors- Dirac notation.          (7)"
                },
                {
                    "title": "QUANTUM MECHANICS:",
                    "content": "History of quanta - Postulates of quantum mechanics- Evolution and measurement - Entanglement -base states and superposition- structural randomness- measurement - Heisenberg's Uncertainty principle.\t(5)"
                },
                {
                    "title": "FUNDAMENTALS OF QUANTUMNESS:",
                    "content": "The model of quantum computation - Quantum gates and circuits - No-cloning theorem - quantum entanglement - Bell states and Bell inequalities - Quantum Circuits - Pauli, Hadamard, phase, CNOT, Toffoli gates- quantum teleportation- universality of two-qubit gates.                                      (11)"
                },
                {
                    "title": "QUANTUM ALGORITHMS:",
                    "content": "Grover’s search algorithm: analysis and lower bounds - Deutsch-Josza algorithm- Simon’s problem - quantum Fourier transform - Shor’s period-finding algorithm - quantum key distribution (BB84, E91) (12)"
                },
                {
                    "title": "QUANTUM COMPUTERS:",
                    "content": "Quantum information theory - Physical qubits - noise and decoherence - Applications of quantum information:  Quantum Error Correction - fault-tolerant quantum computing - quantum complexity classes   (10)"
                }
            ],
            "textbooks": [
                "1.\tMichael A. Nielsen, Isaac L. Chuang, “Quantum Computation and Quantum Information”, Cambridge University Press, 2000.",
                "2.\tNoson S. Yanofsky, Mirco A. Mannucci, Quantum Computing for Computer Scientists, Cambridge University Press.2008."
            ]
        },
        {
            "code": "20XCE3",
            "title": "POST QUANTUM CRYPTOGRAPHY",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO POST-QUANTUM CRYPTOGRAPHY :",
                    "content": "A taste of post-quantum cryptography,   Challenges in post-quantum cryptography, Comparison to quantum cryptography. \t\t\t\t\t\t\t\t(3)"
                },
                {
                    "title": "HASH-BASED DIGITAL SIGNATURE SCHEMES:",
                    "content": "Hash-based one-time Signature Schemes, Merkle’s tree authentication scheme, One-time key–pair generation using an PRNG, Authentication path computation, Tree chaining, Distributed signature generation, Security of Merkle signature scheme.\t\t\t\t\t\t\t\t\t              (11)"
                },
                {
                    "title": "CODE-BASED CRYPTOGRAPHY:",
                    "content": "Introduction- Cryptosystems- The security of computing syndromes as one-way functions, Codes and structures, Practical aspects.      (11)"
                },
                {
                    "title": "LATTICE-BASED CRYPTOGRAPHY:",
                    "content": "Introduction- Preliminaries – Finding short vectors in Random  q-ary lattices, Public key encryption schemes, Digital signature schemes, Other cryptographic primitives.  \t\t\t\t\t              (11)"
                },
                {
                    "title": "MULTIVARIATE PUBLIC KEY CRYPTOGRAPHY:",
                    "content": "Introduction – The Basics of Multivariate PKCs – Examples of  Multivariate PKCs, Basic  constructions and variations,  Standard attacks.                  (9)"
                }
            ],
            "textbooks": [
                "1.  Bernstein, D. J, “Introduction to post-quantum cryptography”, Springer, Berlin, Heidelberg, 2009.",
                "2.\tKirill Morozov, Tsuyoshi Takagi, Mathematics of Post-quantum Cryptography (Mathematics for Industry), Springer Nature, 2020"
            ]
        },
        {
            "code": "20XCE4",
            "title": "ACTIVE DEFENSE USING DECEPTION",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION :",
                    "content": "Active Defense vs. Passive Defense, Passive Security Architecture - Current generation of Security tools and controls - Firewalls, IDS, SIEM, UEBA- Active Security Architecture - modern honeypots, honeydocs, breadcrumbs, baits\t                 (6)"
                },
                {
                    "title": "HONEY POTS :",
                    "content": "Introduction - Interaction-level of deceptions - High Interaction, Medium Interaction, Low Interaction- SSH Honeypots, Elastichoney, HoneyNet Project, MHN Server- Client Honeypots - Capturing malware with honeypots - Detecting honeypots              (8)"
                },
                {
                    "title": "DECEPTION ARCHITECTURE AND STRATEGIES TO DEPLOY DECEPTION IN THE ENTERPRISE:",
                    "content": "Hidden Partitions, Port Obfuscation, Covert Network Tunnels, Steganography Processes, Obfuscating Code, Masking and Repackaging Ports- Delays- Delaying tactics-Delays in Web portal - Fakes - Fake software - Fake filesystem - Fighting spam and phishing with fakes  (8)"
                },
                {
                    "title": "LURING ADVERSARIES:",
                    "content": "Fake Services, Fake Traffic, Fake Content, Sinkholes, Labrea Tarpit, Tiny HP, SpiderTrap, Glastopf, Cowrie. (7)"
                },
                {
                    "title": "PLANNING DECEPTION:",
                    "content": "Cost benefit anayis of Deception - Analysis of a single  defensive  deception -Analysis of two stage deception - Analysis of fake honeypot - Counterplanning against attacks with deception. (7)"
                },
                {
                    "title": "CASE STUDIES:",
                    "content": "Honeyd - Correlating deceptive alerts with other alerts - Deception Systems for IOTs and ICS Systems - Deception in the Cloud-  Combining Deception with machine learning, game theory (9)"
                }
            ],
            "textbooks": [
                "1.\tRowe, Neil C., Julian Rrushi, “Introduction to Cyber Deception”, Springer International Publishing, 2016.",
                "2.\tProvos, Niels, Thorsten Holz, “Virtual Honeypots: From Botnet Tracking to Intrusion Detection”, Pearson Education, 2007."
            ]
        },
        {
            "code": "20XCE5",
            "title": "SECURITY MODELING AND ANALYSIS",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION :",
                    "content": "Computer security, Cryptographic protocols, Security analysis, Needham-Schroeder example, Model checker- Murphi.\t\t\t\t\t                  (5)"
                },
                {
                    "title": "KEY EXCHANGE AND CONTRACT-SIGNING PROTOCOLS:",
                    "content": "Key management, Kerberos, Public-Key infrastructure, Security properties and attacks on them, Diffie-Hellman key exchange, IPSEC, IKE. Contract-Signing and Fair-Exchange, Trusted third party, Optimistic Contract-Signing, Asokan-Shoup-Waidner protocol, Desirable properties –fairness- timeliness- accountability, Abuse-Free Contract-Signing.                               (10)"
                },
                {
                    "title": "MODELING SECURITY PROTOCOLS IN CSP:",
                    "content": "Data types for protocol models- Modeling intruder, Expressing protocol goals, Overview of FDR and Casper, Protocol specifications, Case study: Wide-Mouthed-Frog protocol.       (10)"
                },
                {
                    "title": "PROTOCOL COMPOSITION LOGIC:",
                    "content": "Proving protocols secure, Symbolic model, Challenge Response example, Informal ‘hand’ proof, Formalization: protocol specification language, syntax, semantics, proof system, Protocol composition, Complexity theoretic semantics.\t               (10)"
                },
                {
                    "title": "FORMAL PROOF OF COMPUTER SECURITY PROTOCOLS:",
                    "content": "Protocol Verification by BAN logic and Inductive Method: BAN logic- syntax and semantics,  Inductive Method:  Analysis by theorem proving, Inductive proofs, Protocol traces, Dolev-Yao attacker model.\t\t   (10)"
                }
            ],
            "textbooks": [
                "1.\tPeter Ryan, Steve Schneider, “Modeling and Analyzing Security Protocols: The CSP approach”, Addison-Weasley, 2001.",
                "2.\tColin Boyd, Anish Mathuria, “Protocols for Authentication and Key Establishment”, Springer, 2010."
            ]
        },
        {
            "code": "20XCE6",
            "title": "COMPUTER GRAPHICS AND VISUALIZATION",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "GRAPHICS INPUT - OUTPUT DEVICES:",
                    "content": "Raster scan Displays - Random scan displays - Direct view storage tubes - Flat panel displays - Mouse - Track Ball - Joy Stick - Digitizers - Touch panels - LCD. Graphical User Interface and Interactive Input Methods: The user dialog - Input of graphical data - Input function - Interactive picture construction techniques - Virtual reality \t\t\t\t\t                  (4)"
                },
                {
                    "title": "OPENGL:",
                    "content": "Architecture, The OpenGL API, Primitives and Attributes, Color, Viewing, Control Functions, Programming Event-Driven Input, Transformations, OpenGL Extension.     (4)"
                },
                {
                    "title": "TWO DIMENSIONAL GRAPHICS:",
                    "content": "Basic transformations - Matrix representation and homogeneous coordinates - Composite transformations - Line drawing algorithms: DDA and Bresenham's algorithms - Circle generation algorithms: Midpoint circle algorithm - Point clipping - Line clipping: Cohen Sutherland algorithm - Polygon clipping: Sutherland Hodgeman algorithm - Line covering.        (8)"
                },
                {
                    "title": "RASTER GRAPHICS:",
                    "content": "Fundamentals: generating a raster image, representing a raster image, scan converting a line drawing, displaying characters, speed of scan conversion, natural images - Solid area scan conversion: Scan conversion of polygons,Y-X algorithm, properties of scan conversion algorithms - Interactive raster graphics: painting model, moving parts of an image, feedback images.        (8)"
                },
                {
                    "title": "CURVES AND SURFACES:",
                    "content": "Parametric representation of curves - Bezier curves – B-Spline curves - Parametric representation of surfaces - Bezier surfaces - Curved surfaces - Ruled surfaces - Quadric surfaces – Concatenation of two curve segments – Order of Continuity.  (5)"
                },
                {
                    "title": "IMAGE PROCESSING FUNDAMENTALS:",
                    "content": "Sampling and Quantization, Image Enhancement - Histogram Processing, Filtering, Edge Detection, Image Transforms.\t     (8)"
                },
                {
                    "title": "THREE DIMENSIONAL GRAPHICS:",
                    "content": "3D transformations - Viewing 3D graphical data - Orthographic, oblique, perspective projections - Hidden lines and hidden surface removal.     (4)"
                },
                {
                    "title": "FRACTAL-GEOMETRY METHODS:",
                    "content": "Tiling the plane - Recursively defined curves - Koch curves - C curves - Dragons - Space filling curves - Fractals - Grammar based models - Graftals - Turtle graphics - Ray tracing.\t     (4)"
                }
            ],
            "textbooks": [
                "1.\tDonald Hearn, Pauline Baker M, \"Computer Graphics\", Pearson Education, 2011.",
                "2.\tWilliam M. Newmann, Robert F Sproull, “Principles of Interactive Computer Graphics”, Tata McGraw Hill, 2014.",
                "3.\tAngel, “Interactive Computer Graphics- A top down approach with OpenGL”, Pearson Education, 2014."
            ]
        },
        {
            "code": "20XCE7",
            "title": "ARTIFICIAL INTELLIGENCE",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "The foundations of AI - The History of AI - Intelligent agents - Agent based system.\t(2)"
                },
                {
                    "title": "PROBLEM SOLVING:",
                    "content": "State Space models - Searching for solution - Uninformed/Blind search - Informed/ Heuristic search - A* search - Hill-climbing search - Meta Heuristic: Genetic Algorithm - Adversary based search : Minimax - Expectimax – Alpha Beta pruning – Constraint satisfaction problem  -  Backtracking search  \t\t\t\t\t\t(10)"
                },
                {
                    "title": "KNOWLEDGE REPRESENTATION AND REASONING:",
                    "content": "Knowledge representation - Logics - bivalent logic - inference - Fuzzy logic: membership -  Fuzzy rules and reasoning - Fuzzy  inference   \t\t(11)"
                },
                {
                    "title": "UNCERTAIN KNOWLEDGE AND PROBABILISTIC REASONING:",
                    "content": "Uncertainty - Probabilistic reasoning - Semantics of Bayesian network - Exact inference in Bayesian network- Approximate inference in Bayesian network - Probabilistic reasoning over time – Inference in temporal models - Hidden Markov Models – Dynamic Bayesian Networks \t\t(11)"
                },
                {
                    "title": "DECISION-MAKING:",
                    "content": "Basics of utility theory, Utility functions - Sequential decision problems - Markov decision process - Value iteration - Policy iteration - Decisions in Multi agent system:  Multi agent decision theory - Group decision making         \t(11)"
                }
            ],
            "textbooks": [
                "1.\tStuart Russell and Peter Norvig, “Artificial Intelligence: A Modern Approach”, 4th edition Pearson Education, 2020.",
                "2.\tDavid Pool and Alan Mackworth, “Artificial Intelligence: Foundations of Computational agents”, Cambridge University Press, 2017.",
                "3.\tTimothy Ross, “ Fuzzy Logic with Engineering Applications”, 4thedition, John Wiley and sons, 2016."
            ]
        },
        {
            "code": "20XCE8",
            "title": "SOCIAL NETWORK ANALYSIS",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Motivation - different sources of network data - types of networks - tools for visualizing network data - review of graph theory basics (9)"
                },
                {
                    "title": "GRAPH THEORETIC PROPERTIES OF SOCIAL NETWORKS:",
                    "content": "Notions of centrality - Strong and weak ties – Homophily - Structural Balance.\t\t       (5)"
                },
                {
                    "title": "DYNAMIC PROPERTIES OF NETWORKS:",
                    "content": "Information diffusion - networks effects on information diffusion - maximizing influence spread - power law and heavy tail - preferential attachment models - small world phenomenon - cascading behavior on networks - Epidemics.  (11)"
                },
                {
                    "title": "BEHAVIORAL PROPERTIES ON NETWORKS:",
                    "content": "Network economics - Bargaining and power in networks - Sponsored search markets. (10)"
                },
                {
                    "title": "MINING GRAPHS:",
                    "content": "Community and cluster detection: random walks - spectral methods - link analysis for web mining.   (10)"
                }
            ],
            "textbooks": [
                "1. David Easley, Jon Kleinberg, “Networks, Crowds, and Markets: Reasoning About a Highly Connected World”, Cambridge University Press, 2010.",
                "2. Michael Cross, “Social Media Security: Leveraging Social Networking While Mitigating Risk”, Elsevier,2014."
            ]
        },
        {
            "code": "20XCE9",
            "title": "APPLIED GRAPH THEORY",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "BASIC CONCEPTS:",
                    "content": "Graphs - directed and undirected, subgraphs, graph models, degree of a vertex, degree sequence, Havel-Hakimi theorem, Hand-shaking lemma. Connectivity, walk, path, distance, diameter.  Isomorphic graphs. Common classes of graphs – regular, complete, petersen, cycle, path, tree, k-partite, hypercube, Spanning trees – Matrix tree theorem, graph decomposition.  (6)"
                },
                {
                    "title": "CONNECTIVITY:",
                    "content": "Vertex and edge connectivity, Vertex and edge cuts, relationship between vertex and edge connectivity, bounds for connectivity.  Harary’s construction of k-connected graphs- Attack trees.\t(8)"
                },
                {
                    "title": "EULERIAN AND HAMILTONIAN GRAPHS:",
                    "content": "Eulerian graphs, Route inspection problem, Hamiltonian graphs, Gray codes and Hypercubes, Travelling sales person problem , Telephone call graph.(8)"
                },
                {
                    "title": "MATCHING, VERTEX-COLORING AND DOMINATION:",
                    "content": "Matching (unweighted), Perfect matching, Hall’s theorem, assignment problem, augmenting path algorithm. Vertex-coloring – bounds, assignment of frequencies, fast register allocation, scheduling problem. Dominating set, domination number, bounds, connected dominating set in Ad Hoc Networks- Cellular mobile tower placement problem.      \t         (11)"
                },
                {
                    "title": "PLANAR GRAPHS:",
                    "content": "Properties, Kuratowski’s theorem, Hopcroft Tarjan Planarity testing algorithm. (5)"
                },
                {
                    "title": "RANDOM GRAPHS:",
                    "content": "Random graph – Definitions of G(n, p) and G(n, M) models, power law degree distribution, Web graph models, applications to social networks.\t\t\t\t\t\t\t\t\t               (7)"
                }
            ],
            "textbooks": [
                "1.\tAnthony Bonato, “A Course on Web Graphs”, American Mathematical Society, 2008.",
                "2.\tHaynes T W, Hedetniemi, Slater P J, “Fundamentals of Domination in Graphs”, CRC Press, 2015.",
                "3.\tJonathan Gross, Jay Yellen, “Graph Theory and its Applications”, CRC Press, 2005."
            ]
        },
        {
            "title": "20XCEA  MULTIMEDIA  SECURITY",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "Introduction to Multimedia:",
                    "content": "Image, Video and Audio Formats and Standards, and Digital Rights Management - Mathematical Preliminaries –Transforms-,Random Sequence Generation-Chaotic Maps - Error Correction Codes.        (4)"
                },
                {
                    "title": "Multimedia fingerprinting:",
                    "content": "Fingerprinting basics, Collusion attack- Frame proof and anti-collusion codes; Combining fingerprint modulation with coding: Introduction to coded fingerprint modulation, Semi-fragile fingerprinting; Multicastfingerprinting problem- Efficient security architectures: WHIM, Watercasting, Chameleon cipher; Joint fingerprinting and decryption (JFD)framework; Fingercasting.             (5)"
                },
                {
                    "title": "Multimedia Encryption :",
                    "content": "Requirements – Multimedia compression technologies and standards; Principles for selective encryption – Format Compliant Encryption,-Thumbnail preserving encryption- Scalable Encryption and Multi-Access Encryption.- Video encryption schemes: Chaotic maps, Transform domain encryption -Huffman tree mutation; Streaming media encryption: Scalable video protection      (8)"
                },
                {
                    "title": "Security Attacks :",
                    "content": "Traditional Attacks, Statistical Attack, -Filtering - Remodulation, -JPEG Coding Distortion and JPEG 2000 Compression, Geometric Transformation -Image Scaling, Rotation, Image Clipping, Linear Transformation, Bending, Warping and Perspective Projection, Cryptographic attacks and Protocol attacks,- Error concealment attack.  (6)"
                },
                {
                    "title": "Digital Water marking :",
                    "content": "Spatial-Domain Watermarking - Frequency-Domain Watermarking -, Watermarking Based on Vector Quantization, Fragile Watermarking -  Media-Specific Digital Watermarking(Video- Audio- Binary image) - Spread Spectrum Watermarking - Robustness to Temporal and Geometric Distortions - Affine-Resistant Watermarking- Protocols for Secure Computation - Watermarking Tools.  \t\t\t\t\t\t\t\t\t\t\t(7)"
                },
                {
                    "title": "Steganography:",
                    "content": "Requirements and Applications, Types– Text, Audio, Video, Linguistic and Network steganography Algorithms – LSB Method, GIFshuffle, EzStego,Jsteg, Steganographic Tools Steganalysis - Statistical Properties of Images, The Visual Steganalytic System, IQM-Based Steganalytic System, Frequency-Domain Steganalytic System.  (8)"
                },
                {
                    "title": "Content Authentication:",
                    "content": "ultimedia authentication: Perceptual hashes;Parameterization; Watermarking based authentication: Notion of semi- fragility -,Construction and design of semi-fragile watermarks; Example: Principles of video authentication: Scalability issues, packet loss, post-processing Multimedia Forensics    (7)"
                }
            ],
            "textbooks": [
                "1.\tFrank Y. Shih, “Multimedia Security”, CRC Press, 2017.",
                "2.\tAmit Pande, Joseph Zambreno, “Embedded Multimedia, Security Systems, Algorithms and Architectures”, Springer verlag, 2013.",
                "3.\tShiguo Lian, “Multimedia Content Encryption: Techniques and Applications”, Auerbach Publications, Taylor & Francis Group, 2009.",
                "4.\tCox, Miller, Bloom, Fridrich, Kalker, “Digital Watermarking and Steganography” Morgan Kaufmann, 2008."
            ]
        },
        {
            "title": "20XCEB  IDENTITY AND ACCESS MANAGEMENT",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "The Five A’s of Enterprise IAM : Authentication, Authorization, Administration, Audit, and Analytics, Components of an Identity Service, Identity and Access Governance, Identity Standards - Understanding Enterprise Identity: Types of Accounts, Entitlements, and Roles.   (5)"
                },
                {
                    "title": "LDAP:",
                    "content": "Basics, LDAP Configuration, Operational Considerations, LDAP Proxy - SAML: Assertions, Bindings, Protocols, and Profiles, Open Source SAML Software. \t                                (8)"
                },
                {
                    "title": "OAuth:",
                    "content": "OAuth Roles, Tokens, Grants, OAuth Client. OpenID Connect - Strong Authentication: OTP, HOPT and TOTP, Mutual SSL/TLS, Fast Identity Online, W3C Web Authentication and CTAP                         (12)"
                },
                {
                    "title": "User-Managed Access:",
                    "content": "UMA Grant - UMA Federated Authorization - Managing Scopes - Managing Authorization Policies.\t (4)"
                },
                {
                    "title": "IDENTITY MANAGEMENT:",
                    "content": "MidPoint, Apache Syncope, Wren:IDM - Multiparty Federation: Federation Privacy consideration, Federation Policy, Data Protection code of conduct, Network use agreement, Actors, Trust models, SAML federations via Metadata Aggregate , OTTO Federation.  (12)"
                },
                {
                    "title": "Single Sign-On (SSO) : -",
                    "content": "federated SSO -  Cross-Domain Single Sign On. Preventing Password fatigue and cloud sprawl  (4)"
                }
            ],
            "textbooks": [
                "1.\tSchwartz, M,  Machulak, M, “Securing the Perimeter: Deploying Identity and Access Management with Free Open Source Software”, Apress, 2018.",
                "2.\tOrondo, P. O,  “Identity and Access Management: A Systems Engineering Approach” , IAM imprints, 2014."
            ]
        },
        {
            "title": "20XCEC  ESSENTIALS OF CYBER PHYSICAL SYSTEM SECURITY",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Cyber-Physical System concepts - Design Challenges-Mobile Cyber-physical systems-Design Principles-Physical system controls-Intelligence application of HDP-HMM in recognition of dynamic hand gestures. (10)"
                },
                {
                    "title": "MODELING IN CYBER-PHYSICAL SYSTEMS:",
                    "content": "Introduction to models of computation-Languages and tools for system design-Physical System Modeling on cognitive Unmanned Aerial Vehicle-Concurrent models of computation-Continuous time model - Acausal model - Mixed Model-Hybrid systems, (9)"
                },
                {
                    "title": "SENSOR BASED CYBER-PHYSICAL SYSTEMS:",
                    "content": "Wireless Sensor and Actuator Networks for Cyber-Physical Systems-Applications-Community Sensing-Wireless Embedded/Implanted Micro Systems-Architecture and Security-The Application of Machine Learning in monitoring -Robotics –Transportation.\t\t\t\t\t\t\t                                               (8)"
                },
                {
                    "title": "CIVILIAN CYBER-PHYSICAL SYSTEM APPLICATIONS:",
                    "content": "Energy efficient building Cyber-Physical System for Smart Grid Applications – Cyber-Physical System for transportation applications-Video communications -Digital Manufacturing/Industry 4.0 -IEEE 802.1 AS standards \t\t\t\t\t\t\t\t\t\t                             (10)"
                },
                {
                    "title": "SECURITY IN CYBER PHYSICAL SYSTEMS:",
                    "content": "Overview of security and privacy in Cyber-Physical System – Network Security and Privacy for Cyber-Physical Systems – Data Security and Privacy in Cyber-Physical Systems for Healthcare – Detecting Data Integrity Attacks in Smart Grid – Cyber-Physical Vulnerabilities of Wireless Sensor Networks in Smart Cities.\t   (8)"
                }
            ],
            "textbooks": [
                "1.\tFei Hu, “Cyber-Physical Systems: Integrated Computing and Engineering Design”, CRC Press, 2013.",
                "2.\tE. A. Lee, S. A. Seshia, “Introduction to Embedded Systems, A Cyber-Physical Systems Approach”, MIT Press, 2015."
            ]
        },
        {
            "title": "20XCED  DATA COMPRESSION",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "DATA COMPRESSION LEXICON:",
                    "content": "Introduction to Data Compression - Dawn Age - Coding -  Lossy  Compression.    (4)"
                },
                {
                    "title": "MINIMUM REDUNDANCY CODING (THE DAWN AGE):",
                    "content": "The Shannon - Fano Algorithm, The Huffman Algorithm - Into the Huffman Code : Counting the Symbols, Building the tree\t.\t\t\t\t\t                                            (5)"
                },
                {
                    "title": "ADAPTIVE HUFFMAN CODING:",
                    "content": "Adaptive Coding - Updating the Huffman Tree \t- Escape code.\t      (5)"
                },
                {
                    "title": "ARITHMETIC HUFFMAN CODING:",
                    "content": "Arithmetic Coding  with floating point data type – Arithmetic coding with integral data type.                                        \t       \t\t\t\t\t\t\t\t\t\t\t           (6)"
                },
                {
                    "title": "STATISTICAL MODELING:",
                    "content": "Higher-order Modeling - Finite Context Modeling – Order one modeling – Order two Modeling.           (5)"
                },
                {
                    "title": "SPEECH COMPRESSION:",
                    "content": "Digital Audio Concepts - Lossless Compression of Sound.  (5)"
                },
                {
                    "title": "VIDEO COMPRESSION:",
                    "content": "JPEG Compression - Implementing DCT - Complete Code Listing. (5)"
                },
                {
                    "title": "DICTIONARY-BASED COMPRESSION:",
                    "content": "LZ77 Compression  and Decompression - LZSS Compression and Decompression -  LZ78 Compression and Decompression -  LZW Compression and Decompression – LZMW Compression and Decompression - LZAP Compression and Decompression – LZY Compression and Decompression.   (10)"
                }
            ],
            "textbooks": [
                "1.\tKhalid Sayood, “Introduction to Data Compression”, Morgan Kaufmann, 2013.",
                "2.\tDavid Salomon, “Data Compression: The Complete Reference”, Springer, 2014"
            ]
        },
        {
            "title": "20XCEE  BIG DATA AND MODERN DATABASES",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "OBJECT AND SPATIAL DATABASES:",
                    "content": "Query Optimization in Relational Databases - Object Oriented Databases – Object relational Databases -  Complex data types - Structured types and Inheritance - Query Processing in Object databases - Geometric Information System - Spatial Databases : Spatial Data Types – Spatial Queries - Spatial indexing techniques\n                    (5)"
                },
                {
                    "title": "PARALLEL AND DISTRIBUTED DATABASES:",
                    "content": "Architecture of parallel databases – Parallel query evaluation, Parallel query optimization – Distributed DBMS Architecture, Distributed Database Design, Distributed Query Processing (6)"
                },
                {
                    "title": "DATA MODELING FOR BIG DATA:",
                    "content": "Big Data and Challenges, Big Data models, NoSQL data models, Basic principles of NoSQL models, SQL databases Vs NoSQL databases - MAP-REDUCE : Apache Hadoop and HDFS,  Big data Applications      (8)"
                },
                {
                    "title": "NOSQL DATABASES:   Key - Value Stores:",
                    "content": "Oracle Coherence – Amazon DynamoDB, Key -Value Stores (in-memory) : Redis , Berkeley DB           (8)"
                },
                {
                    "title": "COLUMN & DOCUMENT ORIENTED STORE:",
                    "content": "Google BigTable , Apache Cassandra -  Hbase  - MongoDB -  Apache CouchDB (8)"
                },
                {
                    "title": "GRAPH DATABASES:",
                    "content": "Neo4J - OrientDB                   (5)"
                },
                {
                    "title": "DATABASE INTEGRATION:",
                    "content": "Data warehousing, Schema directed data integration - Schema mapping and information preservation - Information Preserving XML Schema Embedding. \t    (5)"
                }
            ],
            "textbooks": [
                "1. Pramod J. Sadalage, Martin Fowler, “NoSQL Distilled - Brief Guide to the Emerging World of Polyglot Persistence”, Pearson Education, 2013.",
                "2. Guy Harrison, “Next generation Databases: NoSQL and BigData”, Apress, 2015.",
                "3. Kristina Chodorow, Shannon Bradshaw, Eoin Brazil, “MongoDB: The Definitive Guide”, O’Reilly Media, 2019",
                "4. Holden Karau, Andy Konwinski, Patrick Wendell, Matei Zaharia, “Learning Spark: Lightning-Fast Big Data Analysis”, O'Reilly Media, 2015"
            ]
        },
        {
            "title": "20XCEF  NETWORK FORENSICS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "Introduction:",
                    "content": "Footprints  -  Concepts in Digital Evidence - Network Forensics Investigative Methodology (OSCAR) - Sources of Network-Based Evidence  - Evidence Acquisition\t   (6)"
                },
                {
                    "title": "Traffic Analysis :",
                    "content": "Protocol Analysis -  Packet Analysis  -  Flow Analysis – Higher Layer Traffic Analysis (8)"
                },
                {
                    "title": "Statistical Flow Analysis :",
                    "content": "Process Overview – Sensors - Flow Record Export protocols - Collection and Aggregation - Analysis      (7)"
                },
                {
                    "title": "Network Intrusion Detection and Analysis :",
                    "content": "why Investigate NIDS/NIPS? -Typical NIDS/NIPS Functionality -  Modes of Detection - Types of NIDS/NIPSs  - NIDS/NIPS Evidence Acquisition  - Comprehensive Packet Logging -  Snort     (9)"
                },
                {
                    "title": "Event Log Aggregation, Correlation, and Analysis",
                    "content": "Sources of Logs  - Network Log Architecture - Collecting and Analyzing Evidence – Switch Evidence – Router Evidence – Firewall Evidence\t          (6)"
                },
                {
                    "title": "Web Proxies",
                    "content": "Why Investigate Web Proxies? -  Web Proxy Functionality - Evidence -  Squid  -  Web Proxy Analysis -  Encrypted Web Traffic \t  (9)"
                }
            ],
            "textbooks": [
                "1.\tDavidoff, Sherri, Jonathan Ham, “Network forensics: Tracking Hackers Through Cyberspace”, Prentice hall, 2012."
            ]
        },
        {
            "title": "20XCEG  BIOMETRIC SECURITY",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "Introduction:",
                    "content": "History and Evolution of biometrics, biometrics applications, access control.        (5)"
                },
                {
                    "title": "Biometric System Architecture:",
                    "content": "Introduction of Biometric traits and its aim, image processing basics, basic image operations, filtering, enhancement, sharpening, edge detection, smoothening, enhancement, thresholding, localization, feature extraction, classification, matching, searching and verification.  (10)"
                },
                {
                    "title": "Biometric system modalities:",
                    "content": "Face recognition, Voice Recognition, Fingerprint Recognition, Iris Recognition, Retina, hand geometry, DNA recognition system, Behavioural biometrics- signature, gait, keystroke.      (15)"
                },
                {
                    "title": "Biometric system design and performance evaluation:",
                    "content": "Quantitative analysis on the biometrics, Performance evaluation in Biometrics –false acceptance rate; false rejection rate.             (5)"
                },
                {
                    "title": "Multimodal Biometric systems:",
                    "content": "Biometric system integration, multimodal biometric systems- theory and applications, performance evaluation of multimodal biometric systems.            (5)"
                },
                {
                    "title": "Biometric System Security:",
                    "content": "Biometric attacks/tampering, solutions, biometric encryption.  (5)"
                }
            ],
            "textbooks": [
                "1. Benjamin Muller, “Security, Risk and the Biometric State: Governing Borders and Bodies”, Routledge, 2010.",
                "2. Anil K Jain, Patrick Flynn, Arun A. (Eds.), “Handbook of Biometrics”, Springer, 2008."
            ]
        },
        {
            "title": "20XCEH  GAME THEORY",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Game theory the theory of rational choice – Interacting decision makers.           (2)"
                },
                {
                    "title": "NASH EQUILIBRIUM:",
                    "content": "Strategic games – Best response – Dominance – Examples from economics, business, environment, military - Symmetric games and symmetric equilibria. Illustrations: Cournot’s model of oligopoly, Electoral competition.   \t  (7)"
                },
                {
                    "title": "MIXED STRATEGIES:",
                    "content": "Dominance – Equilibrium – Illustrations:  Expert diagnosis, Reporting a crime – Formation of players’ beliefs.             (5)"
                },
                {
                    "title": "EXTENSIVE GAMES WITH PERFECT INFORMATION:",
                    "content": "Strategies and outcomes – Nash equilibrium – Subgame perfect equilibrium - Stackelberg’s model of duopoly, Buying votes – Illustrations: Entry into a monopolized industry, Electoral competition with strategic voters, Committee decision making.   \t\t       (7)"
                },
                {
                    "title": "GAMES WITH IMPERFECT INFORMATION:",
                    "content": "Bayesian games – Examples – Strategic information – Transmission – Agenda Control with imperfect Information – Signaling games - Education as a signal of ability.    (8)"
                },
                {
                    "title": "REPEATED GAMES",
                    "content": "DThe prisoner’s dilemma – Finitely repeated and infinitely repeated – Strategies – Nash equilibrium – Subgame – Perfect equilibria and the one – deviation – Property – General results – Finitely replaced games – Variation on a theme: Imperfect observability.\t\t    (8)"
                },
                {
                    "title": "INTRODUCTION TO ALGORITHMIC GAME THEORY:",
                    "content": "Auction and mechanism design basics - the Vickrey auction - Sponsored Search Auction - Social choice theory - VCG mechanism. Algorithmic Aspects of Equilibria: Existence and computational complexity equilibria - Market Equilibrium - Correlated Equilibrium. \t             (8)"
                }
            ],
            "textbooks": [
                "1.\tMartin J Osborne, “An Introduction to Game Theory”, Oxford University Press, 2009.",
                "2.\tVijay Krishna, “Auction Theory”, Academic Press, 2009."
            ]
        },
        {
            "title": "20XCEI  ETHICS AND CYBER LAW",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "private sector data laws – anti hacking laws – public private sector efforts – government surveillance laws – cybersecurity requirements for government contractors – privacy law            (4)"
                },
                {
                    "title": "DATA PRIVACY LAW:",
                    "content": "FTC data security – state data breach notification laws – state data security laws – state data disposal laws  (8)"
                },
                {
                    "title": "CYBER SECURITY LITIGATION:",
                    "content": "common causes of actions arising from data breaches – class action certification in data breach litigation – insurance coverage for cybersecurity incidents – protecting cybersecurity work product and communication from discovery   (12)"
                },
                {
                    "title": "ANTI HACKING LAWS:",
                    "content": "computer fraud and abuse act – state computer hacking laws – copy right act (6)"
                },
                {
                    "title": "FEDARAL GOVERNMENT CONTRACTORS:",
                    "content": "federal information security management act – NIST information security controls – classified information security – covered defence information and controlled unclassified information  (4)"
                },
                {
                    "title": "PRIVACY LAWS:",
                    "content": "FTC act and privacy – health insurance portability and accountability act – video privacy protection act -  children online protection act – online privacy laws – biometric information privacy act – privacy and social media    (6)"
                },
                {
                    "title": "CYBER SECURITY AND INTERNATIONAL LAW:",
                    "content": "international agreements – cyber threat and war – cyber war issues – cyber defence under international law    (5)"
                }
            ],
            "textbooks": [
                "1.\tJeff Kosseff, \"Cybersecurity Law\", Wiley, 2017.",
                "2.\tJay Kesan, \"Cybersecurity and Privacy Law in a Nutshell\", West Academic Publishing, 2019.",
                "3.\tUchenna Jerome Orji, \"Cybersecurity: Law and Regulation\", Wolf Legal Publishers, 2019"
            ]
        },
        {
            "title": "20XCEJ  DIGITAL IMAGE PROCESSING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "DIGITAL IMAGE FUNDAMENTALS :",
                    "content": "Image Sampling and Quantization, Digital Image Representation, Image Types, Pixel Neighborhood.  (3)"
                },
                {
                    "title": "IMAGE ENHANCEMENT",
                    "content": "Noise models, Point Operations, Histogram Processing, Spatial Operations, Multispectral Image Enhancement, Color Image Enhancement. Image Transforms - Fourier Transform, Discrete Cosine Transform, Wavelets. \t          (6)"
                },
                {
                    "title": "EDGE-DETECTION",
                    "content": "The Purpose of Edge Detection, Traditional Approaches and Theory, Edge Models, Comparison of Two Optimal Edge Detectors, Color edges.   (5)"
                },
                {
                    "title": "DIGITAL MORPHOLOGY",
                    "content": "Connectedness, Binary Operations, Dilation and Erosion, Opening and Closing, Grey-Level Morphology, Color Morphology.Image Restoration – Image Degradations, The Frequency Domain, The Inverse Filter, The Wiener Filter, The Homomorphic Filter, Least Square Filters, Generalized Inverse & Iterative Methods. (6)"
                },
                {
                    "title": "GREY-LEVEL SEGMENTATION",
                    "content": "Basics of Grey-Level Segmentation, The Use of Regional Thresholds, Moving Averages, Cluster-Based Thresholds, Multiple Thresholds, Region-based segmentation, Watershed Transform.\t \t\t         (9)"
                },
                {
                    "title": "IMAGE ANALYSIS",
                    "content": "Feature Extraction - color, texture and shape features, Dimensionality Reduction, Clustering and Classification.  (9)"
                },
                {
                    "title": "IMAGE-BASED SECURITY",
                    "content": "Visual Cryptography – Extended Visual Cryptography, Dynamic Visual Cryptography, Dimension, Computation Based – Computationless approaches, Digital Image Watermarking – Classification, Attacks, Measures of Evaluation, Types – Fragile, Robust, Dual – Steganography – Properties, Performance Measures, Steganalysis, Multimodal Biometrics.        (7)"
                }
            ],
            "textbooks": [
                "1.\tRafael C Gonzalez, Richard E Woods, “Digital Image Processing”, Prentice Hall, 2011.",
                "2.\tAnil K Jain, “Fundamentals of Digital Image Processing”, Prentice Hall, 2001."
            ]
        },
        {
            "title": "20XCEK  NATURAL LANGUAGE PROCESSING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Natural language processing techniques - analysis in NLP: morphological – syntactic, semantic -  pragmatic - Applications \t\t\t\t                                (2)"
                },
                {
                    "title": "WORDS :",
                    "content": "Regular expressions – Automata – Morphology – Finite state Transducers – Finite state morphological parsing – Combining FST lexicon and rules – Porter Stemmer Algorithm – Probabilstic models for Spelling – Bayes method, Minimum edit distance - N-Grams – Counting words in Corpora – Simple n-grams – Smoothing – Evaluating language models : Entropy, Perplexity- Part of Speech Tagging (POS) – Rule based tagging – Stochastic based tagging – Transformation based tagging - Context Free Grammars - Top down parser – Earley Algorithm – Bottom-up parsing – CYK parser – Probabilistic parsing.          (12)"
                },
                {
                    "title": "SEMANTICS & PRAGMATICS:",
                    "content": "First order predicate calculus – Syntax driven sematic analysis – Attachments for a fragment of English – Word Sense Disambiguation – Machine learning approaches – Dictionary based approaches –  Pragmatics : Discourse – Text coherence.                                         (10)"
                },
                {
                    "title": "DEEP LEARNING in NLP :",
                    "content": "Text representation – Word2Vec models – Recurrent neural network (RNN) – Long short term  memory(LSTM ) (6)"
                },
                {
                    "title": "NATURAL LANGUAGE GENERATION :",
                    "content": "Architecture of NLG Systems- Generation Tasks and Representations- Application of NLG. Machine Translation: Language similarities and differences – The transfer metaphor – Direct translation – Statistical translation - Translation involving Indian Languages.                   (11)"
                },
                {
                    "title": "CASE STUDIES :",
                    "content": "Mail spam, web spam detection, Fake news detection – malicious language processing, network traffic analysis, Anomaly detection  -   summarization - Question answering - Named entity recognition and relation extraction - IE using sequence labeling  - Open problems       (4)"
                }
            ],
            "textbooks": [
                "1. Daniel Jurafsky, James H. Martin, “Speech and Language Processing: An Introduction to Natural Language Processing, Computational Linguistics and Speech Recognition”, Prentice Hall, 2014.",
                "2. Jacob Eisenstein, Introduction to Natural language processing, The MIT Press, 2019."
            ]
        },
        {
            "title": "20XCEL INFORMATION RETRIEVAL AND FILTERING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Information Retrieval problem - Historical Perspectives - Goals of IR - The impact of the web on IR- Information Filtering      (3)"
                },
                {
                    "title": "INDEXING:",
                    "content": "Index construction:  Inverted index, Hardware basics -  Different indexing techniques - Index compression : Statistical properties of terms in information retrieval ,  Postings file compression        (4)"
                },
                {
                    "title": "RETRIEVAL MODELS:",
                    "content": "Similarity Measures and Ranking - Boolean Matching – Extended Boolean models - Ranked retrieval - Vector Space Models -Text-similarity metrics - TF-IDF (term frequency/inverse document frequency) weighting - Cosine similarity, Probabilistic Models, Language models - Query Operations - Query expansion and Relevance Feedback - Experimental Evaluation of IR: Performance metrics: recall, precision, and F-measure  (8)"
                },
                {
                    "title": "WEB SEARCH:",
                    "content": "IR Systems and the WWW - Search Engines: Spidering, Meta Crawler, Question answering, Link analysis - Hubs and Authorities, HITS algorithm, Duplicate Detection – Near Duplicate pages – Ranking based Evaluation metrics .             (5)"
                },
                {
                    "title": "RECOMMENDER SYSTEM:",
                    "content": "Goals of Recommender Systems - Content based Recommender Systems -  Collaborative filtering Systems -  Neighbourhood based approaches – Model based approaches – Matrix factorization approaches - Context – Aware Recommender Systems -  Recommender System properties – Evaluation metrics  - General goals of evaluation and metrics - Active learning n Recommender Systems – Multi criteria Recommender Systems                  (10)"
                },
                {
                    "title": "TRUST IN RECOMMENDATION:",
                    "content": "Introduction - Computational Trust – Trust Propagation – Trust Metrics - Trust-Enhanced Recommender Systems – Privacy Preserving Recommendations       (5)"
                },
                {
                    "title": "ROBUST COLLABORATIVE RECOMMENDATION:",
                    "content": "Trade-offs in Attack model -  Types of Attacks – Impact of Attacks – Attack Detection :  Detection findings -  Individual Attack Profile detection – Group attack profile detection – Strategies for Robust  Recommender systems -  Robust Recommendation Algorithms     (10)"
                }
            ],
            "textbooks": [
                "1. Christopher D. Manning, Prabhakar Raghavan and Hinrich Schütze, “Introduction to Information Retrieval”, Cambridge University Press, 2012.",
                "2. Stefan Büttcher, Charles L. A. Clarke, Gordon V. Cormack, “Information Retrieval – Implementing and Evaluating Search Engines “, The MIT Press, 2016"
            ]
        },
        {
            "title": "20XCEM  REINFORCEMENT LEARNING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "REINFORCEMENT PROBLEM:",
                    "content": "Introduction - Elements of RL, History of RL- Evaluative feedback -Goals and rewards – Returns -Bandit learning: Upper-confidence - bound algorithms - Thompson sampling, online learning - Multi agent reinforcement  learning                 (5)"
                },
                {
                    "title": "MARKOV DECISION PROCESS (MDP):",
                    "content": "Value functions - Optimality Criterion in MDPs.- Partially Observed Markov Decision Process   (4)"
                },
                {
                    "title": "DYNAMIC PROGRAMMING (DP):",
                    "content": "Policy Evaluation- Policy Improvement - Value Iteration, asynchronous DP- Efficiency of DP- Stochastic DP.   (5)"
                },
                {
                    "title": "MONTE CARLO METHODS:",
                    "content": "Policy Evaluation- Policy Improvement- On-policy and off- policy Monte Carlo controls-Incremental implementation.\t  (8)"
                },
                {
                    "title": "TEMPORAL DIFFERENCE LEARNING (TD):",
                    "content": "TD-prediction- Optimality of TD - SARSA- Q-Learning – R- Learning-Actor-Critic Model- Unifying Monte Carlo and TD-Traces- Games.\t        \t               (8)"
                },
                {
                    "title": "FUNCTION APPROXIMATION:",
                    "content": "Value prediction and control – Gradient Descent methods - Linear methods – Artificial Neural Network based approximation (9)"
                },
                {
                    "title": "PLANNING AND LEARNING:",
                    "content": "Model based learning and planning - prioritized sweeping-Heuristic search. (6)"
                }
            ],
            "textbooks": [
                "1. Sutton R. S. and Barto A. G., \"Reinforcement Learning: An Introduction\", MIT Press, 2018.",
                "2. Dimitri P. Bertsekas, \"Reinforcement Learning and Optimal Control”, Athena Scientific, 2019",
                "3. Csaba Szepesvári, “Algorithms for Reinforcement Learning”, Morgan & Claypool, 2010.",
                "4. Masashi Sugiyama, “Statistical Reinforcement Learning : Modern Machine Learning Approaches”, CRC Press,  2015"
            ]
        },
        {
            "title": "20XCEN  DEEP LEARNING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "Introduction:",
                    "content": "Basic concepts – Convex sets, convex functions – loss functions –   Gradient descent – Variants - Perceptron – Activation functions - Geometric representation – Perceptron Convergence theorem   (4)"
                },
                {
                    "title": "Feed Forward Networks :",
                    "content": "Multi layer Perceptron – back propagation - Learning XOR – Auto encoder   - Deep neural networks.\t (6)"
                },
                {
                    "title": "Training neural Networks:",
                    "content": "Optimization methods for neural networks - Adagrad, Adadelta, rmsprop, adam, NAG - second order methods for training, Saddle point problem in neural networks, Regularization methods - dropout, batch normalization, Ridge  and Lasso  \t\t              (10)"
                },
                {
                    "title": "Convolutional networks",
                    "content": "structure – properties – Region based CNN - LeNet – Alex net\t(5)"
                },
                {
                    "title": "Recurrent networks :",
                    "content": "Recurrent neural networks(RNN) –  Gated Recurrent unit – Long Short Term Memory - Bidirectional RNNs -  Deep recurrent network – Methodology – Applications (8)"
                },
                {
                    "title": "Deep Learning Research :",
                    "content": "Linear Factor Models, variants of Autoencoders, Representational Learning, Structured probabilistic models for deep learning, Monte Carlo Methods, Generative adversarial networks -  Deep generative models\t\t (9)"
                },
                {
                    "title": "Applications :",
                    "content": "Malicious language processing- Malware and code analysis – Deep Phish - Big Data, Brain Computer Interface, Vision, IoT  \t\t(3)"
                }
            ],
            "textbooks": [
                "1.\tIan Goodfellow, Yoshua Bengio, Aaron Courville, “Deep Learning”, The MIT Press, 2016.",
                "2.\tYoshua Bengio,  “Learning Deep Architectures for AI”, Foundations & Trends in Machine Learning, 2009."
            ]
        },
        {
            "title": "20XCEO  RANDOMIZED ALGORITHMS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Randomized algorithms, generation of random numbers, randomized quick sort, Karger’s min-cut algorithm Las Vegas and Monte Carlo algorithms, computational models and complexity classes.   \t\t(5)"
                },
                {
                    "title": "PROBABILISTIC INEQUALITIES:",
                    "content": "Union bound, Markov and Chebyshev inequalities-Applications- Occupancy problem,  randomized selection- coupon collector’s problem, the Chernoff bound- routing  in a parallel computer- a wiring problem.\t\t(6)"
                },
                {
                    "title": "PROBABILISTIC METHOD:",
                    "content": "Overview of the method-maximum satisfiability – finding a large cut , Independent Sets\t\t(4)"
                },
                {
                    "title": "MARKOV CHAINS AND RANDOM WALKS:",
                    "content": "Markov chains, Random walk on graphs – connectivity in undirected graphs – Expanders and rapidly mixing random walks, Probability amplification fo random walks on expanders \t(7)"
                },
                {
                    "title": "DATA STRUCTURES AND GRAPH ALGORITHMS:",
                    "content": "Random Treaps, hashing – hash tables – perfect hashing,  skip lists – Fast min-cut. \t     (6)"
                },
                {
                    "title": "ONLINE ALGORITHMS:",
                    "content": "Paging problem-adversary models- paging against  an oblivious adversary-relating the adversaries-the adaptive online adversary, k-server problem.\t(4)"
                },
                {
                    "title": "PARALLEL AND DISTRIBUTED ALGORITHMS:",
                    "content": "Sorting on a PRAM – Maximal Independent sets-parallel matching                 (5)"
                },
                {
                    "title": "NUMBER THEORETIC ALGORITHMS:",
                    "content": "Polynomial roots and factoring, primality testing.\t    (4)"
                },
                {
                    "title": "DERANDOMIZATION:",
                    "content": "The method of Conditional Probabilities – Derandomizing max-cut algorithm, Constructing pairwise independent values modulo a prime – large cut.       \t    (4)"
                }
            ],
            "textbooks": [
                "1.\t  Motwani R and  Raghavan P, “Randomized Algorithms”, Cambridge University Press, 2014.",
                "2.\t  Michael Mitzenmacher and Eli Upfal, “Probability & Computing: Randomized Algorithms and Probabilistic Analysis”, Cambridge University Press, 2017."
            ]
        },
        {
            "code": "20XCO1",
            "title": "GERMAN",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO VR AND AR:",
                    "content": "Overview of class, logistics, history of VR/AR.(5)"
                },
                {
                    "title": "THE GRAPHICS PIPELINE AND OPENGL:",
                    "content": "Overview and Transformations: rotation, translation, scaling, model view matrix, projection matrix, Lighting and Shading.(7)"
                },
                {
                    "title": "OPENGL SHADING LANGUAGE (GLSL):",
                    "content": "vertex and fragment shaders.(5)"
                },
                {
                    "title": "Guten Appetit! – Learning:",
                    "content": "To learn about food, shop, converse; Vocabulary: related to the topic; Grammar: Sentence position, Accusative, Accusative with verbs.    (6)"
                },
                {
                    "title": "Tag fϋr Tag – Learning:",
                    "content": "To learn time related expressions, about family, ask excuse, fix appointments on phone; Vocabulary: related to the topic; Grammar: Preposition – am, im, um, von…bis, Possessive articles, Modalverbs. (6)"
                },
                {
                    "title": "Zeit mit Freunden – Learning:",
                    "content": "To express birthdays, understand & write invitations, prepare dialogues; Vocabulary: related to the topic; Grammar: Past tense of haben & sein verbs, Accusative personal pronouns and prepositions.(6)"
                },
                {
                    "title": "Kontakte – Learning:",
                    "content": "arrange appointments, understand instructions, letters & conversations; Vocabulary: related to the topic; Grammar: Dativ preposition & articles and Accusative possessivarticle. (6)"
                },
                {
                    "title": "Meine Wohnung – Learning:",
                    "content": "To understand advertisements & describe flats; Vocabulary: related to the topic; Grammar: Adjectives & wechsel prepositions.(6)"
                }
            ],
            "textbooks": [
                "1.\tDengler,Stefanie et al.,, Netzwerk A1, Klett-Langenscheidt Gmbh, München, 2013.",
                "2.\tSandra Evans, Angela Pude, Franz Specht-Menschen  A1–Hueber Verlag ,2012."
            ]
        },
        {
            "code": "20XCO2",
            "title": "VIRTUAL AND AUGMENTED REALITY",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO VR AND AR:",
                    "content": "Overview of class, logistics, history of VR/AR.\t(5)"
                },
                {
                    "title": "THE GRAPHICS PIPELINE AND OPENGL:",
                    "content": "Overview and Transformations: rotation, translation, scaling, model view matrix, projection matrix, Lighting and Shading.(7)"
                },
                {
                    "title": "OPENGL SHADING LANGUAGE (GLSL):",
                    "content": "vertex and fragment shaders.(5)"
                },
                {
                    "title": "THE HUMAN VISUAL SYSTEM:",
                    "content": "Perception of depth, color, contrast, resolution, Stereo Rendering.(5)"
                },
                {
                    "title": "HEAD MOUNTED DISPLAY OPTICS:",
                    "content": "Magnifier designs, stereo rendering for HMDs, lens distortion correction, advanced HMD optics.(7)"
                },
                {
                    "title": "INERTIAL MEASUREMENTS UNITS:",
                    "content": "gyros, accelerometers, magnetometers, sensor fusion, complementary filter, Arduino(6)"
                },
                {
                    "title": "POSITIONAL TRACKING:",
                    "content": "Tracking with the light house, advanced positional tracking. SPATIAL SOUND.(5)"
                },
                {
                    "title": "PANORAMIC IMAGING AND CINEMATIC VR:",
                    "content": "Engines and Other Aspects of VR (latency, eye tracking, post-rendering warp)(5)"
                }
            ],
            "textbooks": [
                "1.\tMarschner, Shirley, “Fundamentals of Computer Graphics”, CRC Press, 2016.",
                "2.\tLa Valle, “Virtual Reality”, Cambridge University Press, 2016."
            ]
        },
        {
            "code": "20XCO3",
            "title": "COMPUTATIONAL FOUNDATION FOR ROBOTICS",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Robots and their applications in industry, mobile and service applications, Configurations of industrial and mobile robots. Robot controllers, drives, actuators and sensors,\tSpatial descriptions and Transformations: Positions, orientations and frames, Mappings, translations, rotations and transformations, transformation arithmetic, Transform equations, representation of orientation, free vector transformation, Introduction to ROS.(12)"
                },
                {
                    "title": "FORWARD AND INVERSE KINEMATICS:",
                    "content": "Link co-ordinates, D-H Representation, Arm equation -Two axis and three axis, robots, Inverse kinematics of two axis and three axis robots, Maneuverability – Workspace – Control.(15)"
                },
                {
                    "title": "LOCALIZATION AND MAPPING:",
                    "content": "Challenges in mobile robots, Introduction - Bayes filter – Kalman Filter - Extended Kalman Filter -  Information Filter -  Histogram Filter - Particle Filter –Localization- Map Representation- Probabilistic Map based Localization-Monte carlo localization- Landmark based navigation-Globally unique localization- Positioning beacon systems- Route based localization – Mapping – Metrical maps - Grid maps - Sector maps – Hybrid Maps – SLAM(18)"
                },
                {
                    "title": "DECISION MAKING:",
                    "content": "planning and dynamic programming principles, Configuration space abstraction, Sampling-based planners for mobile robots, Feedback-based planning for mobile robots- Feedback in discrete spaces, wave-front functions,  Potential and navigation functions for mobile robots.(15)"
                },
                {
                    "title": "PLANNING AND NAVIGATION:",
                    "content": "Overview of the three computational components and their interaction, sensing, planning, and control - Global path planning – A* Algorithm - local path planning - Road map path planning- Cell decomposition path planning-Potential field path planning-Obstacle avoidance – Path control. Markov Decision Process (MDP) in discrete spaces, optimal control and steering methods- Nonlinear optimization and gradient methods.(15)"
                }
            ],
            "textbooks": [
                "1.\tJohn J. Craig, Introduction to Robotics: Mechanics and Control, Pearson Education  Company,  2008",
                "2.\tSteven M. LaValle, Planning Algorithms, Cambridge University Press, 2006",
                "3.\tHowie Choset, Kevin M. Lynch, Seth Hutchinson, George A. Kantor, Wolfram Burgard, Lydia E. Kavraki, Sebastian Thrun, Principles of  Robot Motion  Theory, Algorithms, and Implementations (PRMTAI), MIT Press, 2005."
            ]
        },
        {
            "code": "20XCO4",
            "title": "STOCHASTIC MODELS",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "STOCHASTIC PROCESSES:",
                    "content": "Introduction – Classification of Stochastic Processes – Markov Chain: Introduction -Transition Probability Matrices – Chapman Kolmogorov Equations - Classification of States – Limit Theorems – Branching Processes – Time Reversible Markov chains – Markov Decision Processes -   Applications.(13)"
                },
                {
                    "title": "CONTINUOUS TIME MARKOV CHAINS:",
                    "content": "Introduction – Poisson Process - Birth and Death Processes – Kolmogorov Differential Equations – Pure Birth Process - Pure Death Process - Applications.(10)"
                },
                {
                    "title": "RENEWAL THEORY:",
                    "content": "Introduction – Distribution - Renewal Theorems - Residual and Excess Life Times -Alternating Renewal Process - Renewal Reward Processes – Regenerative Processes.(8)"
                },
                {
                    "title": "GENERAL QUEUEING MODELS:",
                    "content": "Single and Multi server Poisson Queues - Single Server Queue with Poisson input and general service  M / G/1 – General input and exponential service – G/M/1 Queueing model.(9)"
                },
                {
                    "title": "BROWNIAN MOTION:",
                    "content": "First Passage time distribution – The maximum of a Brownian Motion – The Zeros of Brownian Motion – Brownian Motion with Drift -  Geometric Brownian  Motion.(5)"
                }
            ],
            "textbooks": [
                "1.     Mark A Pinsky, Samuel Karlin, “An Introduction to Stochastic Modelling”, Academic Press, 2011.",
                "2.     Nicolas Privault, “ Understanding Markov Chains”, Springer, 2018.",
                "3.     Roy D.Yates and David J. Goodman, “Probability and Stochastic Processes – A friendly Introduction for Electrical and  Computer Engineers”, John Wiley & Sons, 2014."
            ]
        },
        {
            "code": "20XCO5",
            "title": "PRINCIPLES OF MANAGEMENT",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "PRINCIPLES OF MANAGEMENT:",
                    "content": "Meaning, Definition and Significance of Management, Basic Functions of Management – Planning, Organizing, Staffing, Directing and Controlling.  Organizational Environment – Social, Economic, Technological and Political.   Corporate Social Responsibility -  Case discussion(8)"
                },
                {
                    "title": "INDUSTRIAL AND BUSINESS ORGANIZATION:",
                    "content": "Growth of Industries (Small Scale, Medium Scale and Large Scale Industries).  Forms of Business Organizations. Resource Management – Internal and External Sources.(7)"
                },
                {
                    "title": "ORGANIZATIONAL BEHAVIOUR:",
                    "content": "Significance of OB, Impact of culture on organization. Role of leadership and leadership styles. Personality and Motivational Theories.  Attitudes, Values and Perceptions at work - Case discussion(7)"
                },
                {
                    "title": "GROUP BEHAVIOUR:",
                    "content": "Group dynamics, Group formation and development, group structure and group cohesiveness. Informal organization – Sociometry – Interaction analysis - Exercises(8)"
                },
                {
                    "title": "GLOBALISATION:",
                    "content": "Issues for global competitiveness, proactive and reactive forces of globalization. Cross cultural management – Management of work force diversity.(5)"
                },
                {
                    "title": "HUMAN RESOURCE MANAGEMENT:",
                    "content": "and Functions, Selection and Placement, Training and Development – Conflict management – Stress management -  Human resource management in global environment - Human resource information system(HRIS)  - Case discussion.\t(10)"
                }
            ],
            "textbooks": [
                "1.\tHarold Koontz, Heinz Weihrich and Ramachandra Aryasri, “Principles of Management”, Tata McGraw Hill, 2014.",
                "2.\tMamoria CB, “Personnel Management”, Sultan Chand & Sons, 2005."
            ]
        },
        {
            "code": "20XCO6",
            "title": "ENVIRONMENTAL SCIENCE AND GREEN COMPUTING",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "NATURAL RESOURCES, ECOSYSTEMS AND BIODIVERSITY:",
                    "content": "Environment, Definition, Scope and importance, Forest resources, Use and overexploitation, Water resources: Use and over utilization. Eco system; Structure and functions of an eco system, energy flow in the eco system.  Bio Diversity; values of biodiversity, biodiversity at global, national and local levels – threats to bio diversity.  Conservation of bio diversity – In-situ & Ex-situ conservation.(9)"
                },
                {
                    "title": "ENERGY SOURCES:",
                    "content": "Growing energy needs, Renewable and non renewable energy sources,  Hydro power, Solar Power:  Photovoltaic Energy – Motivation for going Solar – Solar Electricity – PV cells. Wind Power: – Using the Wind: Generating Power at Remote Sites,– Measuring the Wind – Estimating the output.  Use of alternate energy sources.(9)"
                },
                {
                    "title": "SOCIAL ISSUES AND THE ENVIRONMENT:",
                    "content": "From unsustainable to sustainable development, Urban problems related to energy, Water conservation, Rain water harvesting, Watershed management, Environment and human health, Role of information technology in environment and human health. Environment Protection Act: Air (Prevention and Control of Pollution) Act – Water Act,   Forest Conservation Act, Wildlife Protection Act,   Introduction to EIA and ISO 14000.(9)"
                },
                {
                    "title": "ENVIRONMENTAL POLLUTION AND DISASTER MANAGEMENT:",
                    "content": "Definition – causes, effects and control measures of air pollution, water pollution, soil pollution, noise pollution, thermal pollution and nuclear hazards. Disaster management - floods, earthquake, cyclone and landslides. Solid waste management - causes, effects and control measures of municipal solid wastes (Biomedical wastes, hazardous wastes). Role of an individual in prevention of pollution.(9)"
                },
                {
                    "title": "GLOBAL ATMOSPHERIC CHANGE & GREEN  FUNDAMENTALS:",
                    "content": "The Atmosphere of Earth – Global Temperature – Global Energy Balance , The  Greenhouse Effect  - Environmental Issues and Green Computing,  Electronic waste management: Introduction;- Environment and society,  producer responsibility legislation – the Waste Electrical and Electronic Equipment (WEEE) directive,  Materials Composition of WEEE: Mobile Phones – Television – Washing Machines, - Current and new electronic waste recycling technology- Future perspectives of electronic scrap. (9)"
                }
            ],
            "textbooks": [
                "1.\tMackenzie L. Davis, and David A. Cornwell, “Introduction to Environmental Engineering”, Tata McGraw Hill,  2010.",
                "2.\tChetan Singh Solanki, “Solar Photovoltaics”, PHI, 2011.",
                "3.\tSiraj Ahmed, “Wind Energy : Theory and Practice”, PHI, 2011.",
                "4.\tMahajan S. P. Pollution Control in Process Industries, Tata McGraw Hill, 1985.",
                "5.\tR. E. Hester and R. M. Harrison, “Electronic Waste Management”, Royal Society of Chemistry, 2009."
            ]
        },
        {
            "code": "20XCO7",
            "title": "COMPUTATIONAL FINANCE",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "MATHEMATICAL  PRELIMINARIES:",
                    "content": "Conditional expectation – Sigma Algebra – Filtrations, Stochastic Calculus -  Random walk – Brownian motion – Martingales  – Ito’s Lemma.(5)"
                },
                {
                    "title": "FINANCIAL DERIVATIVES:",
                    "content": "Law of one price – Risk neutral pricing – Arbitrage and Hedging – Financial Products and capital markets – Futures, Forwards and options – Options pricing  problem. Risk free assets – risky assets.(8)"
                },
                {
                    "title": "BASIC OPTIONS THEORY:",
                    "content": "Definitions – Pay off diagrams – Single period binomial options theory – Multi period binomial options theory – Real options – American options, Simulation methods for options pricing – Random variable generation – simulation of stochastic processes. Black Schole’s formula.(11)"
                },
                {
                    "title": "PORTFOLIO THEORY:",
                    "content": "Introduction - Portfolio theory with matrix algebra - Review of constrained optimization methods, Markowitz algorithm, Markowitz Algorithm using the solver and matrix algebra – Portfolio choice and linear pricing – Statistical analysis of efficient portfolios. Sharpe’s single index model(11)"
                },
                {
                    "title": "THE CAPITAL ASSET PRICING (CAP) AND RISK BUDGETING:",
                    "content": "Mean variance portfolio theory – Asset returns – Variance as a risk measure - The one and two fund theorems, The capital market line – CAP  as a pricing formula – Systematic and unsystematic risk – Euler’s theorem – Asset contributions to volatility – beta as a measure of portfolio risk ,  Limitations of mathematical models in finance.(10)"
                }
            ],
            "references": [
                "1.\tMarek Capinski, Tomasz Zastawniak, “Mathematics for Finance: A Introduction to Financial engineering”, Springer, 2011.",
                "2.\tDavid Ruppert, “Statistics and Data Analysis for Financial Engineering”, Springer-Verlag, 2011.",
                "3.\t Edwin J. Elton, Martin J. Gruber, Stephen J. Brown and William N. Goetzmann “Modern Portfolio Theory and Investment Analysis”, Wiley, 2014.",
                "4.\t Simon Benninga, “Financial Modeling”, MIT Press, 2014.",
                "5.\tSteven E Shreve, “Stochastic  Calculus for Finance – I” , Springer, 2012",
                "6.\tGlasserman Paul, “Monte Carlo Methods in financial Engineering”, Springer Science and Business media, 2013."
            ]
        },
        {
            "code": "20XCO8",
            "title": "ENTERPRENEURSHIP",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO ENTREPRENEURSHIP:",
                    "content": "– Characteristics and Functions of an Entrepreneur – Common myths about entrepreneurs – Importance or Entrepreneurship.(5)"
                },
                {
                    "title": "CREATIVITY AND INNOVATION:",
                    "content": "The role of creativity – The innovation Process – Sources of New Ideas – Methods of Generating Ideas – Creative Problem Solving – Entrepreneurial Process.(6)"
                },
                {
                    "title": "DEVELOPING AN EFFECTIVE BUSINESS MODEL:",
                    "content": "The Importance of a Business Model – Starting a small scale industry - Components of an Effective Business Model.(5)"
                },
                {
                    "title": "APPRAISAL OF PROJECTS:",
                    "content": "Importance of Evaluating Various options and future investments- Entrepreneurship incentives and subsidies – Appraisal Techniques.(8)"
                },
                {
                    "title": "FORMS OF BUSINESS ORGANIZATION:",
                    "content": "Sole Proprietorship – Partnership – Limited liability partnership - Joint Stock Companies and Cooperatives. (4)"
                },
                {
                    "title": "FINANCING THE NEW VENTURE:",
                    "content": "Determining  Financial Needs – Sources of Financing – Equity and Debt Funding – Case studies in Evaluating Financial Performance.(8)"
                },
                {
                    "title": "THE MARKETING FUNCTION:",
                    "content": "Industry Analysis – Competitor Analysis – Marketing Research for the New Venture – Defining the Purpose or Objectives – Gathering Data from Secondary Sources – Gathering Information from Primary Sources – Analyzing and Interpreting the Results – The Marketing Process.(5)"
                },
                {
                    "title": "INTELLECTUAL PROPERTY PROTECTION AND ETH ICS:",
                    "content": "Patents – Copyright - Trademark- Geographical indications – Ethical and social responsibility and challenges. (4)"
                }
            ],
            "textbooks": [
                "1.\tDonald F.Kuratko and Richard M.Hodgetts, “Entrepreneurship”, South-Western, 2003.",
                "2.\tThe Dynamics of Entrepreneurial Development and Management, Vasant Desai, Himalaya Publishing House, 2010."
            ]
        },
        {
            "code": "20XCO9",
            "title": "STATISTICAL LEARNING",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "THEORETICAL FOUNDATIONS:",
                    "content": "Function Spaces: Banach Spaces, Cauchy Sequences, Holder spaces, Sobolev spaces, reproducing kernel Hilbert spaces (RKHS),Concentration of Measure.(10)"
                },
                {
                    "title": "LINEAR REGRESSION:",
                    "content": "Low Dimensional Linear Regression, Ridge Regression, Lasso Regression.(8)"
                },
                {
                    "title": "NONPARAMETRIC REGRESSION :",
                    "content": "Estimators, Polynomial Estimators, Linear Smoothers, Cross Validation, Data Splitting, Additive Models, SpAM algorithm(7)"
                },
                {
                    "title": "LINEAR CLASSIFICATION:",
                    "content": "Review of Classification Models, Newton’s Method for Logistic Regression, Comparison of Logistic Regression with Linear Discriminant Analysis, Regularized Logistic Regression, SVM.(7)"
                },
                {
                    "title": "NON-PARAMETRIC CLASSIFICATION:",
                    "content": "Plugin methods, k-NN, Boosting.(6)"
                },
                {
                    "title": "MINIMAX RISK:",
                    "content": "Bounds of minimax risk, Le Cam’s method, Fano’s method, Tsybakov’s method, Hypercubes.(7)"
                }
            ],
            "textbooks": [
                "1.\tGareth James, Daniela Witten, Trevor Hastie, Robert Tibshirani, “An introduction to Statistical learning”, Springer, 2013.",
                "2.\tTrevor Hastie, Robert Tibshirani, Jerome Friedman, “Elements of Statistical Learning: Data Mining, Inference and Prediction”, Springer, 2013."
            ]
        },
        {
            "title": "20XCOA MATHEMATICAL MODELLING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO MODELING:",
                    "content": "Modeling process, Overview of different kinds of model.(3)"
                },
                {
                    "title": "EMPIRICAL MODELING WITH DATA FITTING:",
                    "content": "Error function, least squares method; fitting data with polynomials and splines.(4)"
                },
                {
                    "title": "CAUSAL MODELING AND FORECASTING:",
                    "content": "Introduction, Modeling the causal time series, forecasting by regression analysis, predictions by regression. Planning, development and maintenance of linear models, trend analysis, modeling seasonality and trend, trend removal and cyclical analysis, decomposition analysis. Modeling financial time series. Econometrics and time series models. Non seasonal models: ARIMA process for univariate and multivariate. (8)"
                },
                {
                    "title": "INVENTORY MODELS:",
                    "content": "Classic Economic Order Quantity (EOQ) Model, EOQ with price breaks, Multi-item EOQ with Storage limitation, Dynamic EOQ , Probabilistic EOQ model , No setup model, Setup model (s-S Policy).(7)"
                },
                {
                    "title": "PORTFOLIO MODELING AND ANALYSIS:",
                    "content": "Portfolios, returns and risk, risk-reward analysis, asset pricing models, mean variance portfolio optimization, Markowitz model and efficient frontier calculation algorithm, Capital Asset Pricing Models (CAPM).(8)"
                },
                {
                    "title": "MODELING WITH BIOINFORMATICS:",
                    "content": "Introduction, Biological data- types, mode of collection, documentation and submission. Sequence alignment- Definition, significance, dot matrix method, dynamic programming- Global and local alignment tools, scoring matrices and gap penalties. Multiple sequence alignment: Iterative methods. Hidden Markovian models, statistical methods, position specific scoring matrices.(15)"
                }
            ],
            "textbooks": [
                "1. Giordano F R, Weir M D and Fox W P,“A First Course in Mathematical Modeling”, Brooks/Cole, 2008.",
                "2. Mount, DW, “Bioinformatics Sequence and genome analysis”, Cold Spring Harbor Laboratory, 2004."
            ]
        },
        {
            "title": "20XCOB  ADVERSARIAL MACHINE LEARNING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "Introduction:",
                    "content": "supervised, un-supervised and Reinforcement learning in Adversarial setting – Categories of Attacks on machine learning, based on attack time, Information available to attacker – attacker goals (5)"
                }
            ],
            "textbooks": [
                "1.Yevgeniy Vorobeychik, Murat Kantarcioglu, Adversarial Machine Learning, Morgan & claypool Publishers, 2018",
                "2. Ian Goodfellow and Yoshua Bengio and Aaron Courville, Deep learning MIT Press, 2016"
            ]
        },
        {
            "title": "20XCOC  NETWORK SCIENCE",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Basics of networks and graphs, random network model - degree distribution, evolution, small world property, six degrees of separation, Watts-Strogatz model, local clustering coefficient, random networks and network science. (5)"
                },
                {
                    "title": "BARABÁSI-ALBERT MODEL:",
                    "content": "Growth and preferential attachment, Barabási-Albert model, degree dynamics, degree distribution, diameter  and the clustering coefficient, preferential attachment - absence of growth, measure, non-linearity, the origins. \t                 (8)"
                },
                {
                    "title": "SCALE-FREE PROPERTY:",
                    "content": "Power laws and scale-free networks, Hubs, Universality, Ultra-small property, role of the degree exponent, Generating networks with a pre-defined degree distribution.    (10)"
                },
                {
                    "title": "EVOLVING NETWORKS:",
                    "content": "Bianconi-Barabási model, measuring fitness, Bose-Einstein condensation, evolving networks. (6)"
                },
                {
                    "title": "DEGREE CORRELATIONS:",
                    "content": "TAssortativity and disassortativity, Measuring degree correlations, Structural cutoffs, Degree correlations in real networks, Generating correlated networks, impact of degree correlations. (8)"
                },
                {
                    "title": "NETWORK ROBUSTNESS:",
                    "content": "Percolation theory, robustness of scale-free networks, attack tolerance, cascading failures, modeling cascading failures, building robustness.\t\t                                   (8)"
                }
            ],
            "textbooks": [
                "1.\tAlbert-László Barabási, “Network Science”, Cambridge University Press, 2020."
            ]
        },
        {
            "title": "20XCOD  SOFTWARE PATTERNS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO PATTERNS:",
                    "content": "Reusable object oriented software, Motivation, Best design practices of object oriented software, Coupling and Cohesion, Types of Cohesion and Coupling, Benefits of patterns, Definition of a Pattern, Types, Pattern description, Pattern Language, IDIOMS, Framework, Architecture.               (6)"
                },
                {
                    "title": "DESIGN PATTERNS:",
                    "content": "Creational patterns – Abstract factory, Builder, Factory method, Prototype, Singleton, Structural patterns –  Adapter, Bridge, Composite, Decorator, Façade, Flyweight, Proxy, Behavioral patterns – Command, Interpreter, Iterator, Mediator,  Memento, Observer,  State, Strategy, Template method, Visitor, Chain of Responsibility, Case Studies.    (15)"
                },
                {
                    "title": "ARCHITECTURAL PATTERNS:",
                    "content": "From Mud to Structure – Layers, Pipes and Filters, Blackboard, Distributed systems – Broker, Interactive Systems – Model View Controller (MVC), Presentation Abstraction Control, Adaptable Systems – Reflection, Microkernel. Anti-Patterns. (13)"
                },
                {
                    "title": "REFACTORING:",
                    "content": "What is refactoring, Principles in refactoring, Bad smells in code, Refactoring Techniques - Composing methods, Moving features between objects, Organizing data, Simplifying conditional expressions, Making method calls simpler, Dealing with generalization. Design Refactoring – Technical Debt, Design Smells, Abstraction Smells, Encapsulation Smells, Modularization Smells, Hierarchy Smells, Architectural Refactoring. Refactoring Tools.\t  (11)"
                }
            ],
            "textbooks": [
                "1.\tErich Gamma, Richard Helm, Ralph Johnsons and John Vlissides, “Design Patterns: Elements of Reusable Object-Oriented Software”, Pearson Education, 2009.",
                "2.\tFrank Buschman, Regine Meunier, Hans Rohnert, Peter Sommerlad and Michael Stal, “Pattern-Oriented Software Architecture: A System of Patterns”, John Wiley, 2011.",
                "3.\tMartin Fowler, Kent Beck, William Opdyke, Don Roberts, “Refactoring: Improving the Design of Existing Code”, Addison-Wesley Longman, 2012."
            ]
        }
    ],
    "url": "https://amcsregulations.psgtech.ac.in/curriculum/cs/2020/syllabi.html",
    "coordinator": "Mrs.Suganthi SD"
}