{
    "program_name": "M.Sc Software Systems",
    "year": "2020",
    "courses": [
        {
            "code": "20XW11",
            "title": "CALCULUS AND ITS APPLICATIONS",
            "semester": 1,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "LIMITS AND CONTINUITY:",
                    "content": "Standard functions –Graphs- Limit- continuity- piecewise continuity- periodic- differentiable functions - Riemann sum- integrable functions- fundamental theorem of calculus.                                                  \t(4+4)"
                },
                {
                    "title": "SEQUENCES & SERIES:",
                    "content": "Sequences – increasing- decreasing- bounded- function limit properties - Series – convergence and divergence – alternating series test- absolute convergence – ratio test- power series- Taylor series (single variable).  (8+6)"
                },
                {
                    "title": "FUNCTIONS OF TWO VARIABLES:",
                    "content": "Models- partial derivative and its geometrical interpretation- Stationary points – maxima and minima- saddle points- Taylor series- Constrained maxima and minima – Lagrange multiplier method. \t\t(6+4)"
                },
                {
                    "title": "MULTIPLE INTEGRALS:",
                    "content": "Evaluation of multiple integrals – Cartesian and polar forms- Change of order of integration - Applications of multiple integrals to find area and volume.                           \t\t\t\t                (9+6)"
                },
                {
                    "title": "ORDINARY DIFFERENTIAL EQUATIONS:",
                    "content": "Linear Differential Equations of first order - Exact differential equations- Integrating factors- Bernoulli equations -Linear Differential Equations of higher order with constant coefficients -Euler's equation with variable coefficients - Simultaneous equations - Method of variation of parameters. Modeling simple systems. \t              (12+8)"
                },
                {
                    "title": "VECTOR CALCULUS:",
                    "content": "Vector differentiation-gradient- divergence- curl- vector integration- Greens theorem- Stokes theorem- Gauss divergence theorem (Concepts only).\t\t\t\t\t\t\t\t(6+2)"
                }
            ],
            "textbooks": [
                "1.\tThomas G B Jr., Maurice D Wier, Joel Hass, Frank R. Giordano, “Thomas’ Calculus”, Pearson Education,  2018.",
                "2.\tErwin Kreyszig, “Advanced Engineering Mathematics”, John Wiley, 2014."
            ]
        },
        {
            "code": "20XW12",
            "title": "ENGLISH FOR PROFESSIONAL SKILLS",
            "semester": 1,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "COMMUNICATION SKILLS USING SCIENTIFIC TEXTS:",
                    "content": "Comprehension and critical evaluation of Scientific Essays – Focus on Language Style, Word Formation, Use of Prefixes and Suffixes, Synonyms, Antonyms, Abbreviations and Acronyms and Technical Vocabulary.(6)"
                },
                {
                    "title": "FOCUS ON GRAMMAR:",
                    "content": "Identifying Common Errors In Articles And Prepositions, Common Errors-Misplaced Modifiers-Tenses-Redundancies And Clichés-Practice Exercises In Common Errors. (6)"
                },
                {
                    "title": "READING:",
                    "content": "Reading and Importance-Techniques Of Effective Reading-Improving Comprehension Skills-Techniques For Good Comprehension-Skimming And Scanning-Comprehension-Intensive And Extensive Reading-Practice In Reading Comprehension.(4)"
                },
                {
                    "title": "WRITING:",
                    "content": "Formal Letters-Letter of Complaint, Requisition Letter- Job Application and Resume- Report Writing- Types Of Reports- Business And Technical Reports.(6)"
                },
                {
                    "title": "FOCUS ON SOFT SKILLS:",
                    "content": "Intra & Interpersonal Communication-Interview Techniques-Etiquette-Body Language-Telephone Conversation. (8)"
                },
                {
                    "title": "PRACTICALS:",
                    "content": "Presentations-Group Discussions-Listening Exercises-Mock Interviews. (15)"
                }
            ],
            "textbooks": [
                "1.\tN.P.Sudharshana, C. Savitha “English for Engineers”, Cambridge University Press, 2018."
            ]
        },
        {
            "code": "20XW13",
            "title": "APPLIED PHYSICS",
            "semester": 1,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "MECHANICS:",
                    "content": "Displacement. First, second and third order time-derivatives of displacement. Concept of generalised coordinates. Inertial mass, moment of inertia, force, torque. Equilibrium and principle of virtual work. 2D Motion in a gravitational field. Conservative and non-conservative force-fields. Conservation of momentum. Elastic and inelastic collisions. Energy loss and deformation in inelastic collisions. Energy absorbed in material fracture. Applications to packaging, protection and inspection of equipment.\t\t\t\t\t\t\t\t\t\t (12)"
                },
                {
                    "title": "MECHANICAL OSCILLATIONS:",
                    "content": "Hooke’s law. Characteristics of a spring and damper. Differential equation of a spring, mass and damper system and its solution. Natural frequency. Forced oscillations. Frequency response of the system and resonance. Damping and energy dissipation. Application to vibration control and shock absorbers. Considerations for mechanical isolation of equipment. Magneto-rheological fluids and application to adaptive dampers.\t\t\t\t\t (12)"
                },
                {
                    "title": "HEAT AND THERMAL CONTROL:",
                    "content": "Temperature, specific heat-capacity. Temperature and temperature gradient in heat flow. Temperature gradient due to internal and external heat sources. Thermal conductivity. Differential equation of one and two dimensional heat conduction. Boundary conditions and solutions. Thermal insulation. Principles of convective and radiative heat transfer. Heat sinks and heat pipes for heat removal from equipment. Forced air convection.\t\t\t(12)"
                },
                {
                    "title": "HYGROMETRY:",
                    "content": "Air and water-vapour mixtures. Saturation and condensation of moisture from air and its relation to temperature. Dew point. Moisture condensation in electronic equipment and its hazards. Relative humidity. Measurement of relative humidity by dry and wet bulb methods.  Humidity sensors and software support for hygrometry. Need  for  humidity control in installations and equipment. Methods to control humidity. Humidifiers, driers and dessicators.\t\t (12)"
                },
                {
                    "title": "OPTICS:",
                    "content": "Light propagation through non-homogeneous refractive media. Fermat’s principle and  determination of optical path. Application to light propagation through optical fibres. Numerical aperture. Step-index and graded-index fibres, single mode and multi-mode fibres. Multiplexing and modulation. Bandwidth advantage. Digital optical communication principles. Pulse-broadening in digital communication by optical fibres. Signal degradation due to attenuation and dispersion. Advantages of optical communication.\t\t\t\t\t\t\t\t\t\t(12)"
                }
            ],
            "textbooks": [
                "1.\tHalliday, David, Robert Resnick, and Jearl Walker, “Fundamentals of Physics”, John Wiley & Sons, 2010",
                "2.\tRichard. Wolfson, ”Essential University Physics with Mastering Physics”, Pearson Education Limited, 2015",
                "3.\tYoung, Hugh D., Roger A. Freedman, “University Physics with Modern Physics”, Pearson Education, 2017."
            ]
        },
        {
            "code": "20XW14",
            "title": "ANALOG AND DIGITAL ELECTRONICS",
            "semester": 1,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "SEMICONDUCTOR DEVICES AND CIRCUITS:",
                    "content": "(Qualitative treatment only) Fundamental aspects of semiconductors - PN junction diode -Zener diode - Rectifiers - Zener voltage regulators - Filters - Bipolar Junction Transistors - Transistor Amplifiers - Field Effect Transistor.(7)"
                },
                {
                    "title": "NUMBER SYSTEM AND CODES:",
                    "content": "Binary - Octal - Hexadecimal - BCD - excess three - Gray codes - Error correcting and detecting codes.(7)"
                },
                {
                    "title": "DIGITAL CIRCUITS AND GATES:",
                    "content": "AND, OR, NOT, NAND and NOR gates - exclusive OR gates. Positive and negative logic systems - Digital integrated circuits-Characteristics -TTL and MOS logic circuits - Comparison.(6)"
                },
                {
                    "title": "BOOLEAN ALGEBRA AND KARNAUGH MAPS:",
                    "content": "Boolean relations - Laws and theorems - Simplifications - Karnaugh maps and simplifications - Don’t care conditions - NAND-NAND realizations.(7)"
                },
                {
                    "title": "COMBINATIONAL LOGIC:",
                    "content": "Design and Implementation of Half and Full adders - Subtractors - Parallel adders - Carry look ahead addition -  Encoders and decoders - Multiplexers and De-multiplexers.(8)"
                },
                {
                    "title": "SEQUENTIAL LOGIC:",
                    "content": "R-S, J-K, D and T type Flip-Flops - Binary counters: Ripple and synchronous types - UP/DOWN counters - Decade counters - Shift registers - Ring counters.(7)"
                },
                {
                    "title": "OPERATIONAL AMPLIFIERS:",
                    "content": "Definition of terms - Inverting and non-inverting amplifiers, inverting summing amplifier, integrators and differentiators.(9)"
                },
                {
                    "title": "A/D AND D/A CONVERTORS:",
                    "content": "DACs: weighted and binary ladder types - ADCs: counter, dual slope, successive approximation types.(9)"
                }
            ],
            "textbooks": [
                "1.  Donald P Leach, Albert Paul Malvino and Goutamsaha, “Digital Principles & Applications”, Tata McGraw Hill, 2011.",
                "2.  Allen Mottershead, “Electronic devices and circuits – An Introduction”, Prentice Hall, 2009."
            ]
        },
        {
            "code": "20XW15",
            "title": "PROBLEM SOLVING AND C PROGRAMMING",
            "semester": 1,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "PROBLEM SOLVING:",
                    "content": "Introduction to Problem Solving- Program development- Analyzing and Defining the Problem- Algorithm-Flow Chart - Programming languages-Types of programming languages- Program Development Environment. \t (5)"
                },
                {
                    "title": "C LANGUAGE:",
                    "content": "Introduction to C Language -  C Character Set - Identifiers and Keywords - Data Types – Literal Constants - Variables – l-value-r-value - Qualifiers – Modifiers - Operators and Expressions – Type conversions - Library Functions - Data Input and Output Functions – escape sequence characters – Formatted input and output. (6)"
                },
                {
                    "title": "CONTROL STATEMENTS:",
                    "content": "Making Decisions : If Statement – If/else Statement - If/else if Statement – Nested if Statements – dangling else - Switch Multiple Selection Statement– Repetition : Repetition Essentials - While Loop – do-While Loop – For Loop – Nested Loops  – Breaking out of a Loop  Continue statement  – goto Statement. \t (6)"
                },
                {
                    "title": "FUNCTIONS:",
                    "content": "Modular Programming – Function Prototypes - Defining and Calling Functions –Function Call Stack and Activation Records - Passing Arguments to Functions – Returning a value from a function- Recursion – Recursion vs. Iteration – Scope and lifetime of variables – Memory layout of a C program - Storage Classes - Auto - Static - Extern and Register Variables.\t(8)"
                },
                {
                    "title": "ARRAYS:",
                    "content": "Defining Array –Array Initialization - Accessing array elements - Processing arrays - Arrays as function arguments - Multidimensional arrays – Memory address calculation of an array – Row major and column major order - String Handling.    (8)"
                },
                {
                    "title": "POINTERS:",
                    "content": "Pointer Variable Definitions and Initializations – Passing Arguments to Functions by address – Pointer Expressions and Pointer Arithmetic - Relationship between Pointers and Arrays  - Pointers and multidimensional arrays –Constant Pointer – Pointer to Constant –NULL pointer- dangling pointers - Pointers to functions - passing functions to other functions – Introduction to Stack and Heap Memory - Dynamic Memory Allocation.\t(10)"
                },
                {
                    "title": "STRUCTURES AND UNIONS:",
                    "content": "Structure Definitions – Initializing Structures – Accessing Structure Members -  Processing a structure - typedef- Structures and pointers - Passing structures to functions – Self-Referential Structures- Bit fields - Unions – Enumeration Constants.\t  (8)"
                },
                {
                    "title": "FILES:",
                    "content": "Files and Streams - Operations on Files – Types of Files, Various Read and Write Functions for Sequential-Access and Random-Access Files -Command Line Arguments.      \t  (5)"
                },
                {
                    "title": "PREPROCESSOR DIRECTIVES:",
                    "content": "#include Preprocessor Directive - #define Preprocessor Directive: Symbolic Constants - #define Preprocessor Directive : Macros - Conditional Compilation (4)"
                }
            ],
            "textbooks": [
                "1.\tBrian W. Kernighan and Dennis Ritchie, “The C Programming Language”, Pearson Education India, 2015",
                "2.\tR G Dromey, “How to solve it by computer”, Pearson 2008.",
                "1.\tHerbert Schildt, “C The Complete Reference\", McGraw Hill, 2017.",
                "2.\tGottfried  B, “Programming With C”, McGraw Hill, 2011.",
                "3.\tPeter Prinz and , “C in a Nutshell”, O′Reilly, 2016."
            ]
        },
        {
            "code": "20XW16",
            "title": "ENGINEERING GRAPHICS AND GEOMETRIC MODELLING",
            "semester": 1,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "BIS specifications - lines, lettering, and dimensioning. Projection\n                –types. (4)"
                },
                {
                    "title": "FIRST ANGLE PROJECTION:",
                    "content": "Introduction- Projection of points, lines, planes, and solids\n                –parallel, perpendicular and inclined to planes. (8)"
                },
                {
                    "title": "ISOMETRIC PROJECTION:",
                    "content": "Introduction- prismatic and cylindrical components. (2)"
                },
                {
                    "title": "INTERACTIVE GRAPHICS:",
                    "content": "Parametric modeling –1D, 2D and 3D geometry – transformations -\n                display – points, lines using software. (4)"
                },
                {
                    "title": "CURVES:",
                    "content": "Types- parametric curves generation-displaying - evaluating points on curves.\n                (4)"
                },
                {
                    "title": "SURFACES:",
                    "content": "Types- parametric surface generation-displaying - evaluating points on\n                surfaces. (5)"
                },
                {
                    "title": "SOLIDS:",
                    "content": "Generation of part models using Computer Aided Geometric Modeling software. (3)"
                },
                {
                    "title": "LABORATORY COMPONENT:",
                    "content": "Engineering Graphics using CAD\n                1. Introduction to CAD Software.\n\n                2. First angle projection of a. Points b. Lines\n\n                3. Projection of a. Planes b. Solids\n\n                4. Conversion of isometric to orthographic projection.\n\n                5. Orthographic to isometric projection.\n\n                6. Sectioning of regular solids.\n\n                7. Perspective projection of simple solids.\nGeometric Modeling using a graphical programming language\n\n                8. Modeling and displaying a point and line using orthographic projection and performing\n                simple geometric transformation.\n\n                9. Modeling and displaying of parametrically represented analytical curves\n\n                  a. Circle b. Ellipse\n\n                10. Modeling and displaying of parametrically represented synthetic curves\n\n                  a. Bezier Curve b. B-spline\n\n                11. Modeling and displaying of parametrically represented NURBS curve.\n\n                12. Modeling and displaying of parametrically represented synthetic surface.\n\n                  a. Planar surface b. Ruled surface\n\n                13. Modeling and displaying of Bezier surface.\n\n                14. Modeling and displaying of B-Spline surface."
                }
            ],
            "textbooks": [
                "1. \"A Primer on Engineering Drawing using Pro Engineer\", Department of Production",
                "2. Michael E. Mortensen, \"Geometric Modeling (Digitized)\", Industrial Press, 2011."
            ]
        },
        {
            "code": "20XW17",
            "title": "C PROGRAMMING LAB",
            "semester": 1,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "REFERENCES :",
                    "content": "1. Simple programs to understand the concepts of data types.\n\n                2. Familiarizing conditional, control and repetition statements\n\n                3. Usage of single and double dimensional arrays including storage operation\n\n                4. Implementation of functions, recursive functions\n\n                5. Defining and handling structures, array of structures and union\n\n                6. Implementation of pointers, operation on pointers dynamic storage allocation\n\n                7. Creating and processing data files.\n\n                    1.\tHerbert Schildt, “C The Complete Reference\", McGraw Hill, 2017. \n                    2.\tGottfried  B, “Programming With C”, McGraw Hill, 2011.\n                    3.\tPeter Prinz and , “C in a Nutshell”, O′Reilly, 2016."
                }
            ]
        },
        {
            "code": "20XW18",
            "title": "APPLIED PHYSICS AND DIGITAL ELECTRONICS LAB",
            "semester": 1,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "APPLIED PHYSICS LAB:",
                    "content": "1.\tDetermination of the moment of inertia of a flywheel.\n                2.\tStudy of frequency of oscillation and determination of spring constant of spring-mass system.\n                3.\tDetermination of thermal conductivity of bad conductor - Lee's disc method.\n                4.\tDetermination of thermal conductivity of good thermal conductor-Forbes method.\n                5.\tDetermination of the relative humidity by using wet and dry bulb hygrometer.\n                6.\tDetermination of refractive index of liquids using hollow prism.\nDIGITAL ELECTRONICS LAB:\n\n                1. Study of basic logic gates and realization of logic gates using universal gates.\n\n                2. Multiplexer and demultiplexer.\n\n                3. Half and full adder / subtractor.\n\n                4. Encoder and decoder.\n\n                5. Binary decade counter.\n\n                6. BCD to seven segment decoder.\n\n                7. Study of D/A converter.\n\n                8. Crystal Oscillator using logic gates"
                }
            ]
        },
        {
            "code": "20XW21",
            "title": "LINEAR ALGEBRA",
            "semester": 2,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "SYSTEM OF LINEAR EQUATIONS:",
                    "content": "System of linear equations, Gauss – elimination, Gauss-seIdal method- Application of Linear systems.   \t        (5+3)"
                },
                {
                    "title": "VECTOR SPACES:",
                    "content": "Vector spaces and subspaces – Span, Linear independence and dependence– Basis and dimension - Row space, Column space, and Null space– Rank and nullity- Change of basis– Similarity - Isomorphism.               (10+7)"
                },
                {
                    "title": "INNER PRODUCT SAPCES:",
                    "content": "Inner products, Length and Angle in inner product spaces - Orthonormal bases, Gram Schmidt process - Orthogonal matrices- QR decomposition - Best Approximation and Least-squares.                                     (10+7)"
                },
                {
                    "title": "LINEAR TRANSFORMATION:",
                    "content": "Introduction to linear transformations – General Linear Transformations – Kernel and range – Matrices of general linear transformation- Geometry of linear operators.                                                                     (6+4)"
                },
                {
                    "title": "SPARSE MATRICES:",
                    "content": "Introduction – Storage Schemes – Basic sparse matrix operations – Sparse  direct solutions – random walk problems.                                                                               \t      (4+2)"
                }
            ],
            "textbooks": [
                "1.\tHoward Anton and Chris Rorres, “Elementary Linear Algebra” John Wiley &Sons, 2017.",
                "2.\tDavid C Lay, “Linear Algebra and its Applications “, Pearson Education, 2016."
            ]
        },
        {
            "code": "20XW22",
            "title": "PROBABILITY AND STATISTICS",
            "semester": 2,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "MATHEMATICAL LOGIC:",
                    "content": "Proposition - Logical operators - Truth tables – Laws of Logic – Equivalences – Normal forms - Rules of inference - Validity of arguments – Consistency of specifications – Propositional Calculus – Quantifiers and universe of discourse.\t\t\t\t\t\t\t\t\t\t              (10+7)"
                },
                {
                    "title": "PROOF TECHNIQUES:",
                    "content": "Introduction – Methods of proving theorems – Direct proofs, Indirect proofs – Mathematical induction – Strong mathematical induction and well ordering. \t\t\t\t\t\t\t\t(6+4)"
                },
                {
                    "title": "RELATIONS AND FUNCTIONS:",
                    "content": "Definition and properties of binary relations – Representing Relations – Closures of Relations – Composition of Relations – Equivalence Relations – Partitions and Covering of Sets – Partial Orderings – n-ary Relations and their Applications. Functions - Injective, Surjective, Bijective functions, Composition, Identity and Inverse.         (10+7)"
                },
                {
                    "title": "COMBINATORICS:",
                    "content": "Basics of counting – The Pigeonhole principle - Permutations and Combinations with and without repetition, Permutations with indistinguishable elements, distribution of objects - Generating permutations and combinations in lexicographic order. \t\t\t\t\t\t\t\t\t               (8+4)"
                },
                {
                    "title": "RECURRENCE RELATIONS:",
                    "content": "Some Recurrence Relation Models- Solutions of linear homogeneous recurrence relations with constant coefficients- solution of linear non-homogeneous recurrence relations by the method of characteristic roots. (5+4)"
                },
                {
                    "title": "LATTICES:",
                    "content": "Lattices as partially ordered set – Properties of Lattices– Lattices as algebraic system – Sublattices – Direct product and Homomorphism – Some special lattices. \t\t\t\t\t\t\t(6+4)"
                }
            ],
            "textbooks": [
                "1.\t1.\tKenneth H Rosen, “Discrete Mathematics and its Applications”, Tata McGraw Hill, 2016.",
                "2.\tJudith L. Gersting, “Mathematical Structures for Computer Science”, W.H. Freeman and Company, 2014.",
                "3.\tTremblay J P and Manohar R, “Discrete Mathematical Structures with Applications to Computer Science\", Tata McGraw Hill, 2014."
            ]
        },
        {
            "code": "20XW23",
            "title": "DATA STRUCTURES AND ALGORITHMS",
            "semester": 2,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Software Development process – Abstraction - Data structures - Abstract data Types - Primitive data structures - Analysis of algorithms - Best, worst and average case time complexities – Asymptotic notation – growth of functions.                                                                                                                                                                                    (4)"
                },
                {
                    "title": "ARRAYS:",
                    "content": "Operations - implementation of one, two, and multi dimension arrays – Sparse matrices –Applications;     (3)"
                },
                {
                    "title": "STACKS:",
                    "content": "primitive operations - sequential implementation - Applications: Subroutine handling - Recursion – Expression Processing,Parentheses matching.                                                                                                                                         (6)"
                },
                {
                    "title": "QUEUES:",
                    "content": "Primitive operations - Sequential implementation – Linear queue-Circular queue-Priority queues – Double ended queues – Applications.                                                                                                                    \t                                    (4)"
                },
                {
                    "title": "LISTS:",
                    "content": "Primitive operations - Singly linked lists, Doubly linked lists, Circular lists, Multiply linked lists - Application: Addition of Polynomials  – Linked Stacks -  Linked queues.                                                                                 \t\t\t    (7)"
                },
                {
                    "title": "TREES:",
                    "content": "Terminologies – Binary tree -  Sequential and linked representation - Traversals - Expression trees - Infix, Postfix and Prefix expressions - Heaps - Max heap, Min heap and their operations.                                                                           (7)"
                },
                {
                    "title": "BINARY SEARCH TREES:",
                    "content": "Searching – Insertion and deletion of elements – Analysis.                                           \t    (3)"
                },
                {
                    "title": "GRAPHS:",
                    "content": "Terminologies– Representations using Adjacency matrix, adjacency list – Graph Traversal Algorithms  -  Breadth first and Depth first –  Time complexity Analysis.          \t\t\t\t\t\t                    (4)"
                },
                {
                    "title": "HASH TABLE:",
                    "content": "Hash Function –Collision resolution techniques–Linear probing-Chaining.                                           (3)"
                },
                {
                    "title": "SORTING:",
                    "content": "Insertion Sort, Selection Sort, Bubble Sort, Heap Sort, Radix Sort – Algorithms and time complexity analysis.(4)"
                }
            ],
            "textbooks": [
                "1.\tYedidyah Langsam, Moshe J Augenstein and Aaron M Tenenbaum, \"Data structures using C and C++\", Prentice Hall, 2016.",
                "2.\tSartaj Sahni, \"Data Structures, Algorithms and Applications in C++\", Silicon Press, 2013.",
                "3.\tMichael T. Goodrich, Roberto Tamassia and David Mount, “Data Structures and Algorithms in C++”, John Wiley, 2016."
            ]
        },
        {
            "code": "20XW24",
            "title": "OBJECT ORIENTED PROGRAMMING",
            "semester": 2,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "PRINCIPLES OF OBJECT ENTED PRAMMING:",
                    "content": "Software  crisis Software Evolution - Procedure Oriented Programming - Object Oriented Programming Paradigm -  Basic  Concepts and Benefits of OOP - Object Oriented  Programming Language  -  Application of  OOP -  Structure   of   C++   - Tokens, Expressions and  Control  Structures  -  Operators in C++ - Manipulators. (6)"
                },
                {
                    "title": "FUNCTIONS IN C++:",
                    "content": "Function Prototyping - Call by Reference - Return by reference - Inline functions - Default, Const Arguments - Function -  Overloading -   Friend   and   Virtual Functions -  Classes  and  Objects - Member  functions -  Nesting  of  Member  functions  - Private member functions -  Memory  allocation  for  Objects - Static data members - Static Member  Functions  -  Arrays  of Objects - Objects as Function Arguments  -  Friend Functions  - Returning Objects - Const Member functions - Pointers to Members.\t\t                                                                                                                                                                           (10)"
                },
                {
                    "title": "CONSTRUCTORS:",
                    "content": "Parameterized Constructors - Multiple Constructors in a Class - Constructors with Default Arguments - Dynamic Initialization of Objects - Copy and Dynamic Constructors – Destructors overloading\t.                                       (5)"
                },
                {
                    "title": "OPERATOR OVERLOADING:",
                    "content": "Overloading Unary and Binary Operators - Overloading Binary Operators using Friend functions – Operator Type conversion\t\t\t\t\t\t\t                                                            (4)"
                },
                {
                    "title": "INHERITANCE:",
                    "content": "Defining Derived Classes - Single Inheritance - Making a Private Member Inheritable - Multiple Inheritance - Hierarchical Inheritance - Hybrid Inheritance - Virtual Base Classes - Abstract Classes - Constructors in Derived Classes - Member Classes - Nesting of Classes – Composition – Aggregation \t                                                                                                            (9)"
                },
                {
                    "title": "POLYMORPHISM:",
                    "content": "Basics of polymorphism – Types of polymorphism - Compile and Run Time Polymorphism - Virtual function – Object Slicing – Virtual Destructor – Dynamic binding \t\t\t\t\t                                            (4)"
                },
                {
                    "title": "TEMPLATES & EXCEPTION HANDLING:",
                    "content": "Introduction to Templates, Generic Functions and Generic Classes – Exception Handling – Examples. \t\t\t\t\t\t\t\t\t      (3)"
                },
                {
                    "title": "STREAMS:",
                    "content": "String I/O -Character I/O - Object I/O - I/O with multiple Objects - File pointers - Disk I/O with member function           (4)"
                }
            ],
            "textbooks": [
                "1.  Bjarne Stroustrup, “The C++ Programming Language”, Pearson Education, 2014.",
                "2. Stanley B Lippman, Josee Lajoie and Barbara E Moo, “The C++ Primer”, Pearson Education, 2013.",
                "1.\tHarvey M Deitel, Paul J Deitel, “C++ How to Program”, Prentice Hall, 2014.",
                "2.\tHerbert Schildt, “C++ - The Complete Reference\", Tata McGraw Hill, 2012."
            ]
        },
        {
            "code": "20XW25",
            "title": "COMPUTER ORGANIZATION",
            "semester": 2,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Basic principles - Functional components of a computer system- CPU, Storage, I/O, Multimedia devices - Workstations, Servers,-Interaction among functional components -Bus organization -Data representation- Integer and floating point representation                                                                                                                                                                                       (6)"
                },
                {
                    "title": "PROGRAM EXECUTION:",
                    "content": "Processing of High Level Language Code-Assembler- Code generation,-Application binary interface-- Instruction set architecture of a simple CPU - Microarchitecture of CPU, Instruction codes-The hardware-software interface -Hardware features influenced by software requirements - Specifications of the performance of a system(6)"
                },
                {
                    "title": "BASIC PROCESSING UNIT:",
                    "content": "Fundamental Concepts-- Computer registers  -Register transfer language -Generation and Execution of machine code- Hardware Components-Instruction Fetch and Execution Steps-Control Signals - Hardwired Control Processors (6)"
                },
                {
                    "title": "MEMORY SYSTEM :",
                    "content": "- Basic Concepts- Internal Organization of Memory -  Semiconductor RAM Memories - Static  and  Dynamic RAMs - Read-only Memories - Flash Memory - Direct Memory Access - Cache Memories -  Performance Considerations  -  Caches on the Processor Chip – Cache coherence - Virtual Memory - Segmentation                                                                                    (8)"
                },
                {
                    "title": "PIPELINING  -:",
                    "content": "Basic Concept of pipelining -  Pipeline Organization - Pipelining Issues - Data Dependencies - Operand Forwarding  - Handling Data Dependencies in Software  - Memory Delays- Branch Delays - Branch Prediction -Resource Limitations -Performance Evaluation(6)"
                },
                {
                    "title": "PARALLEL PROCESSING AND PERFORMANCE:",
                    "content": "Fylnns taxonomy- Classification – Instruction level parallelism and its exploitation - Data Level parallelism –Thread Level parallelism- Hardware  multithreading – Multicore processors - Instruction Exceptions.-CISC and RISC Processors- instruction set architecture of x86                                                                      (8)"
                },
                {
                    "title": "INPUT/OUTPUT INTERFACES:",
                    "content": "Bus Structure -  Operation - Synchronous  and  Asynchronous Bus  -  FireWire - PCI Bus - SCSI Bus - SATA - SAS - PCI Express - Interface Circuits- Parallel/Serial /Universal Serial Bus (USB)  Program-Controlled I/O - I/O  Interrupts - Handling Multiple Devices -  Exception handling                                                                                                                                 (7)"
                }
            ],
            "textbooks": [
                "1.\tComputer Architecture and Organization  Designing for Performance, William Stallings, Pearson Education series, 2014.",
                "2.\tComputer Organization and Design :The Hardware/Software Interface, David A. Patterson and John L. Hennessy, Morgan Kaufmann, 2013",
                "3.\tMorris Mano, \"Computer Systems Architecture\", Pearson Education, 2014.",
                "4.\tBarry B. Brey, \"The Intel Microprocessors - 8086/88, and 80186, 80286, 80386, and 80486\",   Pearson Education,   2009."
            ]
        },
        {
            "code": "20XW26",
            "title": "DATA STRUCTURES LAB",
            "semester": 2,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XW27",
            "title": "OBJECT COMPUTING LAB",
            "semester": 2,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XW28",
            "title": "PYTHON PROGRAMMING LAB",
            "semester": 2,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Development Tools (IDE) – Python shell - Python Basics – Data types - Control flow."
                },
                {
                    "title": "CORE PYTHON LANGUAGE:",
                    "content": "Lists - Tuples - Dictionaries - Strings – Regular expressions - Functions - File input/output – Exception handling."
                },
                {
                    "title": "OBJECT-ORIENTED DESIGN:",
                    "content": "Inheritance – Polymorphism."
                },
                {
                    "title": "PACKAGING AND DISTRIBUTION:",
                    "content": "Modules – Packages – Python standard libraries - pip."
                },
                {
                    "title": "STANDARD PACKAGES:",
                    "content": "NumPy – Matplotlib – SciPy – SymPy – Pandas."
                }
            ],
            "textbooks": [
                "1. Mark Lutz, “Learning Python”, O’Reilly Media, 2013.",
                "2. Tony Gaddis, “Starting out with Python”, Pearson, 2017."
            ]
        },
        {
            "code": "20XW31",
            "title": "PROBABILITY AND STATISTICS",
            "semester": 3,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "SAMPLE SPACE AND PROBABILITY:",
                    "content": "Sets, probabilistic models, conditional probability, total probability theorem and Bayes’ rule,independence, gamblers ruin problem. \t\t(6+4)"
                },
                {
                    "title": "DISCRETE RANDOM VARIABLES:",
                    "content": "Random variables concept- Probability mass function. Expectation, mean, and variance. Bernoulli, Binomial, Poisson and Geometric random variables. Joint probability mass function of multiple random variables, conditioning, independence. \t\t(6+4)"
                },
                {
                    "title": "CONTINUOUS RANDOM VARIABLES:",
                    "content": "Probability density function, cumulative distribution function, Uniform, Normal, Exponential, Weibull, and Gamma random variables. Joint probability density function of multiple random variables, conditioning, continuous Bayes’ rule. Sums of independent random variables, convolution, covariance, correlation, and conditional expectation.\t\t(6+4)"
                },
                {
                    "title": "LIMIT THEOREMS:",
                    "content": "Markov and Chebyshev inequalities, Weak Law of Large Numbers, Convergence in probability, Central Limit Theorem, Strong Law of Large Numbers. \t\t(5+3)"
                },
                {
                    "title": "SAMPLE AND POPULATION:",
                    "content": "Sample mean, confidence interval construction, estimating the variance of the sample mean, confidence intervals for population means, standard error estimates.\t(6+4)"
                },
                {
                    "title": "SIGNIFICANCE OF EVIDENCE:",
                    "content": "Significance, p-values, comparing the mean of two populations, other useful tests of significance                                                                                                                                                                          (6+4)"
                },
                {
                    "title": "INFERRING PROBABILITY MODELS FROM DATA:",
                    "content": "Estimating model parameters with Maximum Likelihood, incorporating priors with Bayesian inference, Bayesian inference for Normal distributions.\t(6+4)"
                },
                {
                    "title": "REGRESSION:",
                    "content": "Regression to make predictions, to spot trends, linear regression and least squares, Producing Good Linear Regressions.\t\t(4+3)"
                }
            ],
            "textbooks": [
                "1.\tDimitri Bertsekas, John Tsitsiklis “Introduction to Probability”, Athena Scientific, 2008.",
                "2.\tDavid Forsyth, “Probability and Statistics for Computer Science”, Springer, 2018.",
                "3.\tMichael J Evans, Jeffrey S Rosenthal, “Probability and Statistics : The Science of Uncertainty”, W. H. Freeman, 2009."
            ]
        },
        {
            "code": "20XW32",
            "title": "DATABASE MANAGEMENT SYSTEM",
            "semester": 3,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "BASIC CONCEPTS:",
                    "content": "Introduction to databases – Conventional file processing – Purpose of database system – Characteristics of database approach – Advantages of using DBMS – Database concept and architecture – Data Abstraction – Data Models – Instances and Schema – Data Independence – Schema Architecture – Components of a DBMS.\t\t\t    (7)"
                },
                {
                    "title": "DATA MODELING:",
                    "content": "Introduction – Data associations – Entities, attributes, relationships – Type role and structural constraints – Weak and Strong entity types – Design of Entity Relationship data models (ERD) – Generalization – Aggregation – Conversion of ERD into tables – Applications – Introduction to Network data model and Hierarchical data model.\t\t\t   (7)"
                },
                {
                    "title": "FILE ORGANIZATION:",
                    "content": "Storage device characteristics – Constituents of a file – Operations on file – Serial files – Sequential files – Index sequential files – Direct files – Primary and Secondary Key Retrieval – Types of indexes - Indexing using Tree Structures.   \t\t\t\t\t\t\t\t\t\t\t (6)"
                },
                {
                    "title": "RELATIONAL MODEL:",
                    "content": "Introduction to Relational Data Model – Basic concepts – Enforcing Data Integrity constraints – Relational Algebra Operations – Extended Relational Algebra Operations \t\t\t\t\t(3)"
                },
                {
                    "title": "RELATIONAL DATABASE MANIPULATION:",
                    "content": "Introduction to Structured Query Language (SQL) – SQL Commands for  defining Database, Constructing database,  Manipulations on database – Basic data retrieval operations – Advanced Queries in SQL – Functions in SQL – Aggregation – Categorization – Updates in SQL – Views in SQL –– PL/SQL Basics – Procedures – Functions – Triggers.\t\t\t                                                                                                               (9)"
                },
                {
                    "title": "DATA BASE DESIGN THEORY:",
                    "content": "Data base design process – Relational Database Design – Relation Schema – Anomalies in a database – Functional dependencies – Axioms – Normal forms based on primary keys – Second Normal form, Third Normal form, Boyce – Codd Normal form – Examples – Multi-valued dependencies  – Fourth Normal form – Reduction of an E-R schema to Tables – Practical database design tuning.\t\t\t\t\t\t\t(6)"
                },
                {
                    "title": "TRANSACTION PROCESSING AND CONCURRENCY CONTROL:",
                    "content": "Transactions, Locking techniques, Concurrent access, Deadlock handling                                                                                                                                                               (3)"
                },
                {
                    "title": "DATABASE SECURITY, INTEGRITY CONTROL:",
                    "content": "Security and Integrity threats – Defense mechanisms – Discretionary Access Control and Mandatory Access Control. \t                                                                                                                (4)"
                }
            ],
            "textbooks": [
                "1.\tElmasri R and Navathe SB, “Fundamentals of Database Systems”, Pearson Education, 2016.",
                "2.\tSilberschatz A, Korth H and Sudarshan S, “Database System Concepts”, McGraw Hill, 2019"
            ]
        },
        {
            "code": "20XW33",
            "title": "TRANSFORM TECHNIQUES",
            "semester": 3,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "TRANSFORM METHODS:",
                    "content": "Basic waveforms and their properties, Operational calculus, concept of transformation, integral transforms, kernel of a transform, examples of transforms, linearity property.\t\t\t\t\t(2+1)"
                },
                {
                    "title": "LAPLACE TRANSFORM:",
                    "content": "Definition – Transforms of standard functions – Transform of unit step function – Dirac -Delta function- Transforms of derivatives and integrals – Transforms of Periodic functions – Inverse Laplace transform – Convolution theorem – Solving ordinary linear differential equations with constant coefficient by Laplace transform technique. Transfer functions, applications to linear systems. \t\t\t\t(12+7)"
                },
                {
                    "title": "FOURIER SERIES:",
                    "content": "Dirichlet’s conditions, statement of Fourier theorem, Fourier coefficients, change of scale, Even and odd functions, Half-range sine and cosine series, RMS value, Parseval’s theorem, Applications to signals and systems.     \t(4+2)"
                },
                {
                    "title": "FOURIER TRANSFORM:",
                    "content": "Fourier integrals – Fourier transform – Infinite Fourier sine and Cosine transform – Transforms of standard functions – properties, Convolution theorem (Concept &Statement) – relation with Laplace transform. \t                 (7+5)"
                },
                {
                    "title": "DISCRETE FOURIER TRANSFORM:",
                    "content": "Discrete convolution – Periodic sequence and circular convolution –Decimation- in-time and decimation-in-frequency algorithms – Computation of inverse DFT.\t(6+4)"
                },
                {
                    "title": "Z-TRANSFORM:",
                    "content": "Z - transform of standard functions, inverse Z-transform – properties of Z – transform – Difference equations – Modeling, Solution of difference equations.                                                                                                                                      (7+5)"
                },
                {
                    "title": "WAVELET TRANSFORM:",
                    "content": "Continuous wavelet transform, admissibility condition, Haar-wavelet, Mexican-hat-wavelet, Morlet-wavelet - Convolution - Inverse transform - Comparison with Fourier transform. Application – detection of signal changes.                       (8+5)"
                }
            ],
            "textbooks": [
                "1.\tAnthony Croft, Robert Davison, Martin Hargreaves, “Engineering Mathematics - A Foundation for Electronic, Electrical, Communications & Systems Engineers”, Pearson Education, 2013.",
                "2.\tHans-Georg Stark, Wavelets and Signal Processing, Springer, 2009."
            ]
        },
        {
            "code": "20XW34",
            "title": "DESIGN AND ANALYSIS OF ALGORITHMS",
            "semester": 3,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Review of analysis of algorithms – Average case time complexity - Analysis of recursive algorithms- Master’s Theorem.                                                                                                                                \t\t\t\t    (5)"
                },
                {
                    "title": "AVL TREES:",
                    "content": "Height Properties – Searching – Insertion and deletion of elements  – Analysis.                                  \t   (4)"
                },
                {
                    "title": "SPLAY TREES:",
                    "content": "Searching - Insertion and deletion of elements -  Amortized analysis.                                    \t\t   (3)"
                },
                {
                    "title": "MULTIWAY SEARCH TREES:",
                    "content": "Indexed Sequential Access – M-way search trees – B-Tree – searching, insertion and deletion – B+Tree – Insertion and deletion.                                                                                                     \t\t\t   (5)"
                },
                {
                    "title": "DIVIDE AND CONQUER:",
                    "content": "Method –  Merge sort, Quick sort, Binary Search – Large integer multiplication-Strassen’s matrix multiplication.                                                                                                                                                      \t\t   (5)"
                },
                {
                    "title": "GREEDY METHOD:",
                    "content": "Optimization problems – Method – examples – Minimum cost spanning tree (Kruskal’s and prim’s algorithms), Topological sorting and Huffman codes.                                                                                            \t           (5)"
                },
                {
                    "title": "DYNAMIC PROGRAMMING:",
                    "content": "Method – All pairs shortest path problem – longest common subsequence problem-Traveling salesman problem.\t\t\t\t\t\t\t\t\t\t\t  (5)"
                },
                {
                    "title": "NP AND COMPUTATIONAL INTRACTABILITY:",
                    "content": "Basic concepts – Polynomial time reductions, efficient certification and NP, NP hard and NP complete problems                                                                                                           \t\t   (5)"
                },
                {
                    "title": "BACK TRACKING:",
                    "content": "Method – N-queen’s problem –Graph coloring-Hamiltonian Cycles.                                 \t\t   (4)"
                },
                {
                    "title": "BRANCH & BOUND:",
                    "content": "Method –  0/1 Knapsack,problem -  Traveling Salesman problem.       \t\t                   (4)"
                }
            ],
            "textbooks": [
                "1.\tThomas H. Cormen, Charles E Leiserson and Ronald L Rivest, “Introduction to Algorithms”, MIT Press, 2015.",
                "2.\tAlfred V Aho, John E Hopcraft, Jeffrey D Ullman, ”Data structures and Algorithms”, Pearson Education,2009."
            ]
        },
        {
            "code": "20XW35",
            "title": "MICROPROCESSOR AND EMBEDDED SYSTEMS",
            "semester": 3,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION TO MICROPROCESSORS:",
                    "content": "Evolution of Microprocessors - Microprocessor based systems - Advantages and limitations.\t\t\t\t\t\t\t\t\t                                            (4)"
                },
                {
                    "title": "INTEL 8086/88 PROCESSOR:",
                    "content": "Block diagram of 8086 - Addressing modes – Instruction format - Instructions - assembler directives – Construction of Machine code.\t\t\t\t                                                                                            (5)"
                },
                {
                    "title": "ASSEMBLY LANGUAGE PROGRAMMING:",
                    "content": "Programs for multi precision addition, subtraction-block moves-array processing-string processing-procedures and macros.\t\t\t\t\t                                                                            (5)"
                },
                {
                    "title": "8086 INTERRUPT SYSTEMS:",
                    "content": "Advantages and disadvantages of interrupts - Interrupt systems of 80x86 processors – Programmable Interrupt Controller, INT 21H.\t\t\t\t\t\t(4)"
                },
                {
                    "title": "PENTIUM PROCESSOR:",
                    "content": "Special Pentium Registers – Super scalar Architecture – Pipelining – Branch Prediction.                        (5)"
                },
                {
                    "title": "INTRODUCTION TO EMBEDDED SYSTEMS:",
                    "content": "Definition – Examples of Applications – Important characteristics of these applications – real-time system and definitions – real –time system – Common misconceptions – Overview of science of real-time systems and examples of research problems.                                                                              \t\t\t(6)"
                },
                {
                    "title": "HARDWARE FUNDAMENTALS:",
                    "content": "Microprocessors –Programmable Array Logic (PAL) – Application Specific Integrated Circuit (ASIC) – Watch dog Timer.          \t\t\t\t\t\t\t\t\t(4)"
                },
                {
                    "title": "EMBEDDED SYSTEM INTERRUPTS:",
                    "content": "Saving and Restoring the content - The Shared–data Problem – Shared–Data bug – Solving Atomic and Critical sections – Interrupt Latency.                                         \t\t\t\t                           (6)"
                },
                {
                    "title": "EMBEDDED SOFTWARE ARCHITECTURE:",
                    "content": "Round – Robin with interrupts, Example – characteristics – Function- Queue- Scheduling Architecture – Real Time Operating System Architecture.\t\t\t\t\t\t           (6)"
                }
            ],
            "textbooks": [
                "1.\tBarry B Brey, \"The Intel Microprocessors - 8086/88, and 80186, 80286, 80386, and 80486\", Prentice Hall,2009.",
                "2.\tDouglus V Hall, \"Microprocessors and Interfacing\", Tata McGraw Hill, 2010.",
                "3.\tDavid E Simon, “An Embedded Software Primer “, Pearson Education, 2002.",
                "4.\tPeter C Dibble, “Real –Time Java Platform Programming”, Books Surge, 2008."
            ]
        },
        {
            "code": "20XW36",
            "title": "DESIGN AND ANALYSIS OF ALGORITHMS LAB",
            "semester": 3,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "Implementation of the following problems:",
                    "content": "1.\tAVLtree including Rotations.\n                2.\tSplay trees including rotations.\n                3.\tImplementation of B Trees.\n                4.\tDivide and Conquer versions of Merge sort, Quick sort and binary search.\n                5.\tGreedy method implementation of Minimum cost spanning tree (Prim’s & Kruskal).\n                6.\tDynamic Programming implementation of Traveling Salesperson problem.\n                7.\tEight queen's problem, graph colouring application using backtracking.\n                8.\t0/1 knapsack and traveling salesman problem using branch and bound."
                }
            ]
        },
        {
            "code": "20XW37",
            "title": "EMBEDDED SYSTEMS LAB",
            "semester": 3,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "Implement the following for assembly language programming:",
                    "content": "1.\tStudy of Assembler (Turbo) and Assembler Directives. \n\n                2.Study of INT 21H functions for input and output. \n                \n                3.Multi-precision addition and subtraction. \n                \n                4.Packing and unpacking of BCD digits. \n                \n                5.Conversion of BCD numbers into ASCII characters and vice versa. \n                \n                6.Delay loop implementation. \n                \n                7.Arrangement of numbers in ascending and descending order. \n                \n                8.Checking whether a given character string is a PALINDROME. \n                \n                9.Usage of MACROS - Examples. \n                \n                10.BCD to Binary conversion and vice versa. \n                \n                11.To check whether a given string is a substring of another. \n                \n                12.Implementation of LEFT(), RIGHT(), SUBSTR() functions. \n                \n                13.To display the contents of the given memory locations. \n                \n                14.Encryption and decryption of a message. \n                \n                15.To find the Minimum and the Maximum number of a given array.\nImplement the following for assembly language programming: \n                1.Study of ARM evaluation system \n\n                2.Interfacing ADC and DAC. \n\n                3.Interfacing LED and PWM. \n\n                4.Interfacing real time clock and serial port. \n\n                5.Interfacing keyboard and LCD. \n\n                6.Interfacing EPROM and interrupt. \n\n                7.Mailbox. \n\n                8.Interrupt performance characteristics of ARM and FPGA. \n\n                9.Flashing of LEDS. \n\n                10.Interfacing stepper motor and temperature sensor. \n\n                11.Implementing zigbee protocol with ARM."
                }
            ]
        },
        {
            "code": "20XW38",
            "title": "RDBMS LAB",
            "semester": 3,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "Implementation of the following problems:",
                    "content": "1.\tWorking with DDL and DML commands of SQL for creation and manipulation of single, multiple tables.\n                2.\tWorking with Triggers and stored procedures.\n                3.\tDeveloping a Package using a database."
                }
            ]
        },
        {
            "code": "20XW41",
            "title": "ACCOUNTING AND FINANCIAL MANAGEMENT",
            "semester": 4,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "COST ACCOUNTING:",
                    "content": "Cost classification -  significance of overhead Cost - Preparation of Cost sheet - Concept of cost volume profit analysis - Concept of variance - Principles of Job Costing, batch costing and Process costing - Operating Costing - Modern techniques/concepts of Cost Control/ Cost Management.\t\t\t\t\t\t\t(14)"
                },
                {
                    "title": "FINANCIAL ACCOUNTING:",
                    "content": "Double Entry Book  keeping concepts - Journalisation of Business  Transactions - Subsidiary Books - Preparation of Profit and Loss Account  and  Balance  sheet from Trial balance - Simple problems - Methods of depreciation.(16)"
                },
                {
                    "title": "FINANCIAL RATIO ANALYSIS:",
                    "content": "Uses and Nature - preparation of Liquidity Ratios - coverage Ratios and profitability Ratios from profit & Loss Account and Balance sheet - common size Income statement and common size Balance sheet.\t\t(11)"
                },
                {
                    "title": "GOALS AND FUNCTIONS OF FINANCIAL MANAGEMENT:",
                    "content": "Finance function - Importance of Corporation finance - objectives of Financial Management - organization of the finance function - concept of time value of money.\t\t\t(6)"
                },
                {
                    "title": "PRINCIPLES OF CAPTIAL BUDGETING:",
                    "content": "Kinds of capital Budgeting Decisions - Evaluation of proposals from the given cash inflows - Net present value versus Internal rate of return method problems.\t\t\t\t\t(6)"
                },
                {
                    "title": "WORKING CAPITAL MANAGEMENT:",
                    "content": "Definition  and  importance of working capital - factors affecting working capital - Inventory management - simple problems - Receivables Management - cash Budget Preparation - Estimate  of  overall  working  capital requirements - Various sources of  financing .       \t\t\t\t\t\t\t\t(7)"
                }
            ],
            "textbooks": [
                "1.\tKhan M Y, Jain P K, \"Cost Accounting and Financial Management\", Tata McGraw Hill,2008.",
                "2.\tGupta R L,RadhaswamyM, \"Advanced Accountancy\", Sultan Chand & Sons, 2009."
            ]
        },
        {
            "code": "20XW42",
            "title": "COMPUTER NETWORKS AND TCP/IP",
            "semester": 4,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "Introduction:",
                    "content": "Network goals - Applications of Networks - Design issues for the layers - OSI Reference Model - Types of Network - Network Topologies- Analog and Digital  data transmission- Data encoding- Bandwidth and data rate-.Bit Rate, Baud Rate\t\t      (5)"
                },
                {
                    "title": "DATA COMMUNICATION:",
                    "content": "Multiplexing - Synchronous and Asynchronous TDM – FDM –CDM - Switching, Circuit Switching, Packet Switching   Transmission of Digital Data: Transmission Impairments - Single and Multiple bit error correction-Error Detection and Correction - Cyclic Redundancy Check Code - Hamming Code                                                                                 (6)"
                },
                {
                    "title": "Data Link Control and Protocols:",
                    "content": "Line Discipline - Flow Control - Sliding Window Protocol -Random Access protocols- Ethernet – Fast Ethernet – Gigabit Ethernet – Wireless LANs- Internetworking- LAN -LAN Connections – Repeaters- Hubs - Bridge – Spanning tree-Switches – Routers.        \t\t\t\t\t\t\t                          (8)"
                },
                {
                    "title": "IP:",
                    "content": "TCP/IP Protocol Structure - Internet Protocol – IP addressing- ARP –ICMP ROUTING: Distance vector routing - Link state Routing – RIP – OSPF\t          (8)"
                },
                {
                    "title": "TRANSPORT LAYER:",
                    "content": "- TCP concepts - Port number - UDP – TCP-Congestion control- Quality of services\t          (9)"
                },
                {
                    "title": "Applications:",
                    "content": "DHCP, SNMP, SMTP - MIME , DNS, HTTP\t          (9)"
                }
            ],
            "textbooks": [
                "1.\tBehrouz A Forouzan, “Data Communications and Networking”, Tata McGraw Hill, 2012",
                "2.\tBehrouz A Forouzan, “TCP/ IP Protocol Suite”, Tata McGraw Hill, 2010."
            ]
        },
        {
            "code": "20XW43",
            "title": "OPERATIONS RESEARCH",
            "semester": 4,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "LINEAR PROGRAMMING:",
                    "content": "Introduction to Operations Research – Modeling with linear programming - Graphical method for two dimensional problems – Simplex Algorithm – Two Phase Simplex Method – Special cases of Simplex Method – Sensitivity analysis - Revised Simplex Method.                                                                                                                                                                   (14)"
                },
                {
                    "title": "SIMPLEX MULTIPLIERS :",
                    "content": "Dual and Primal – Dual Simplex Method – Post Optimal Analysis – Transportation problem and its solution – Assignment problem and its solution by Hungarian method. \t\t\t\t\t\t         (12)"
                },
                {
                    "title": "DECISION THEORY:",
                    "content": "Decision  Analysis – Decision making under certainty, uncertainty and risk.                                                   (6)"
                },
                {
                    "title": "NON LINEAR PROGRAMMING (UNCONSTRAINED OPTIMIZATION):",
                    "content": "Introduction – Random search method – Univariate method – Pattern search methods – Hooke and Jeeves method – Indirect Search Methods – steepest descent method – Conjugate gradient method. \t\t\t\t\t\t              (14)"
                },
                {
                    "title": "DYNAMIC PROGRAMMING:",
                    "content": "Introduction – multistage decision processes – Principles of optimality – Computation procedures.                     \t\t\t\t\t\t\t\t\t\t                                            (8)"
                },
                {
                    "title": "CPM AND PERT:",
                    "content": "Critical path network model – CPM computations – PERT calculations.                                                               (6)"
                }
            ],
            "textbooks": [
                "1.\tHamdy A Taha, “Operations Research – An introduction”, Pearson, 2016",
                "2.\tHillier and Lieberman, “Introduction to Operations Research”, McGraw Hill,  2017."
            ]
        },
        {
            "code": "20XW44",
            "title": "SOFTWARE ENGINEERING TECHNIQUES",
            "semester": 4,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Software application domains – Nature of software - Why Software engineering – problems and challenges. \t\t\t\t\t\t\t\t\t    (3)"
                },
                {
                    "title": "MODELING THE PROCESS AND LIFE CYCLE:",
                    "content": "Software methodologies – Software lifecycle – Project Management - Software Teams – Unified process – Agile development – Capability Maturity Model.     (3)"
                },
                {
                    "title": "PLANNING AND MANAGNG THE PROJECT:",
                    "content": "Software Estimation and Measurement.                         (3)"
                },
                {
                    "title": "UNDERSTANDING REQUIREMENTS:",
                    "content": "Requirements gathering – Use Cases – Software Requirement Specification.\t (3)"
                },
                {
                    "title": "REQUIREMENTS MODELING:",
                    "content": "Scenarios – Data modeling – Class-based modeling – Flow-oriented modeling – Behavioral model. \t\t\t\t\t\t\t\t\t(5)"
                },
                {
                    "title": "DESIGNING THE SYSTEM:",
                    "content": "Design concepts – Architectural design – Pattern-based design - User Interface design – Component-level design.\t\t\t\t\t\t\t(6)"
                },
                {
                    "title": "QUALITY MANAGEMENT:",
                    "content": "Quality concepts – Review techniques – Software quality assurance – Six Sigma.\t\t (5)"
                },
                {
                    "title": "SYSTEM TESTING:",
                    "content": "Unit testing – Integration testing - Test Cases – Debugging – Test-driven Development. \t    (5)"
                },
                {
                    "title": "DELIVERING THE SYSTEM:",
                    "content": "Deployment - Software Reuse strategies – Maintenance – Software configuration management.\t\t\t\t\t\t\t\t\t  (5)"
                },
                {
                    "title": "UML MODELING:",
                    "content": "Business Modeling workflow – Requirements workflow - Use Case diagrams - Analysis workflow – Analysis classes – Sequence diagrams – Collaboration diagrams - Design workflow – Class diagrams - State diagrams – Object diagrams – Component diagrams - Deployment workflow – Deployment diagram – Static vs. Dynamic modeling.\t\t\t\t (7)"
                },
                {
                    "title": "TEXTBOOKS:",
                    "content": "1.\tRoger S Pressman, Bruce R Maxim, “Software Engineering: A Practitioner’s Approach”, McGraw Hill, 2019.\n            2.\tShari Lawrence Pfleeger, Joanne M Atlee, “Software Engineering: Theory and Practice”, Pearson, 2011.\n            3.\tCraig Larman, “Applying UML and Patterns: An Introduction to Object-Oriented Analysis and Design and Iterative Development”, PHI Learning, 2004.   \nREFERENCES:\n                1.\tIan Sommerville, “Software Engineering”, Pearson Education, 2016."
                }
            ]
        },
        {
            "code": "20XW45",
            "title": "OPERATING SYSTEMS",
            "semester": 4,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Abstract view of an operating system - Operating Systems Objectives and Functions – Evolution of Operating Systems - Dual-mode operation - System calls- Structure of Operating System. \t(3)"
                },
                {
                    "title": "PROCESS DESCRIPTION AND CONTROL:",
                    "content": "Process concepts - Process Creation – Process Termination - Process states - Process Description – Process Control. \t (3)"
                },
                {
                    "title": "PROCESS AND THREADS:",
                    "content": "Relationship between process and threads – Thread States – Thread Synchronization – Types of Thread – Multithreading model. \t(4)"
                },
                {
                    "title": "PROCESS SCHEDULING:",
                    "content": "Scheduling basics - CPU-I/O interleaving- (non-)preemption - context switching- Types of Scheduling – Scheduling Criteria - Scheduling Algorithms – Algorithm evaluation – Real-time scheduling.                                     \t(5)"
                },
                {
                    "title": "PROCESS SYNCHRONIZATION:",
                    "content": "Concurrent Process – Principles of Concurrency – Race Condition - Mutual Exclusion – Critical section problems – Software support – Hardware Support – Operating System Support: Semaphore, Monitor – Classical problems of synchronization – Synchronization examples.(4)"
                },
                {
                    "title": "DEADLOCK:",
                    "content": "Principles- Characterization – Methods for handling deadlock - Deadlock prevention, Avoidance, Detection, and recovery. \t(4)"
                },
                {
                    "title": "MEMORY MANAGEMENT:",
                    "content": "Memory hierarchy –Memory Management requirements - Memory partitioning: Fixed partitioning, Dynamic partitioning, Buddy systems – Simple paging – Page table structures – Simple Segmentation – segmentation and paging.\t(6)"
                },
                {
                    "title": "VIRTUAL MEMORY MANAGEMENT:",
                    "content": "Need for Virtual Memory management – Demand Paging –Copy on write -Page Fault handling - Page replacement - Frame allocation- Thrashing - working set model.\t(5)"
                },
                {
                    "title": "I/O MANAGEMENT AND DISK SCULING:",
                    "content": "Organization of I/O function – Evolution of I/O function – Types of I/O devices – Logical Structure of I/O functions – I/O Buffering – Disk I/O – Disk Scheduling algorithms – RAID - Disk Cache.\t(4)"
                },
                {
                    "title": "FILE SYSTEM MANAGEMENT:",
                    "content": "Files – Access methods - File system architecture – Functions of file management –Directory and disk structure -Mounting - File sharing –File system implementation – Directory implementation - File Allocation – Free space management.\t(4)"
                },
                {
                    "title": "VIRTUALIZATION:",
                    "content": "Requirements for Virtualization - Type 1, Type 2 Hypervisors – Paravirtualization - Memory Virtualization - I/O Virtualization - Virtual machines on Multicore CPUs–Virtualization in Multiprocessor environment. (3)"
                }
            ],
            "textbooks": [
                "1.\tSilberschatz A, Galvin, PB. and Gagne, G. “Operating System Concepts”, John Wiley & Sons, Inc.,2018.",
                "2.\tWilliam Stallings, “Operating Systems: Internals and Design Principles”, Pearson Education, 2017.",
                "3.\tAndrew S Tanenbaum, \"Modern Operating System\", Prentice Hall,2018."
            ]
        },
        {
            "code": "20XW46",
            "title": "COMPUTER NETWORKS AND TCP/IP LAB",
            "semester": 4,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XW47",
            "title": "MATHEMATICAL COMPUTING LAB (WITH R)",
            "semester": 4,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XW48",
            "title": "WEB DESIGNING LAB",
            "semester": 4,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "WWW – presentation / business logic layer-Browser architecture – HTTP architecture, Methods, Web Server Architecture."
                },
                {
                    "title": "HTML:",
                    "content": "Basic Structure – HTML tags – Tables – Forms – Links – Frames – DOM – Styling Tags."
                },
                {
                    "title": "CSS:",
                    "content": "Introduction – Types (Where to place CSS) – Rules – Selectors – Styling Fonts – Layouts – Positioning – Boot Strap."
                },
                {
                    "title": "JavaScript:",
                    "content": "Scripting Languages – Syntax – Variables – Data Types – Operators – Expressions – Conditional Statements – Loops  – Arrays – Functions – Event Handling – Enhancing HTML Documents with JavaScript - AngularJS"
                },
                {
                    "title": "PHP:",
                    "content": "of PHP – Basic Syntax – Variables – Constants – Data Types – Operator – Expression – Form Processing – Looping – Functions – Arrays – Strings – PHP Global Array - Sessions – Cookies - NoeJS"
                },
                {
                    "title": "WEB PUBLISHING / HOSTING:",
                    "content": "Host Registration – Domain Registering – Server FTP Upload – AJAX – JSON - MySQL"
                }
            ],
            "textbooks": [
                "1.\tElizabeth Castro and Bruce Hyslop, “Visual Quickstart Guide: HTML5 and CSS3“, Peachpit Press, 2013.",
                "2.\tDavid Flanagan, ”JavaScript: The Definitive Guide”, O'Reilly Media, 2011."
            ]
        },
        {
            "code": "20XW51",
            "title": "UNIX ARCHITECTURE AND PROGRAMMING",
            "semester": 5,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION TO UNIX :",
                    "content": "File System – Essential Commands – Directory and File Commands - General Purpose Utilities - Bourne Shell – Shell Wild Cards – Simple Filters – Regular Expressions – Grep Family - Advanced filters – sed, awk- Process - Communication and Scheduling.\t\t\t\t\t\t\t\t\t(8)"
                },
                {
                    "title": "PROGRAMMING WITH SHELL:",
                    "content": "Shell Scripts – Command Line Arguments, Positional Parameters – Decision Making and Looping Constructs – Redirection – File System Architecture.\t\t\t\t\t\t\t(6)"
                },
                {
                    "title": "FILE SYSTEM STRUCTURE:",
                    "content": "Kernel architecture - Kernel data structure - Buffer Cache - Structure of Buffer pool - Scenarios for buffer retrieval - Reading and Writing disk blocks - Advantages and Disadvantages of buffer cache - Inode - Structure of regular file - Conversion of a pathname to an inode - Inode assignment to a new file - Allocation of disk blocks.                                     (15)"
                },
                {
                    "title": "PROCESS SYSTEM :",
                    "content": "Process states and transitions - Context of a process - Saving the context of a process - Manipulating Process address space - Process creation and termination – Signals – Awaiting Process Termination - System Boot and INIT process - Process Scheduling – Functions of a Clock Interrupt Handler.\t\t\t\t\t\t(10)"
                },
                {
                    "title": "MEMORY MANAGEMENT:",
                    "content": "Swapping - Allocation of swap space – Swapping Processes Out – Swapping Processes in - Demand Paging - Data structures of demand paging - Page stealer Process - Page faults. \t\t\t\t\t(6)"
                },
                {
                    "title": "Total L: 45",
                    "content": "1.\tTEXT BOOKS:\n            2.\tSumitabha Das, \"Unix System V.4 - Concepts and Applications\", Tata McGraw Hill, 2014.\n            3.\tMaurice J Bach, \"Design of the UNIX Operating System\", Pearson, 2015.\nREFERENCES:\t\n                1.\tSumitabha Das, “Your Unix the Ultimate Guide “, Tata McGraw Hill, 2012.\n                2.\tRichard F Gilberg, Behrouz A Forouzan, “Unix and Shell Programming - A Text Book”, Cengage Learning India Private Limited, 2016.\n                3.\tUreshVahalia, \"UNIX Internals: The New Frontiers\", Pearson Education, 2011.\n                4.\tKeith Haviland, Dina Gray, “Unix System Programming”, Addison Wesley, 2007."
                }
            ]
        },
        {
            "code": "20XW52",
            "title": "JAVA PROGRAMMING",
            "semester": 5,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "Java Programming:",
                    "content": "Introduction - Data Types -  Operators -  Declarations - Control Structures - Arrays and Strings - Input/Output.-Java Classes - Fundamentals - Methods - Constructors - Scope rules - this keyword - object based vs oriented programming.- -Inheritance-Reusability - Composing class - Method overloading - Abstract classes - Virtual Functions.                  (8)"
                },
                {
                    "title": "PACKAGES AND INTERFACES:",
                    "content": "Packages - Access protection - Importing packages - Interface - Defining and Implementing Interface - Applying Interface - Variables in Interfaces. \t\t\t\t\t                                            (6)"
                },
                {
                    "title": "EXCEPTION HANDLING:",
                    "content": "Fundamentals - Exception types - Uncaught Exception - Using Try and Catch - Multiple catch clauses - Nested Try statements - Throw - Throws - Java Built-in Exception - Creating your own subclasses.                                                 (6)"
                },
                {
                    "title": "MULTI THREADED PROGRAMMING:",
                    "content": "Java thread model - Priorities - Synchronization - Messaging - Thread class and runnable Interface - Main thread - Creating the Thread - Synchronization - Interthread Communication – Deadlock.                                     (10)"
                },
                {
                    "title": "I/O, APPLETS:",
                    "content": "I/O basics - Stream - Stream Classes - Predefined stream - Reading/Writing console input - Applet fundamentals - Native methods.- GUI Components - Applets - Java Scripts – Swing. \t\t\t                                                            (7)"
                },
                {
                    "title": "NEW FEATURES IN J2SE V5.0:",
                    "content": "Generics – Enhanced for Loop – Autobox – Auto unboxing – Enums – Varargs – Static import – Annotations – Collections Frameworks – List – Vector – Set – Array - Maps\t.\t\t                                            (8)"
                }
            ],
            "textbooks": [
                "1.\tHerbert Schildt, \"JAVA - The Complete Reference\", Tata McGraw Hill, 2016.",
                "2.\tHorstmann, Cornell, “Core Java”, Pearson, 2013.",
                "3."
            ]
        },
        {
            "code": "20XW53",
            "title": "MACHINE LEARNING",
            "semester": 5,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Machine learning – Types – Supervised learning, unsupervised, Reinforcement learning, semi supervised learning -  Regression – Linear – Polynomial – Multiple regression – Evaluation measures – Bias –variance – overfitting – under fitting – Regularization\t\t\t\t\t\t\t\t(10)"
                },
                {
                    "title": "Classification:",
                    "content": "– Linear classification – Logistic regression – linear discriminant analysis – Optimization – Convex set - Convex functions – Convexity checking - Loss functions  for classification and regression - Gradient descent – variants – Perceptron - Support Vector Machines – Linear, Soft margin, Linearly non separable data - Kernel functions                                                                                  (10)"
                },
                {
                    "title": "Neural networks:",
                    "content": "– Multilayer perceptron  - Back propagation – Training – Bayesian Classifier – Decision theory – Maximum A Posteriori estimate –  maximum likelihood estimate - K nearest neighbour classifier\t\t\t(10)"
                },
                {
                    "title": "Decision trees:",
                    "content": "– Introduction – Purity measures – Entropy, cross entropy,  information gain, gain ratio, Gini Index – Regression trees – ID3 – Pruning – Model selection – Bootstrapping and cross validation – Model evaluation – Performance Measures – Receiver operating characteristic curve (ROC) – AUC\t\t\t\t\t\t(8)"
                },
                {
                    "title": "UNSUPERVISED LEARNING:",
                    "content": "– Clustering –Types - K-means – EM - Mixture of Gaussians –Spectral clustering - Cluster validity measures – dimensionality reduction- extraction – PCA (Principal components analysis) - ICA (Independent components analysis)   - Applications : image segmentation – Image compression –Outlier analysis\t                                                                            (7)"
                }
            ],
            "textbooks": [
                "1.\tChristopher M Bishop, “Pattern Recognition and Machine Learning”, Springer, 2016.",
                "2.\tRichard O Duda, Peter E Hart and David G Stork, “Pattern Classification (Digitized)”, John Wiley, 2012."
            ]
        },
        {
            "code": "20XW54",
            "title": "PRINCIPLES OF COMPILER DESIGN",
            "semester": 5,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "SYSTEMS PROGRAMMING:",
                    "content": "Language Processors – Data Structures for Language Processing – Introduction to Assemblers, Macro processors, Interpreters – Linkers and Loaders.\t\t\t\t\t\t\t(7)"
                },
                {
                    "title": "COMPILERS:",
                    "content": "Introduction – phases of compiler – Bootstrapping – Compiler writing tools – FLEX – BISON – JavaCC – PLY.      (2)"
                },
                {
                    "title": "LEXICAL ANALYSIS:",
                    "content": "Role of a lexical analyzer – finite automata –regular expressions to finite automata – minimizing the number of states of a deterministic finite automata – implementation of a lexical analyzer.\t\t\t(6)"
                },
                {
                    "title": "PARSING TECHNIQUES:",
                    "content": "Context free grammars – derivations and parse trees – ambiguity – capabilities of context free grammars. Top down and bottom up parsing – handles – shift reduce parsing – operator precedence parsing – recursive descent parsing – predictive parsing.\t\t\t\t\t\t\t\t\t\t\t(9)"
                },
                {
                    "title": "AUTOMATIC PARSING TECHNIQUES:",
                    "content": "LR parsers – canonical collection of LR (0) items – construction of SLR parsing tables – LR1 sets of items construction – CLR parser – LALR parser.\t(6)"
                },
                {
                    "title": "SYNTAX DIRECTED TRANSLATION AND INTERMEDIATE CODE:",
                    "content": "Semantic actions – Implementation of syntax directed translations – Syntax directed definitions - Postfix notation, Quadruples, triples, indirect triples, Translation of Expressions - control flow – Representing information in a symbol table \t\t\t\t\t\t\t\t(9)"
                },
                {
                    "title": "CODE OPTIMIZATION:",
                    "content": "Basic blocks – DAG representation – error detection and recovery - code generation.                        (6)"
                }
            ],
            "textbooks": [
                "1.  Development of a Lexical Analyzer.",
                "2.  RecursiveDesign and Implementation of a Symbol Table Manager.",
                "3.  RecursiveImplementation of the following Parsing algorithms.",
                "4.  Implementation of a Syntax Directed Translation Engine to",
                "5.    MichaelImplementation of Lexical Analyser using FLEX.",
                "6.    ThomasImplementation of Syntax Analyser using BISON.",
                "7.  Implementation of Lexical Analyser and Syntax Analyser using JavaCC.",
                "8.  Implementation of Lexical Analyser and Syntax Analyser using PLY.",
                "1.\tJohn J Donovan, “Systems Programming”, Tata McGrawHill,2012.",
                "2.\tDhamdhere D M, “Systems Programming”, Tata McGrawHill,2012."
            ]
        },
        {
            "code": "20XW55",
            "title": "PROFESSIONAL ELECTIVE I",
            "semester": 5,
            "course_type": "regular"
        },
        {
            "code": "20XW56",
            "title": "UNIX SHELL AND SYSTEM PROGRAMMING LAB",
            "semester": 5,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "Note:",
                    "content": "Separate Problem Sheets will be provided for Shell and System Calls."
                }
            ]
        },
        {
            "code": "20XW57",
            "title": "JAVA PROGRAMMING  LAB",
            "semester": 5,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XW58",
            "title": "MACHINE LEARNING LAB",
            "semester": 5,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XW61",
            "title": "MOBILE COMPUTING",
            "semester": 6,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Introduction to mobile and wireless devices -  wireless networking, Advantages and disadvantages of wireless networking, Evolution of mobile communication generations- Challenges in mobile computing – Vertical and horizontal mobile applications - Wireless LAN and Wireless WAN.\t\t\t\t\t\t\t\t           (5)"
                },
                {
                    "title": "CELLULAR CONCEPT:",
                    "content": "Wireless transmission - Frequencies  for  radio transmission  -  Regulations -  Signals ,  Antennas , Signal propagation ,Path loss of radio signals , Additional signal propagation effects - Multi-path propagation -  Multiplexing -  Space division multiplexing - Frequency division multiplexing -Time division multiplexing  - Code division multiplexing - Spread spectrum - Direct sequence spread spectrum - Frequency hopping spread spectrum.\t\t\t\t\t(10)"
                },
                {
                    "title": "CELLULAR NETWORK :",
                    "content": "Cellular Concepts – Factors determining  cell size and shape - GSM-Mobile services - System architecture -- Handover – GPRS – Mobile services – System architecture – Location Management strategies – Eager caching Vs lazy caching  - LTE Network architecture and interfaces                                                                                                               (10)"
                },
                {
                    "title": "MOBILE APPLICATIONS ARCHITECTURE:",
                    "content": "Smart Client – Smart Client Architecture – Messaging Architecture – The Model-View-Controller Model-  Delegate Pattern-  Building Smart Client Applications-Design, Development, implementation, testing and deployment phase- MVVM mobile architecture design.                                                                                                                       (6)"
                },
                {
                    "title": "MOBILE APPLICATION DEVELOPMENT:",
                    "content": "Introduction to Android Platform – Android  architecture overview -  Application life cycle -  UI design for Android -  Different types of layouts – Widgets – List view and Adapters  - Dialogs and Toasts – Intent filters -  Files and database – SQLite on Android -  Security model – Comparison with IOS application development -Building cross-platform applications using React Native.\t\t\t\t\t\t\t\t\t         (14)"
                }
            ],
            "textbooks": [
                "1.\tJochen Schiller, “Mobile Communications”, Pearson Education, 2012.",
                "2.\tMartyn Mallick, “Mobile and Wireless Design Essentials”, Wiley, 2003",
                "3.\tBill Philips, Kristin Marsicano and Chris Stewart, “Android Programming : The big Nerd Ranch guide”, O’Reilly, 2017."
            ]
        },
        {
            "code": "20XW62",
            "title": "ARTIFICIAL INTELLIGENCE",
            "semester": 6,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "KNOWLEDGE REPRESENTATION AND REASONING:",
                    "content": "Knowledge representation - Logics - bivalent logic - inference - Fuzzy logic: membership -  Fuzzy rules and reasoning - Fuzzy  inference   (8)"
                },
                {
                    "title": "UNCERTAIN KNOWLEDGE AND PROBABILISTIC REASONING:",
                    "content": "Uncertainty - Probabilistic reasoning - Semantics of Bayesian network - Exact inference in Bayesian network- Approximate inference in Bayesian network - Probabilistic reasoning over time – Inference in temporal models - Hidden Markov Models – Dynamic Bayesian Networks (10)"
                },
                {
                    "title": "DECISION-MAKING:",
                    "content": "Basics of utility theory, Utility functions - Sequential decision problems - Markov decision process - Value iteration - Policy iteration - Decisions in Multi agent system:  Multi agent decision theory - Group decision making         \t(10)"
                }
            ],
            "textbooks": [
                "1.\tStuart Russell and Peter Norvig, “Artificial Intelligence: A Modern Approach”, Pearson Education, 2020.",
                "2.\tDavid Pool and Alan Mackworth, “Artificial Intelligence: Foundations of Computational agents”, Cambridge University Press, 2017.",
                "3.\tTimothy Ross, “ Fuzzy Logic with Engineering Applications”, John Wiley and sons, 2016.",
                "4.\tTsang and Edward, “Foundations of Constraint Satisfaction: The Classic Text”, Academic Press, 2014."
            ]
        },
        {
            "code": "20XW63",
            "title": "SOFTWARE PATTERNS",
            "semester": 6,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO PATTERNS:",
                    "content": "Reusable object oriented software, Motivation, Best design practices of object oriented software, Coupling and Cohesion, Types of Cohesion and Coupling, Benefits of patterns, Definition of a Pattern, Types, Pattern description, Pattern Language, IDIOMS, Framework, Architecture.                                       \t(6)"
                },
                {
                    "title": "DESIGN PATTERNS:",
                    "content": "Creational patterns – Abstract factory, Builder, Factory method, Prototype, Singleton, Structural patterns –  Adapter, Bridge, Composite, Decorator, Façade, Flyweight, Proxy, Behavioral patterns – Command, Interpreter, Iterator, Mediator,  Memento, Observer,  State, Strategy, Template method, Visitor, Chain of Responsibility, Case Studies.(15)"
                },
                {
                    "title": "ARCHITECTURAL PATTERNS:",
                    "content": "From Mud to Structure – Layers, Pipes and Filters, Blackboard, Distributed systems – Broker, Interactive Systems – Model View Controller (MVC), Presentation Abstraction Control, Adaptable Systems – Reflection, Microkernel. Anti-Patterns.\t(13)"
                },
                {
                    "title": "REFACTORING:",
                    "content": "What is refactoring, Principles in refactoring, Bad smells in code, Refactoring Techniques - Composing methods, Moving features between objects, Organizing data, Simplifying conditional expressions, Making method calls simpler, Dealing with generalization. Design Refactoring – Technical Debt, Design Smells, Abstraction Smells, Encapsulation Smells, Modularization Smells, Hierarchy Smells, Architectural Refactoring. Refactoring Tools.\t(11)"
                }
            ],
            "textbooks": [
                "1.\tErich Gamma, Richard Helm, Ralph Johnsons and John Vlissides, “Design Patterns: Elements of Reusable Object-Oriented Software”, Pearson Education, 2009.",
                "2.\tFrank Buschman, RegineMeunier, Hans Rohnert, Peter Sommerlad and Michael Stal, “Pattern-Oriented SoftwareArchitecture: A System of Patterns”, John Wiley, 2011.",
                "3.\tMartin Fowler, Kent Beck, William Opdyke, Don Roberts, “Refactoring: Improving the Design of Existing Code”, Addison-Wesley Longman, 2012."
            ]
        },
        {
            "code": "20XW64",
            "title": "SECURITY IN COMPUTING",
            "semester": 6,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "SECURITY BASICS:",
                    "content": "Overview of security principles –Threats - Attacks - vulnerabilities - Services and Mechanisms - Classical cryptosystem – Symmetric key and Asymmetric key cryptosystem – AES and RSA – Attacks on RSA- Data Integrity - Hashing -  Properties- Digital signatures – DSS algorithm.                                                                                                                                   (7)"
                },
                {
                    "title": "AUTHENTICATION AND ACCESS CONTROL:",
                    "content": "Types of authentication – Challenge response protocol –Fiat Shamir protocol - Zero knowledge protocol – Access control - models                                                                                                                            (4)"
                },
                {
                    "title": "SOFTWARE SECURITY AND TRUSTED SYSTEMS:",
                    "content": "Malicious and non-Malicious programs – Buffer overflows - Fast flux - Covert channels -Defense mechanisms – Operating system security  -Security Policies - Types - Trusted Computing - Trusted OS design  -Virtualization security -containers                                                                                                                                                         (6)"
                },
                {
                    "title": "OPERATING SYSTEM SECURITY :",
                    "content": "Windows security - Understanding User Authentication- Securing Access with Permissions - Unix Security Overview -Achieving Unix Security - Protecting User Accounts and Strengthening Authentication - Limiting Super user Privileges -  Securing Local and Network File Systems - Network Configuration -  Hardening Linux and Unix.                                  (8)"
                },
                {
                    "title": "SECURITY AT NETWORK LAYER:",
                    "content": "Network layer threats and security controls –Security problems in TCP/IP protocol suite – DNS Cache poisoning - IPSec – modes – security protocols – SA – Internet key exchange                                                                       (6)"
                },
                {
                    "title": "ETHICAL HACKING AND PENETRATION TESTING :",
                    "content": "Principles of Intrusion detection – types– Architecture - Intrusion Detection and response - Network penetration testing- reconnaissance – scanning- Exploitation                                                                      (8)"
                },
                {
                    "title": "WEB APPLICATION SECURITY :",
                    "content": "Email security – PGP –– S/MIME – Web Security – Cross site scripting – SQL injection attacks – Defense methods- Session integrity for web applications- SSL Architecture – Secure session management-- Session hijacking  - securing a web server                                                                                                                                                                          (6)"
                }
            ],
            "textbooks": [
                "1.\tRoberta Bragg, Mark Rhodes, Keith Strass Berg J, “Network Security - The complete reference”, Tata McGraw Hill, 2017.",
                "2.\tJohn r. Vacca , “Network and system security”, Syngress Elsevier, 2014.",
                "3.\tPatrick Engebretson  ,David Kennedy , “The Basics of Hackingand Penetration Testing”, Syngress Elseiver, 2013.",
                "4.\t , “Microsoft Windows Security Essentials”, Wiley, 2011.",
                "5.\tBehrouz A. Forouzan, “Cryptography and Network Security”, Tata McGraw Hill, 2010."
            ]
        },
        {
            "code": "20XW65",
            "title": "PROFESSIONAL ELECTIVE II",
            "semester": 6,
            "course_type": "regular"
        },
        {
            "code": "20XW66",
            "title": "MOBILE COMPUTING LAB",
            "semester": 6,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XW67",
            "title": "ARTIFICIAL INTELLIGENCE LAB",
            "semester": 6,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "Note:",
                    "content": "Separate Problem Sheets will be provided."
                }
            ]
        },
        {
            "code": "20XW68",
            "title": "DISTRIBUTED ENTERPRISE COMPUTING LAB",
            "semester": 6,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "DISTRIBUTED MULTI-TIER COMPUTING:",
                    "content": "Introduction – Basis of distributed computing - Centralized vs Distributed systems – Distributed operation system – Single System image – transparencies– decomposition approaches – layers and tiers."
                },
                {
                    "title": "CLIENT/SERVER COMPUTING:",
                    "content": "Approaches to client server computing –enterprise architectural overview - component based software development for enterprise – java enterprise system - operating system services for client – server types – server side scripting – operating system services for server – client and server software requirements"
                },
                {
                    "title": "MIDDLEWARE: Architecture –",
                    "content": "classification of middleware – database middleware – drivers, connection, statements - communication middleware – transaction middleware – isolation – interfacing."
                },
                {
                    "title": "ENTERPRISE WEB COMMUNICATION:",
                    "content": "Java servlets – HTTP Servlet, generic servlets, Java server pages – elements of JSP – JSTL."
                },
                {
                    "title": "MULTI-TIER ENTERPRISE COMPUTING:",
                    "content": "Middleware services – development and deployment -  Enterprise Java Beans – types – lifecycle – entities – POJO – POJI – Java persistent query language  - accessing ejbs using JSP – XML processing APIs"
                },
                {
                    "title": "DISTRIBUTED ENTERPRISE COMMUNICATION:",
                    "content": "RMI – CORBA – DCOM – Java Messaging Service – Message oriented middleware services – publish/subscribe messaging – AJAX – JSON"
                },
                {
                    "title": "JAVA WEB SERVICES:",
                    "content": "Web service standards – Describing and publishing – JAX-WS – SOAP"
                },
                {
                    "title": "DISTRIBUTED ENTERPRISE SYSTEMS:",
                    "content": "Services using EJB: Naming Services, Directory and Trading services, Activation Services, Transaction Services, Security Services"
                },
                {
                    "title": "FRAMEWORKS:",
                    "content": "Struts - Java Server Faces – Spring – Hibernate – Ruby on Rails"
                },
                {
                    "title": "Exercise:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1.\tRobert Orfali, Dan Harkey and Jeri Edwards, “Client / Server survival Guide”, Wiley, 2011.",
                "2.\tRima Patel Sriganesh, Gerald Brose and Micah Silverman, Mastering Enterprise JavaBeans 3.0”, Wiley, 2006.",
                "3.\tRod Johnson, Juergen Hoeller, Alef Arendsen, Thomas Risberg and Colin Sampaleanu, “Professional Java Development with the Spring Framework”, Wiley, 2008."
            ]
        },
        {
            "code": "20XWP1",
            "title": "PROJECT WORK I"
        },
        {
            "code": "20XW81",
            "title": "INFORMATION RETRIEVAL",
            "semester": 8,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Overview of IR Systems - Historical Perspectives - Goals of IR - The impact of the web on IR - The role of artificial intelligence (AI) in IR.                 \t\t\t\t (3)"
                },
                {
                    "title": "TEXT REPRESENTATION:",
                    "content": "Statistical Characteristics of Text: Zipf's law; Porter stemmer; morphology; index term selection; using thesauri. Basic Tokenizing, Indexing:  Simple tokenizing, stop-word removal, and stemming; inverted indices; Data Structure and File Organization for IR - efficient processing with sparse vectors.                \t\t\t\t (6)"
                },
                {
                    "title": "RETRIEVAL MODELS:",
                    "content": "Similarity Measures and Ranking -  Boolean Matching – Extended Boolean models - Ranked retrieval - Vector Space Models -,  text-similarity metrics - TF-IDF (term frequency/inverse document frequency) weighting - cosine similarity, Probabilistic Models, Evaluations on benchmark text collections.     \t\t\t\t (8)"
                },
                {
                    "title": "QUERY PROCESSING:",
                    "content": "Query Operations and Languages- Query expansion; Experimental Evaluation of IR: Performance metrics: recall, precision, and F-measure.    \t\t\t\t\t\t(5)"
                },
                {
                    "title": "TEXT CATEGORIZATION AND CLUSTERING:",
                    "content": "Categorization: Rocchio; Naive Bayes, kNN; Clustering:  Agglomerative clustering; k-means; Expectation Maximization (EM); Dimension Reduction: LSI,         \t\t(6)"
                },
                {
                    "title": "WEB SEARCH:",
                    "content": "IR Systems and the WWW - Search Engines: Spidering, Meta Crawlers and near duplicate pages, Question answering,  Link analysis: Hubs and Authorities, Google PageRank, Duplicate Detection.                                                     (5)"
                },
                {
                    "title": "INFORMATION FILTERING TECHNIQUES:",
                    "content": "introduction to Information Filtering, Relevance Feedback - Applications of Information Filtering: RECOMMENDER SYSTEMS: Collaborative filtering and Content-Based recommendation of documents and products. \t  (6)"
                },
                {
                    "title": "INFORMATION EXTRACTION AND INTEGRATION:",
                    "content": "Extracting data from text; Basic Techniques: Named Entity Recognition, Co-reference Resolution, Relation Extraction, Event Extraction; Extracting and Integrating specialized information on the Web, Web Mining and Its Applications.      \t\t\t\t\t\t\t\t (6)"
                }
            ],
            "textbooks": [
                "1.\tChristopher D. Manning, Prabhakar Raghavan and Hinrich Schütze, “Introduction to Information Retrieval”, Cambridge University Press, 2012.",
                "2.\tStefan Büttcher, Charles L. A. Clarke, Gordon V. Cormack, “ Information Retrieval – Implementing and Evaluating Search Engines “, The MIT Press, 2016",
                "3.\t  B.Croft, D. Metzler, T. Strohman, Information Retrieval in Practice, Pearson Education, 2015. (Digitized)"
            ]
        },
        {
            "code": "20XW82",
            "title": "DATA MINING",
            "semester": 8,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Motivation for Data Mining – Importance – Definition – Kinds of data for  Data Mining – Data Mining functionalities – Patterns – Classification of Data Mining Systems – Major issues in Data Mining-Overview of  Data Mining Techniques.  PREPROCESSING: Types of data, Data cleaning-Smoothing, Handling missing values- Feature subset selection Sampling methods.(10)"
                },
                {
                    "title": "DATA WAREHOUSE and OLAP TECHNOLOGY:",
                    "content": "Overview- Need for Data Warehouse- multidimensional data model-Data Warehouse architecture  -Data warehousing Schemas - Data Warehousing to Data mining    (4)"
                },
                {
                    "title": "MINING FREQUENT PATTERNS, ASSOCIATIONS AND CORRELATIONS:",
                    "content": "Basic concepts – Efficient and Scalable Frequent Itemset Mining methods – Apriori, FP Tree. CLASSIFICATION AND PREDICTION: Overview of Classification techniques –Ensemble Learning-bagging, boosting, cascading, stacking.  CLUSTERING: Hierarchical – Density based(10)"
                },
                {
                    "title": "INCREMENTAL & STREAM DATA MINING:",
                    "content": "Incremental Algorithms for Data Mining, Characteristics of Streaming Data, Issues and Challenges, Streaming Data Mining Algorithms, Any time stream Mining(7)"
                },
                {
                    "title": "Sequence Mining:",
                    "content": "Characteristics of Sequence Data, Problem Modeling, Sequential Pattern Discovery,  Timing Constraints, Applications in Bioinformatics Multivariate Time Series (MVTS) Mining:  Importance of MVTS data - Sources of MVTS data -  Mining MVTS data\t\t\t\t\t\t\t(8)"
                },
                {
                    "title": "APPLICATIONS AND TRENDS IN DATA MINING:",
                    "content": "Spatial Data Mining –Graph Mining- Web Mining –Text Mining.(6)"
                }
            ],
            "textbooks": [
                "1.\tJiawei Han and Micheline Kamber , “Data Mining – Concepts and Techniques”, Morgan Kaufmann  Publishers, 2012.",
                "2.\tTan, Steinbach and Kumar, “Introduction to Data Mining”, Pearson Education, 2014."
            ]
        },
        {
            "code": "20XW83",
            "title": "SOFTWARE PROJECT MANAGEMENT",
            "semester": 8,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "Introduction:",
                    "content": "Software Projects various other types of projects - Problems with software projects - an overview of project planning - Project evaluation - Project Analysis and technical planning - Project estimates - Preparation of Estimates - COCOMO model - Function Point Analysis - Putnam Model - Non-development overheads.    \t\t\t\t         (10)"
                },
                {
                    "title": "Activity planning:",
                    "content": "Project schedules - Sequencing and scheduling projects - Network planning models - Shortening project duration - Identifying critical activities.\t\t\t\t\t\t\t\t\t          (9)"
                },
                {
                    "title": "Risk management:",
                    "content": "Resource allocation - Monitoring and Control - Managing people and organizing teams - Planning for small projects - Handling large projects - Divide and Conquer - Software Project survival.\t\t\t\t           (9)"
                },
                {
                    "title": "Software configuration management:",
                    "content": "Basic functions, responsibilities, standards, configuration Management, Prototyping - Models of prototyping.\t\t\t\t\t\t\t\t\t           (9)"
                },
                {
                    "title": "",
                    "content": "Case study using Project management tools."
                }
            ],
            "textbooks": [
                "1.\tMike Cotterell and Bob Hughes, \"Software Project Management - Inclination\", Tata McGraw Hill, 2017.",
                "2.\tRobert K Wysocki, Robert Beck Jr and David B Crane, \"Effective Project   Management\", John Wiley, 2015."
            ]
        },
        {
            "code": "20XW84",
            "title": "PROFESSIONAL ELECTIVE III",
            "semester": 8,
            "course_type": "regular"
        },
        {
            "code": "20XW85",
            "title": "OPEN ELECTIVE I",
            "semester": 8,
            "course_type": "regular"
        },
        {
            "code": "20XW86",
            "title": "INFORMATION RETRIEVAL LAB",
            "semester": 8,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "EXERCISES",
                    "content": ""
                }
            ]
        },
        {
            "code": "20XW87",
            "title": "DATA MINING LAB",
            "semester": 8,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XW88",
            "title": "CAPSTONE PROJECT LAB",
            "semester": 8,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XW91",
            "title": "COMPUTER VISION AND IMAGE ANALYSIS",
            "semester": 9,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "OVERVIEW:",
                    "content": "Computer Imaging Systems: Image formation and Sensing, Color representation, Image Acquisition, Image digitization, Noise, Image Representation. \t\t\t\t\t\t\t\t(4)"
                },
                {
                    "title": "DIGITAL IMAGE ANALYSIS:",
                    "content": "Preprocessing, Binary Image Analysis, Edge detection - First order derivative, Second order detection, Color edge detection, Pyramid edge detection, Edge linking and boundary detection, Segmentation - Region based segmentation, clustering techniques, boundary detection, thresholding.\t\t\t\t\t\t(8)"
                },
                {
                    "title": "IMAGE ENHANCEMENT:",
                    "content": "Gray-Scale Modification, Image Sharpening, Image Smoothing - Image Restoration - Noise Models, Noise removal using spatial filters, frequency domain filters, Geometric transforms, Image Reconstruction.   \t\t(6)"
                },
                {
                    "title": "IMAGE TRANSFORMS:",
                    "content": "Overview of discrete transforms, Fourier Transform, Discrete Cosine transform, Discrete Haar transform, Principal components transform, Discrete Wavelet Transform, Filtering.\t\t\t\t\t\t           (6)"
                },
                {
                    "title": "IMAGE FEATURE ANALYSIS:",
                    "content": "Overview, Feature Extraction - Shape, histogram, color, spectral, textural features, feature Analysis. Image Compression - Overview, Lossless compression methods, lossy compression methods.    \t\t\t           (5)"
                },
                {
                    "title": "MORPHOLOGICAL OPERATIONS:",
                    "content": "- Binary Dilation, Erosion, Opening and Closing, Hit-or-Miss Transform, Basic Morphological Algorithms, Extension to Gray-Scale Images. \t\t\t\t\t\t\t\t           (4)"
                },
                {
                    "title": "IMAGE COMPRESSION:",
                    "content": "- Basic requirements, Types of compression, Coding Algorithms.  \t\t\t\t           (4)"
                },
                {
                    "title": "APPLICATIONS:",
                    "content": "– CBIR, CBVR, Activity Recognition, computational photography, Biometrics, stitching and document processing; Modern trends - super-resolution; GPU, Augmented Reality; cognitive models, fusion and SR&CS. \t\t\t           (8)"
                }
            ],
            "textbooks": [
                "1.\tUmbaugh, S. E., “Digital image processing and analysis: human and computer vision applications with CVIP tools”, CRC press, 2010.",
                "2.\tNagabhushan S, “Computer Vision and Image Processing”, New Age International, 2005."
            ]
        },
        {
            "code": "20XW92",
            "title": "SOFTWARE TESTING",
            "semester": 9,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "Introduction:",
                    "content": "Need for testing – Psychology of testing – Testing economies – Types of testing – SDLC and testing – VerificationandValidation.  \t\t\t\t\t\t\t\t\t\t(6)"
                },
                {
                    "title": "Developing a Test Approach:",
                    "content": "Defining a software system testing strategy - Developing software system testing tactics - Testing tools – Test Plan and Test Cases.\t\t\t\t\t\t\t\t(4)"
                },
                {
                    "title": "Testing a software using a life cycle methoogy:",
                    "content": "Requirements phase testing - Design phase testing - Program phase testing - Desk debugging and program peer view test tools - Evaluating test results - Installation phase testing - Acceptance testing.\t\t\t\t\t\t\t\t\t\t\t\t(10)"
                },
                {
                    "title": "Testing methodology for software maintenance:",
                    "content": "Testing the correctness of the installing a software change - Testing the validity of a software cost estimate - Testing the progress of the software system - Inspecting test plan and test cases - Software Inspection - Costs and  Benefits - Overview - The Inspection Process.\t\t\t\t\t(8)"
                },
                {
                    "title": "TESTING OBJECT ORIENTED SOFTWARE:",
                    "content": "Challenges – Differences from testing non-OO software – Class testing strategies – class modality – State based testing.\t\t\t\t\t\t\t\t\t(3)"
                },
                {
                    "title": "TESTING METHODLOGIES :",
                    "content": "Testing Rapid Application Development– Testing Adequacy of System Documentation – Testing Web based systems-Testing off the shelf Software – Testing in Multi-platform environment – Testing Security – Testing Data warehouse – Testing Metrics – Evaluating test effectiveness                                              \t\t\t\t\t(10)"
                },
                {
                    "title": "TECHNIQUES FOR AUTOMATING TEST EXECUTION:",
                    "content": "Testing and test automation – Tool support for lifecycle Testing - Common problems of test automation – limitations of automating software testing.\t\t\t\t\t(4)"
                }
            ],
            "textbooks": [
                "1.\tWilliam Perry, \"Effective Methods for Software Testing\", JohnWiley,2019."
            ]
        },
        {
            "code": "20XW93",
            "title": "DEEP LEARNING",
            "semester": 9,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "Introduction:",
                    "content": "– Basic concepts – Convex sets, convex functions – loss functions –   Gradient descent – Variants - Perceptron – Activation functions - Geometric representation – Perceptron Convergence theorem                 \t\t\t           (4)"
                },
                {
                    "title": "A:",
                    "content": "Feed Forward Networks - Multi layer Perceptron – back propagation - Learning XOR – Auto encoder   - Deep neural networks \t\t\t\t\t\t\t\t\t(6)"
                },
                {
                    "title": "Training neural Networks:",
                    "content": "Optimization methods for neural networks - Adagrad, Adadelta, rmsprop, adam, NAG - second order methods for training, Saddle point problem in neural networks, Regularization methods - dropout, batch normalization, Ridge  and Lasso  \t\t                                                                                                                                                                           (10)"
                },
                {
                    "title": "Convolutional networks:",
                    "content": "–structure – properties – Region based CNN - LeNet – Alex net\t                                                            (5)"
                },
                {
                    "title": "Recurrent networks:",
                    "content": "–  Recurrent neural networks(RNN) –  Gated Recurrent unit – Long Short Term Memory - Bidirectional RNNs -  Deep recurrent network – Methodology – Applications\t\t                                                                                            (8)"
                }
            ],
            "textbooks": [
                "1.  Ian Goodfellow, Yoshua Bengio, and Aaron Courville ,,  The MIT Press, 2016.",
                "2.\tYoshua Bengio,  Learning Deep Architectures for AI, Foundations & Trends in Machine Learning, 2009."
            ]
        },
        {
            "code": "20XW94",
            "title": "PROFESSIONAL ELECTIVE IV",
            "semester": 9,
            "course_type": "regular"
        },
        {
            "code": "20XW95",
            "title": "OPEN ELECTIVE II",
            "semester": 9,
            "course_type": "regular"
        },
        {
            "code": "20XW96",
            "title": "DEEP LEARNING LAB",
            "semester": 9,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "20XW97",
            "title": "COMPUTER VISION LAB",
            "semester": 9,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "EXERCISES:",
                    "content": ""
                },
                {
                    "title": "Note:",
                    "content": "Separate Problem Sheets will be provided."
                }
            ]
        },
        {
            "code": "20XW98",
            "title": "FUNCTIONAL PROGRAMMING LAB",
            "semester": 9,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "What is FP – Functional Programming in Scala – Functional data structures – Handling error without exceptions – Strictness and laziness – Purely functional state.."
                },
                {
                    "title": "FUNCTIONAL DESIGN AND COMBINATOIR LIBRARIES:",
                    "content": "Purely functional parallelism – Property-based testing – Parser combinators."
                },
                {
                    "title": "COMMON STRUCTURES IN FUNCTIONAL DESIGN:",
                    "content": "Monoids – Monads – Applicative and traversable functors."
                },
                {
                    "title": "EFFECTS AND I/O:",
                    "content": "External Effects and I/O – Local effects and mutable state – Stream processing and incremental I/O."
                }
            ],
            "textbooks": [
                "1.\tPaul Chiusano, Rúnar Bjarnason, \"Functional Programming in Scala\", Manning Publications,2014.",
                "2.\tAlvin Alexander, “Functional Programming, Simplified”, Createspace Independent, 2017."
            ]
        },
        {
            "code": "20XWP2",
            "title": "PROJECT WORK II"
        },
        {
            "code": "20XWA1",
            "title": "MODELLING AND SIMULATION",
            "course_type": "professional_elective",
            "credits": "3204",
            "content": [
                {
                    "title": "PRINCIPLE OF COMPUTER MODELLING AND SIMULATION:",
                    "content": "Monte Carlo simulation. Nature of computer modeling and simulation.Limitations of simulation, areas of application.\t\t\t\t\t\t\t(3)"
                },
                {
                    "title": "SYSTEM AND ENVIRONMENT:",
                    "content": "Components of a system - discrete and continuous systems. Models of a system - A variety of modelling approaches.\t\t\t\t\t\t\t\t\t\t(4)"
                },
                {
                    "title": "DATA-DRIVEN MODELS:",
                    "content": "Empirical Models-Introduction - Linear Empirical Model- Predictions-Linear Regression - Nonlinear One-Term Model - Multiterm Models - Advanced Fitting with Computational Tools\t\t\t\t\t(4)"
                },
                {
                    "title": "RANDOM NUMBER GENERATION:",
                    "content": "Techniques for generating random numbers - Midsquare method - The midproduct method - Constant multiplier technique - Additive congruential method - Linear congruential method - Tauswarthe method - Tests for random numbers - The Kolmogorov_Smirnov test - The Chi-square test.\t\t\t\t\t\t(5)"
                },
                {
                    "title": "RANDOM VARIABLE GENERATION:",
                    "content": "Inverse transform technique - Exponential distribution - Uniform distribution - Weibull distribution. Empirical continuous distribution - generating approximate normal variates - Erlang distribution. Empirical  Discrete distribution - Discrete Uniform distribution - Poisson distribution - Geometric distribution - Acceptance - Rejection   technique   for   Poisson    distribution - Gamma distribution.                                  \t\t\t\t\t\t(7)"
                },
                {
                    "title": "DESIGN AND EVALUATION OF SIMULATION EXPERIMENTS:",
                    "content": "Input - Output analysis - variance reduction techniques - Antithetic variables - verification and validation of simulation models.\t\t\t\t\t\t\t(5)"
                },
                {
                    "title": "DISCRETE EVENT SIMULATION:",
                    "content": "Concepts in discrete-event simulation, manual simulation using event scheduling, single channel queue, two server queue, simulation of inventory problem.\t\t\t\t\t\t\t(7)"
                },
                {
                    "title": "SIMULATION LANGUAGES:",
                    "content": "- GPSS - SIMSCRIPT - SIMULA - SIMPLE_1, Programming for Discrete event systems in GPSS, SIMPLE_1 and C.\t\t\t\t\t\t\t\t\t\t\t(5)"
                },
                {
                    "title": "CASE STUDIES:",
                    "content": "Simulation of LAN - Manufacturing system - Hospital system.\t\t\t\t\t(5)"
                }
            ],
            "textbooks": [
                "1.\tJerry Banks and John S. Carson, \"Discrete Event System Simulation\", Prentice Hall, 2013.",
                "2.\tAngelaB.ShifletandGeorge W. Shiflet, “ Introduction to Computational Science: Modeling and Simulation for theSciences”, Princeton University Press,  2014"
            ]
        },
        {
            "code": "20XWA2",
            "title": "BIG DATA AND MODERN DATABASE SYSTEMS",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "OBJECT AND SPATIAL DATABASES:",
                    "content": "Object Oriented Databases - Complex data types - Structured types and Inheritance - Query Processing in Object databases - Spatial Databases : Geometric Information System - Spatial Data Types – Spatial Queries - Spatial indexing techniques                   \t\t\t\t\t\t\t\t(6)"
                },
                {
                    "title": "PARALLEL AND DISTRIBUTED DATABASES:",
                    "content": "Architecture of parallel databases – Parallel query evaluation, Parallel query optimization – Distributed DBMS Architecture, Distributed Database Design, Distributed Query Processing    (5)"
                },
                {
                    "title": "DATA MODELING FOR BIG DATA:",
                    "content": "Big Data and Challenges, Big Data models, NoSQL data models, Basic principles of NoSQL models, BASE properties, CAP Theorem, SQL databases Vs NoSQL databases - MAP-REDUCE: Apache Hadoop and HDFS, SPARK \t\t\t\t\t(10)"
                },
                {
                    "title": "NOSQL DATABASES (PART 1):",
                    "content": "Key - Value Stores: Amazon DynamoDB, Key -Value Stores (in-memory) : Redis , Column Oriented Store: Google BigTable , Apache Cassandra -  Hbase.\t\t\t\t(10)"
                },
                {
                    "title": "NOSQL DATABASES (PART 2):",
                    "content": "Document Oriented Stores – MongoDB - Apache CouchDB - Graph databases: Neo4J - OrientDB\t\t\t\t\t\t\t(9)"
                },
                {
                    "title": "DATABASE INTEGRATION:",
                    "content": "Data warehousing, Virtual Data Integration - Schema directed data integration - Schema mapping and information preservation (5)"
                },
                {
                    "title": "PROJECT WORK IN:",
                    "content": "1.  DeterminationORDB, Spatial databases,.Distribution using Map-Reduce on Big Data (Hadoop). \n                2.    BehrouzData Integration from heterogeneous Databases. \n                3.  No-SQL databases- DynamoDB, MongoDB, Cassendra, Neo4J, Redis."
                }
            ],
            "textbooks": [
                "1.\tPramod J. Sadalage and Martin Fowler, “NoSQL Distilled - Brief Guide to the Emerging World of Polyglot Persistence”, Pearson Education, 2013.",
                "2.\tGuy Harrison, “Next generation Databases: NoSQL and BigData”, Apress, 2015.",
                "3.\tKristina Chodorow, “MongoDB: The Definitive Guide”, O’Reilly Media, 2019",
                "4.\tHolden Karau, Andy Konwinski, Patrick Wendell, Matei Zaharia, “Learning Spark: Lightning-Fast Big Data Analysis”, O'Reilly Media, 2015"
            ]
        },
        {
            "code": "20XWA3",
            "title": "SOFTWARE METRICS",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "Fundamentals of Measurement:",
                    "content": "Measurement in Software Engineering-Scope of Software Metrics - Measurement and Models-Measurement scales and scale types-Classifying software measures - Software Measurement validation - Software Metrics Data collection - Analyzing software measurement data.\t\t\t\t\t\t\t(10)"
                },
                {
                    "title": "Measuring internal product attributes:",
                    "content": "Size and Structure - Measuring external product attributes.   (5)"
                },
                {
                    "title": "Software Reliability:",
                    "content": "Measurement and prediction - Parametric Reliability Growth models - The recalibration of software reliability growth predictions.\t\t\t\t\t\t\t\t\t\t(10)"
                },
                {
                    "title": "Resource Measurement:",
                    "content": "Productivity, teams and tools- Making process predictions - Good estimates - Models of effort and cost - Dealing with Problems of current estimation methods.\t\t\t\t\t\t\t(10)"
                },
                {
                    "title": "Measurement and Management:",
                    "content": "Planning - Measurement program - Measurement tools-Measurers - analysts - audience - Measurement in practice.\t\t\t\t\t\t\t\t\t\t(10)"
                }
            ],
            "textbooks": [
                "1.\tNormanE Fenton and Shari Lawrence Pfleeger, \"Software Metrics\", Thomson Brooks/Cole, 2018."
            ]
        },
        {
            "code": "20XWA4",
            "title": "PARALLEL AND DISTRIBUTED COMPUTING",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION :",
                    "content": "Forms of Computing – Monolithic – Distributed – Parallel-Cooperative - Computational demands of parallel processing, Flynn’s classification – Terminology.\t\t\t\t\t\t\t\t(5)"
                },
                {
                    "title": "PARALLEL COMPUTER ARCHITECTURES:",
                    "content": "Classification – Inter connection networks – Vector computers – Shared memory parallel computers – Cache coherence – Distributed shared memory parallel computers – Message passing parallel computers – Cluster of workstations. \t\t\t\t\t\t\t\t\t\t(5)"
                },
                {
                    "title": "PARALLEL PROGRAMMING MODELS:",
                    "content": "Shared memory model, Message passing model - Synchronous and Asynchronous message passing models, Leader-Election algorithm, Breadth-First Search. Shortest Paths, Broadcast and Converge cast, Data Parallel model.\t\t\t\t\t\t\t\t\t\t\t(7)"
                },
                {
                    "title": "PARALLEL ALGORITHMS :",
                    "content": "Models of parallel computation including PRAM - CRCW, CREW, ERCW, EREW models, Design and analysis of Parallel algorithms: : Automatic vs. Manual Parallelization – Understand the Problem and the Program – Partitioning – Communications – Synchronization – Data Dependencies – Load Balancing – Granularity – I/O – Limits and Costs of Parallel Programming – Performance Analysis and Tuning – Parallel Examples – Array Processing Matrix multiplication, Sorting, Searching, Merging, Minimum spanning tree, Prime numbers.\t\t\t\t\t\t\t\t(10)"
                },
                {
                    "title": "DISTRIBUTED PROGRAMMING ALGORITHMS:",
                    "content": "Fundamental issues and concepts - Synchronization, Mutual Exclusion, Termination Detection, Clocks, Event ordering, Locking - Distributed Computing Tools & Technologies  (CORBA, JavaRMI, Web Services).\t\t\t\t\t\t\t\t\t\t\t\t(5)"
                },
                {
                    "title": "EMERGING AREAS OF PARALLEL AND DISTRIBUTED SYSTEMS:",
                    "content": "Grid computing, Peer-to-peer systems, Overlay networks, Edge computing and   Ad-hoc networks.\t\t\t\t\t\t\t\t\t(5)"
                }
            ],
            "textbooks": [
                "1.\tQuinn Michael J, \"Designing Efficient Algorithms for Parallel Computers\", Tata McGraw Hill, 2004.",
                "2.\tWilkinson B and Allen M, “Parallel Programming: Techniques and Applications Using Networked Workstations and Parallel Computers”, Prentice Hall, 2005."
            ]
        },
        {
            "code": "20XWA5",
            "title": "DATA COMPRESSION",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "DATA COMPRESSION LEXICON:",
                    "content": "Introduction to Data Compression - Dawn Age - Coding -  Lossy  Compression.  (4)"
                },
                {
                    "title": "MINIMUM REDUNDANCY CODING (THE DAWN AGE):",
                    "content": "The Shannon - Fano Algorithm, The Huffman Algorithm - Into the Huffman Code : Counting the Symbols, Building the tree\t.\t\t\t\t\t  (5)"
                },
                {
                    "title": "ADAPTIVE HUFFMAN CODING:",
                    "content": "Adaptive Coding - Updating the Huffman Tree \t- Escape code.\t(5)"
                },
                {
                    "title": "ARITHMETIC HUFFMAN CODING:",
                    "content": "Arithmetic Coding  with floating point data type – Arithmetic coding with integral data type.(6)"
                },
                {
                    "title": "STATISTICAL MODELING:",
                    "content": "Higher-order Modeling - Finite Context Modeling – Order one modeling – Order two Modeling. (5)"
                },
                {
                    "title": "SPEECH COMPRESSION:",
                    "content": "Digital Audio Concepts - Lossless Compression of Sound.(5)"
                },
                {
                    "title": "VIDEO COMPRESSION:",
                    "content": "JPEG Compression - Implementing DCT - Complete Code Listing.(5)"
                },
                {
                    "title": "DICTIONARY-BASED COMPRESSION:",
                    "content": "LZ77 Compression  and Decompression - LZSS Compression and Decompression -  LZ78 Compression and Decompression -  LZW Compression and Decompression – LZMW Compression and Decompression - LZAP Compression and Decompression – LZY Compression and Decompression.(10)"
                },
                {
                    "title": "TEXT BOOK:",
                    "content": "1.\tKhalid Sayood, “Introduction to Data Compression”, Morgan Kaufmann, 2013.\n            2.\tDavid Salomon, “Data Compression: The Complete Reference”, Springer, 2014\nREFERENCES:\n                1.\t1.\tCharles K. Chui, Qingtang Jiang, \"Applied Mathematics: Data Compression, Spectral Methods, Fourier Analysis, Wavelets and Applications\", Atlantic Press, 2013"
                }
            ]
        },
        {
            "code": "20XWA6",
            "title": "COMPUTER GRAPHICS AND VISUALIZATION",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "GRAPHICS INPUT - OUTPUT DEVICES:",
                    "content": "Raster scan Displays - Random scan displays - Direct view storage tubes - Flat panel displays - Mouse - Track Ball - Joy Stick - Digitizers - Touch panels - LCD. GRAPHICAL USER INTERFACE AND INTERACTIVE INPUT METHODS: The user dialog - Input of graphical data - Input function - Interactive picture construction techniques - Virtual reality environments. \t\t\t\t\t\t\t\t\t\t(3)"
                },
                {
                    "title": "OPENGL:",
                    "content": "Architecture, The OpenGL API, Primitives and Attributes, Color, Viewing, Control Functions, Programming Event-Driven Input, Transformations, OpenGL Extensions.(3)"
                },
                {
                    "title": "TWO DIMENSIONAL GRAPHICS:",
                    "content": "Basic transformations - Matrix representation and homogeneous coordinates - Composite transformations - Line drawing algorithms: DDA and Bresenham's algorithms - Circle generation algorithms: Mid point circle algorithm - Point clipping - Line clipping: Cohen Sutherland algorithm - Polygon clipping: Sutherland Hodgeman algorithm - Line covering.(7)"
                },
                {
                    "title": "RASTER GRAPHICS:",
                    "content": "Fundamentals: generating a raster image, representing a raster image, scan converting a line drawing, displaying characters, speed of scan conversion, natural images - Solid area scan conversion: Scan conversion of polygons, Y-X algorithm, properties of  scan conversion algorithms - Interactive raster graphics: painting model, moving parts of an image, feed back images.\t\t\t\t\t\t\t\t\t\t\t(7)"
                },
                {
                    "title": "CURVES AND SURFACES:",
                    "content": "Parametric representation of curves - Bezier curves – B-Spline curves - Parametric representation of surfaces - Bezier surfaces - Curved surfaces - Ruled surfaces - Quadric surfaces – Concatenation of two curve segments – Order of Continuity.\t\t\t\t\t\t\t\t\t\t\t(7)"
                },
                {
                    "title": "IMAGE PROCESSING FUNDAMENTALS:",
                    "content": "Sampling and Quantization, Image Enhancement - Histogram Processing, Filtering    (8)"
                },
                {
                    "title": "THREE DIMENSIONAL GRAPHICS:",
                    "content": "3D transformations - Viewing 3D graphical data - Orthographic, oblique, perspective projections - Hidden lines and hidden surface removal.\t\t\t\t\t\t\t(6)"
                },
                {
                    "title": "FRACTAL-GEOMETRY METHODS:",
                    "content": "Tiling the plane - Recursively defined curves - Koch curves - C curves - Dragons - Space filling curves - Fractals - Grammar based models - Graftals - Turtle graphics - Ray tracing.\t\t\t\t(4)"
                },
                {
                    "title": "Note:",
                    "content": "Algorithms in have to be implemented by using C++/ OpenGL."
                }
            ],
            "textbooks": [
                "1.\tDonald Hearn and Pauline Baker M, “Computer Graphics with OpenGL\", Pearson Education, 2014.",
                "2.\tWilliam M. Newmann and  Robert F Sproull, “Principles of Interactive Computer Graphics”, Tata McGraw Hill, 2011."
            ]
        },
        {
            "code": "20XWA7",
            "title": "PRINCIPLES OF PROGRAMMING LANGUAGES",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "The Role of Programming Languages: Toward Higher-level Languages, Problems of Scale, Programming Paradigms, Language Implementation Bridging the Gap - Language Description:- Syntactic Structure: Expression Notations, Abstract Syntax Trees, Lexical Syntax, Context -Free Grammars, Grammars for Expressions, Variants of Grammars. (9)"
                },
                {
                    "title": "IMPERATIVE PROGRAMMING:",
                    "content": "Statements: Structured Programming:- The Need for Structured Programming, Syntax-Directed Control Flow, Design Considerations: Syntax, Handling Special Cases in Loops, Programming with invariants, Proof Rules for Partial Correctness, Control flow in C - Types: Data Representation:- The Role of Types, Basic Types, Arrays Sequences of Elements, Records: Named Fields, Unions and variant Records, Sets, Pointers: Efficiency and Dynamic Allocation, Two String Tables, Types and Error Checking - Procedure Activations:- Introduction to Procedures, Parameter-passing Methods, Scope Rules for Names, Nested Scopes in the Source Text, Activation Records, Lexical Scope: Procedures as in C, Lexical Scope: Nested Procedures and Pascal.\t\t\t\t\t\t\t\t\t\t(12)"
                },
                {
                    "title": "OBJECT ORIENTED PROGRAMMING:",
                    "content": "Groupings of Data and Operations:- Constructs fro Program Structuring, Information Hiding, Program Design with Modules, Modules and Defined Types, Class Declarations in C++, Dynamic Allocation I C++, Templates: Parameterized Types, Implementation of Objects in C++. - Object-Oriented Programming:- What is an Object?, Object-Oriented Thinking - Objects in Smalltalk.\t\t\t\t\t\t\t\t\t(6)"
                },
                {
                    "title": "FUNCTIONAL PROGRAMMING:",
                    "content": "Elements of Functional Programming:- A little Language of expressions, Types : Values and Operations, Function declarations, Approaches to Expression Evaluation, Lexical Scope, Type Checking -  Functional Programming in a Typed Languages:- Exploring a List, Function Declaration by Cases, Functions as First-Class Values, ML: Implicit Types, Data Types, Exception Handling in M, Little quit in Standard ML -  Functional Programming with Lists:- Scheme, a Dialect of Lisp, The Structure of Lists, List Manipulation, A Motivating Example: Differentiation, Simplification of Expressions, Storage Allocation for Lists.\t\t\t\t\t\t\t\t\t\t\t\t(10)"
                },
                {
                    "title": "OTHER PARADIGMS:",
                    "content": "Logic Programming:- Computing with Relations, Introduction to Prolog, Data Structures in Prolog, Programming techniques, Control in Prolog, Cuts - An Introduction to Concurrent Programming:- Parallelism in Hardware, Streams: Implicit Synchronization, Concurrency as interleaving,  Liveness Properties, Safe Access to Shared Data, Concurrency in Ada, Synchronized Access to Shared variables.\t\t\t\t\t\t\t\t(8)"
                }
            ],
            "textbooks": [
                "1.\tTerrence W Pratt, Marvin VSelkowitz and TVGopal, “Programming Languages Design and Implementation”, Pearson Education, 2006.",
                "2.\tRobert Harber, “Programming in standard ML”, Carnegie Mellon University, 2005."
            ]
        },
        {
            "code": "20XWA8",
            "title": "AGILE SOFTWARE DEVELOPMENT",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "AGILE COMPUTING:",
                    "content": "- An Introduction– The Problem with parsing experience-Three levels of listening Cooperative game of Invention and Communication-Individuals-Overcoming Failure modes-Working Better in some ways than others - Drawing on Success modes.  \t\t\t\t\t\t\t\t\t(9)"
                },
                {
                    "title": "AGILE PROCESS MODELS:",
                    "content": "– Extreme programming, ASD, DSDM, Scrum, Crystal, FDD, Agile Modeling       \t\t(9)"
                },
                {
                    "title": "TEAM COMMUNICATION:",
                    "content": "-Communicating and Cooperating teams – Convection currents of information-Jumping communication gaps-Teams as communities-Teams as Ecosystems                                                                        \t\t\t(10)"
                },
                {
                    "title": "AGILE METHODOLOGIES:",
                    "content": "-Agile and self-adapting-The crystal methodologies-Crystal orange web-The agile software development manifesto-The agile alliance-Peter Naur, Programming as TheoryBuilding.                       \t\t\t\t(12)"
                }
            ],
            "textbooks": [
                "1.\tAlistair Cockburn, “Agile Software Development”, Pearson Education, 2019."
            ]
        },
        {
            "code": "20XWA9",
            "title": "DEVOPS",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "WHAT IS DEVOPS?:",
                    "content": "- An Introduction – Why DevOps? - DevOps Perspective - DevOps and Agile - Team Structure – Barriers  (3)"
                },
                {
                    "title": "THE CLOUD AS A PLATFORM:",
                    "content": "Introduction – Features of Cloud – DevOps Consequences of the unique cloud Features   (3)"
                },
                {
                    "title": "OPERATIONS:",
                    "content": "Introduction – Operations Services – Operations and DevOps – Overall Architecture Structure    (3)"
                },
                {
                    "title": "BUILDING AND TESTING:",
                    "content": "Moving a System through Deployment pipeline – Production – Incidents – Deployment – Monitoring.          \t\t\t\t\t\t\t\t\t(9)"
                },
                {
                    "title": "SECURITY AND SECURITY AUDITS:",
                    "content": "Security Threats – Identity Management – Access Control – Repeatability – Performance – Reliability – Recoverability – Interoperability – Testability – Modifiability Measurement and compliance to DevOps practices - Points of Interaction between Dev and Ops                                (10)"
                },
                {
                    "title": "SUPPORTING MULTIPLE DATACENTERS:",
                    "content": "Implementing a continuous deployment pipeline for Enterprises - Migrating to Microservices - Operators as a process - The Future of DevOps\t\t(12)"
                },
                {
                    "title": "CASE STUDIES:",
                    "content": "Tools – Jenkins – Kamatera – Docker.\t\t\t     (5)"
                }
            ],
            "textbooks": [
                "1.\tLen Bass, Ingo Weber, Liming Zhu, “DevOps: A Software Architect’s Perspective”, Addison-Wesley Professional, 2015.",
                "2.\tGene Kim, John Willis, Patrick Debois, Jez Humble, John Allspaw, “DevOps Handbook”, IT Revolution Press, 2016."
            ]
        },
        {
            "title": "20XWAA CLOUD COMPUTING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO PARALLEL AND DISTRIBUTED COMPUTING:",
                    "content": "Introduction, Architecture and Distributed computing models and technologies SOA, Web Services\t\t\t\t\t\t\t\t\t(5)"
                },
                {
                    "title": "GRID, CLUSTER AND UTILITY COMPUTING:",
                    "content": "Introduction, Architecture, Pros & Cons, Real time applications.    \t           (4)"
                },
                {
                    "title": "INTRODUCTION TO CLOUD COMPUTING:",
                    "content": "Definition, History, Comparison of Cloud Computing with Grid, Cluster and Utility Computing, Deployment models – Private, Public, Hybrid and Community - Pros and Cons of Cloud Computing.  SaaS, PaaS, IaaS etc.\t\t\t\t\t\t\t\t\t\t\t\t(8)"
                },
                {
                    "title": "VIRTUALIZATION:",
                    "content": "Types of Virtualization, Tools for Virtualization, Architecture of VMM, Virtualization for Cloud. \t(4)"
                },
                {
                    "title": "ADVANCED WEB TECHNOLOGIES:",
                    "content": "AJAX and Mashup – Programing examples using applications.\t(4)"
                },
                {
                    "title": "MAP REDUCE PARADIGMS:",
                    "content": "Introduction, GFS Architecture, HDFS Architecture, Hbase, Google big Table, Amazon’s (key value) pair storage and Microsoft’s Azure infrastructure, Map reduce programming examples.   \t\t\t\t(6)"
                },
                {
                    "title": "CLOUD COMPUTING FRAMEWORK:",
                    "content": "Amazon EC3, S3 storage revises, Aneka frame work, IBM blue Cloud.      \t(7)"
                },
                {
                    "title": "APPLICATIONS:",
                    "content": "Distributed search engine and distributed data mining in the cloud.\t\t\t\t(7)"
                }
            ],
            "textbooks": [
                "1.\tAnthony TVelte, Toby JVelte and Robert Elsenpeter, “Cloud Computing : A Practical Approach”, Tata McGraw Hill, 2010"
            ]
        },
        {
            "title": "20XWAB SOCIAL NETWORK ANALYSIS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Motivation - different sources of network data - types of networks - tools for visualizing network data - review of graph theory basics.\t(9)"
                },
                {
                    "title": "GRAPH THEORETIC PROPERTIES OF SOCIAL NETWORKS:",
                    "content": "Notions of centrality - Strong and weak ties – Homophily - Structural Balance.                                                                                                                                  \t (5)"
                },
                {
                    "title": "DYNAMIC PROPERTIES OF NETWORKS:",
                    "content": "Information diffusion - networks effects on information diffusion - maximizing influence spread - power law and heavy tail - preferential attachment models - small world phenomenon - cascading behavior on networks - Epidemics.\t(11)"
                },
                {
                    "title": "BEHAVIORAL PROPERTIES ON NETWORKS:",
                    "content": "Network economics - Bargaining and power in networks - Sponsored search markets.\t(10)"
                },
                {
                    "title": "MINING GRAPHS:",
                    "content": "Community and cluster detection: random walks - spectral methods - link analysis for web mining.\t(10)"
                },
                {
                    "title": "TEXTBOOKS:",
                    "content": "1.\tDavid Easley and Jon Kleinberg, “Networks, Crowds, and Markets: Reasoning About a Highly Connected World”, Cambridge University Press, Cambridge, 2010.\nREFERENCES:\n                1.\tStanley Wasserman, Katherine Faust, “Social network analysis: methods and applications”, Cambridge University Press, Cambridge,1998.\n                2.\tPeter R. Monge, Noshir S. Contractor, “Theories of communication networks”, Oxford University Press, 2003.\n                3.\tDuncan J Watts. “Six degrees: the science of a connected age”, Norton, 2004.\n                4.\tNarahari, Y., Garg, D., Ramasuri, N., and Prakash, H, “Game Theoretic Problems in Network Economics and Mechanism Design Solutions”, Springer-Verlag, 2008."
                }
            ]
        },
        {
            "title": "20XWAC PREDICTIVE ANALYTICS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "LINEAR REGRESSION:",
                    "content": "Coefficient of determination, Significance test, Residual analysis, Confidence and Prediction intervals.                                                                                                                                                           \t     (10)"
                },
                {
                    "title": "LOGISTIC AND MULTINOMIAL REGRESSION:",
                    "content": "Logistic function, Estimation of probability using Logistic regression, Variance, Wald Test, Hosmer Lemshow Test, Classification Table, Gini Co-efficient.(5)"
                },
                {
                    "title": "DECISION TREES:",
                    "content": "introduction, CHI-Square Automatic Interaction Detectors (CHAID), Classification and Regression Tree(CART), Analysis of Unstructured data (5)"
                },
                {
                    "title": "FORECASTING:",
                    "content": "Moving average, Exponential Smoothing, Casual Models.  (5)"
                },
                {
                    "title": "TIME SERIES ANALYSIS:",
                    "content": "Moving Average Models, ARMA,  ARIMA models , Multivariate Models (5)"
                }
            ],
            "textbooks": [
                "1.\tMax Kuhn  Kjell Johnson, “Applied Predictive Modeling”, Springer, 2014.",
                "2.\tThomas W.Miller, “Modeling Techniques in Predictive Analytics with Python and R: A guide to Data Science”, Pearson Education, 2014."
            ]
        },
        {
            "title": "20XWAD ADVANCED COMPUTER GRAPHICS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "GEOMETRICAL TRANSFORMATIONS:",
                    "content": "2D Transformations- Homogeneous Coordination and metric representation – Composition of 2D transformations – Window to view port transport, Efficiency- Matrix representation of 3D transformations – Composition of 3D transformation – Transformation as a change in coordinate system.  \t\t\t\t(3)"
                },
                {
                    "title": "VIEWING IN 3D:",
                    "content": "Projections – specifying arbitrary 3D viewing – The Mathematics of planar geometric projections – implementing planar geometric projections, Coordinate systems.(3)"
                },
                {
                    "title": "OBJECT HIERARCHY:",
                    "content": "Geometric modeling- Characteristics of retained – mode graphics packages – Defining and displaying structure – Modeling transformations, Hierarchical structure networks.\t\t\t\t\t\t(3)"
                },
                {
                    "title": "INPUT DEVICES – INTERACTION TECHNIQUES AND INTERACTION TASKS:",
                    "content": "Interaction hardware – Basic interaction tasks – Composite interaction tasks.(3)"
                },
                {
                    "title": "DIALOGUE DESIGN :",
                    "content": "The form and content of user-computer dialogues – User interface styles – Important design considerations – Modes and syntax – Visual design – The design methodology\t(3)"
                },
                {
                    "title": "USER INTERFACE SOFTWARE:",
                    "content": "Basic interaction – handling models - window management systems – output handling in window systems – Input handling in windows systems – Interaction –technique toolkits – User-interface management systems.\t(3)"
                },
                {
                    "title": "REPRESENTING CURVES AND SURFACES:",
                    "content": "Polygon meshing – parametric cubic curves, parametricbicubic surfaces, quadric surfaces.\t\t\t\t\t\t\t\t\t\t\t\t(3)"
                },
                {
                    "title": "VISIBLE SURFACE DETERMINATION :",
                    "content": "Function of two variables – Techniques for efficient visible surface algorithms – Algorithms for visible line determination – The z-buffer algorithm – List – priority Algorithm – Area subdivision algorithms – Algorithms for octrees – Algorithms for curved surfaces – Visible ray tracing.\t\t\t\t\t(3)"
                },
                {
                    "title": "REALISM:",
                    "content": "Fundamental difficulties – Rendering techniques for line drawing – Rendering techniques for shaded images – Improved object models – Dynamics – steropsis – Improved displays – Interacting with our other senses – Aliasing and antialiasing.(3)"
                },
                {
                    "title": "ACHROMATIC AND COLORED LIGHT:",
                    "content": "Achromatic light – Chromatic color – Color Models for Raster Graphics – Reproducing Color – Using Color in Computer Graphics.\t\t\t\t\t\t\t\t(3)"
                },
                {
                    "title": "ILLUMINATIONS AND SHADING :",
                    "content": "Illumination models – Shading models for polygons – Surface detail – Shadows – Transparency – Inter object reflections – Physically based illumination models – Extended light sources – Spectral sampling – Improved camera model – Global Illumination algorithms – Recursive ray tracing – Radiosity methods – The rendering pipeline. (4)"
                },
                {
                    "title": "ANIMATION :",
                    "content": "Conventional and Computer assisted Animation – Animation languages – Methods of controlling animation  - Basic rules of animation – Problems peculiar to animation.\t\t\t\t\t\t\t(3)"
                },
                {
                    "title": "TUTORIAL PRACTICE :",
                    "content": "1.\tImplement the following using the OpenGL library in VC++\n            2.\tUsing glRect function, draw : a)   A flurry           b)  A checkerboard\n            3.\tWrite the window to view port mapping functions, and use it to draw the sine curve in real world coordinates.\n            4.\tUsing user defined  lineTo  and moveTo functions, plot the Fibonacci series.\n            5.\tWrite the Canvas class and its supporting classes.  Use the Canvas class to draw a simple meander.  \n            6.\tWrite functions to change the background and foreground colors.\n            7.\tWrite a function to draw an n-sided polygon (using the basic Canvas class and line To and move To  functions)\n            8.\tA program to draw the Sierpinski gasket.\n            9.\tA program to draw the graph of a given mathematical function f(x).\n            10.\tA program to read a data file that contains a collection of Polylines in the appropriate format and draw each polyline. \n            11.\tA parameterized function to display a house and call it many times by passing different values to form a village.\n            12.\tA program that displays a colored triangle and rectangle and rotates them at different angles along two axis."
                },
                {
                    "title": "TEXT BOOK:",
                    "content": "1.\tFoley, Andries van Dam, Feinerand Hughes “Computer Graphics Principles & Practice”, Addison Wesley, 2013. \nREFERENCE:\n                1.\tDonald Hearn and Pauline Baker M, Warren Karithers, “Computer Graphics with OPENGL”, Pearson Education, 2014."
                }
            ]
        },
        {
            "title": "20XWAE BIG DATA ANALYTICS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "OVERVIEW:",
                    "content": "– Big Data era – characteristics - Definition of data features – Big data value – Development – Challenges – Intelligent data analysis - .Nature of data - Evolution of database - Limitations of existing solutions.   \t\t\t\t(4)"
                },
                {
                    "title": "RELATED TECHNOLOGIES:",
                    "content": "–Cloud computing – Relationship between cloud computing and big data - Internet of Things (IOT): IOT preliminaries – relationship between IOT and Big data; Data Centre – Hadoop – Preliminaries and Big Data – NoSQL - Hadoop eco system - Data loading techniques – Flume - Sqoop– Hive - Pig Latin - Mahout – HDFS- Map Reduce.       \t(12)"
                },
                {
                    "title": "BIG DATA GENERATIONAND ACQUISITION:",
                    "content": "– Enterprise data – IOT data – Internet data – Biomedical data – Data generation from fields - Data Collection – Transportation - Preprocessing.\t\t\t\t\t\t(8)"
                },
                {
                    "title": "DATA STREAMS:",
                    "content": "Stream Concepts – Stream data model and architecture – stream computing – sampling data in a stream – filtering streams – counting distinct elements in a stream – estimating moments – Real time analytics platform (RTAP) applications."
                },
                {
                    "title": "MASSIVE DATA ANALYTICS:",
                    "content": "Map-reduce for machine learning, Nearest Neighbor classifier, Multi-task learning, Topic model. (3)"
                },
                {
                    "title": "APPLICATIONS:",
                    "content": "– Application evolution – Fields: Structured, Text, Web, Multimedia, Network, Mobile traffic; Social Network – Healthcare and medical – Collective intelligence – smart grid.\t\t\t\t\t\t(7)"
                },
                {
                    "title": "TUTORIAL PRACTICE :",
                    "content": "1.  Implementation oflarge scale machine learningalgorithms using Hadoop and Mapreduce.\n            2.\tProblems using data streams.\n            3.\tDeveloping applications using heterogeneous data sets (Text, Web, Graph, Image, IOT) ."
                }
            ],
            "textbooks": [
                "1.\tMin Chen, Shiven Mao, Yin Zhang, Victor CM Leung, “Big Data: Related Technologies, Challenges and Future Prospects”,Google(ebook), Springer, 2014.",
                "2.\tEMC2 Education Services, “Data Science and Big Data Analytics: Discovering, Analyzing, Visualizing and Presenting Data”, Wiley, 2015",
                "3.\tAdrian McEwen, Hakim Cassimally, “Designing the Internet of Things”, Wiley, 2013",
                "4.\tVlasiosTsiatsis, IoannisFikouras, Stefan Avesand, “From Machine-to-Machine to the Internet of Things: Introduction to a New Age of Intelligence”, Academic Press Inc, 2014"
            ]
        },
        {
            "title": "20XWAF NATURAL LANGUAGE PROCESSING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION :",
                    "content": "Natural language processing techniques - analysis in NLP: morphological – syntactic, semantic -  pragmatic - Applications \t\t\t\t\t\t\t   (2)"
                },
                {
                    "title": "WORDS :",
                    "content": "Regular expressions – Automata – Morphology – Finite state Transducers – Finite state morphological parsing – Combining FST lexicon and rules – Porter Stemmer Algorithm – Probabilstic models for Spelling – Bayes method, Minimum edit distance - N-Grams – Counting words in Corpora – Simple n-grams – Smoothing – Evaluating language models : Entropy, Perplexity- Part of Speech Tagging (POS) – Rule based tagging – Stochastic based tagging – Transformation based tagging - Context Free Grammars - Top down parser – Earley Algorithm – Bottom-up parsing – CYK parser – Probabilistic parsing.                                                                                                                                                              (12)"
                },
                {
                    "title": "SEMANTICS & PRAGMATICS:",
                    "content": "First order predicate calculus – Syntax driven sematic analysis – Attachments for a fragment of English – Word Sense Disambiguation – Machine learning approaches – Dictionary based approaches –  Pragmatics : Discourse –Textcoherence.                                                                                                                              (10)"
                },
                {
                    "title": "DEEP LEARNING in NLP :",
                    "content": "Text representation – Word2Vec models – Recurrent neural network (RNN) – Long short term memory     (LSTM )                    \t\t\t\t\t\t\t\t(6)"
                },
                {
                    "title": "NATURAL LANGUAGE GENERATION :",
                    "content": "Architecture of NLG Systems- Generation Tasks and Representations- Application of NLG. Machine Translation: Language similarities and differences – The transfer metaphor – Direct translation – Statistical translation - Translation involvingIndianLanguages.                                                                                       (11)"
                },
                {
                    "title": "CASE STUDIES :",
                    "content": "Mail spam, web spam detection, Fake news detection - Sentiment Analysis - Information extraction - Automatic summarization - Question answering - Named entity recognition and relation extraction - IE using sequence labeling  - Open problems                                                                                                                                                      (4)"
                }
            ],
            "textbooks": [
                "1.\tDaniel Jurafsky and James H. Martin, “Speech and Language Processing: An Introduction to Natural Language Processing, Computational Linguistics and Speech Recognition”, Prentice Hall,2014."
            ]
        },
        {
            "title": "20XWAG INTERNET OF THINGS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO IoT:",
                    "content": "Introduction to Internet of Things (IoT) – Machine to Machine (M2M) –- Features and Definition of IoT– Recent Trends in the Adoption of IoT – Societal Benefits.         \t\t\t\t\t\t(2)"
                },
                {
                    "title": "IoT ARCHITECTURE:",
                    "content": "Functional Requirements - IoT Enabling Technologies – IPv6 - Basic Architecture - Components of IoT:  Embedded Computation Units, Microcontrollers, System on Chip (SoCs) - Sensors –  Actuators – Communication Interfaces.      (7)"
                },
                {
                    "title": "RF COMMUNICATION TECHNOLOGIES IN IoT:",
                    "content": "Wireless Sensor Networks (WSN): Overview, Fault Tolerance - RFID – NFC - Low Power Personal Area networks (LowPAN): Overview, 6LowPAN, IEEE 802.15.4, BLE, Zigbee, Zwave, and Thread - Wi-Fi - Low Power Wide Area Networks (LPWAN): Concepts and features, SigFox, LoraWAN, LPWAN-3GPP, Comparing different LPWAN technologies.                                                                                                                                                                                     (7)"
                },
                {
                    "title": "APPLICATION LAYER PROTOCOLS IN IoT:",
                    "content": "Rest Architecture - HTTP – CoAP: Architecture, Features, Applications - MQTT: Architecture, Feature, Applications - Comparing different IoT Application Layer Protocols. \t\t\t\t(7)"
                },
                {
                    "title": "MODERN NETWORKING:",
                    "content": "Cloud Computing: Introduction to the Cloud Computing, Cloud service options, Cloud Deployment models, Load balancing, Hypervisors, Comparison of Cloud providers - Software Defined Networking(SDN): Overview, Architecture, Rule placement, OpenFlow Protocol, Relevance of SDN to IoT. \t\t\t\t\t\t(8)"
                },
                {
                    "title": "SECURITY IN IoT:",
                    "content": "IEEE 802.11 Wireless Networks Attacks: Basic Types, WEP Key Recovery Attacks, Keystream Recovery Attacks against WEP – RFID Security – Security Issues in ZigBEE: Eavesdropping Attacks, Encryption Attacks – Bluetooth Security: Threats to Bluetooth Devices and Networks – Blockchain in IoT security.\t\t\t\t\t(10)"
                },
                {
                    "title": "PROTOTYPING:",
                    "content": "Prototyping embedded devices - Open Source versus Closed Source - Embedded Computing Basics - Arduino - Raspberry Pi - Implementation.                                                                                                                                                         (2)"
                },
                {
                    "title": "APPLICATIONS IN IoT:",
                    "content": "Smart homes – Energy – Health Care – Smart Transportation – Smart Living – Smart Cities- Smart Grid – Smart Agriculture.                                                                                                                                                                              (2)"
                }
            ],
            "textbooks": [
                "1.\tDieter Uckelmann, Mark Harrison, Florian Michahelles, “Architecting the Internet of Things”, Springer, New York, 2011",
                "2.\tAdrian McEwen and Hakim Cassimally, “Designing the Internet of Things”, John Wiley and Sons  Ltd, UK, 2014.",
                "3.\tThomas Erl, Dr. Zaigham Mahmood, Professor Ricardo Puttini,\"Cloud Computing: Concepts, Technology & Architecture\", PHI, 2013",
                "4.\tBrian Russell, Drew Van Duren, \"Practical Internet of Things Security\", Packt Publishing, 2016"
            ]
        },
        {
            "title": "20XWAH ADVANCED SYSTEMS PROGRAMMING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "Linux System:",
                    "content": "Design Principles – Kernel Modules – Process Management Scheduling – Memory Management – Input-Output Management – File System – Interprocess Communication. iOS and Android: Architecture and SDK Framework – Media Layer – Services Layer – Core OS Layer.                                                                                                                                                         (6)"
                },
                {
                    "title": "Overview of system calls:",
                    "content": "- anatomy of a system call and x86 mechanisms for system call implementation - MMU/memory translation, segmentation, and hardware traps interact - create kernel-user context separation – virtualization.                                (6)"
                },
                {
                    "title": "The kernel execution and programming context:",
                    "content": "Live debugging and tracing – Hardware and software support for debugging – Dtrace: programming, implementation/design, internals – Kprobes and SysTrace: Linux catching up.(7)"
                },
                {
                    "title": "Linking and loading:",
                    "content": "– Executable and Linkable Format (ELF) – Internals of linking and dynamic linking – Internals of effective spinlock implementations on x86. \t\t\t\t\t\t\t\t\t(4)"
                },
                {
                    "title": "Process and thread kernel data structures:",
                    "content": "– process table traversal – lookup, allocation and management of new structures - /proc internals – optimizations.\t\t\t\t\t\t\t\t(4)"
                },
                {
                    "title": "Virtual File System and the layering of a file system call from API to driver :",
                    "content": "– Object-orientation patterns in kernel code – a review of OO implementation generics (C++ vtables, etc).\t\t\t\t\t(8)"
                },
                {
                    "title": "Kmem and Vmem allocators:",
                    "content": "OO approach to memory allocation – Challenges of multiple CPUs and memory hierarchy – Overview of the kernel network stack implementation – Path of a packet through a kernel – Berkeley Packet Filter architecture – Linux Netflter architecture.\t\t\t\t\t\t\t\t\t\t(10)"
                },
                {
                    "title": "TEXT BOOK:",
                    "content": "1.\tRobert Love, “Linux System Programming”, O’Reilly, 2013\nREFERENCES:\n                    1.\tYang Lixiang, Liang Wenfeng, “The Art of Kernel Linux design”, CRC Press, 2016\n                    2.\tRami Rosen, “Linux Kernel Networking : Implementation and Theory”, Apress, 2014."
                }
            ]
        },
        {
            "title": "20XWAI STATISTICAL LEARNING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "THEORETICAL FOUNDATIONS :",
                    "content": "Review of Statistical Inference, Review of Probability, Testing of Hypothesis – Introduction to Function Spaces – Vector Spaces - Metric Spaces – Cauchy Sequence – Complete Metric Space – Normed Space, Inner Product Space – Banach Space - Hilbert Space – Sobolev – Examples - Mercer Kernels - Reproducing Kernel Hilbert Space (RKHS), Concentration of Measure : Measures of Complexity - Rademacher Complexity.                                                                                              (10)"
                },
                {
                    "title": "LINEAR REGRESSION:",
                    "content": "Simple, Multiple, Other Considerations in the Regression Model – Resampling Methods – Cross-Validation, Bootstrap – Linear Model Selection & Regularisation – Subset Selection, Shrinkage Methods – Ridge, Lasso, Dimension Reduction Methods.                                                                                                                                                            (8)"
                },
                {
                    "title": "NON-LINEAR REGRESSION:",
                    "content": "Polynomial Estimators, Step Functions, Basis Functions, Regression Spline, Smoothing Splines, Local Regression, Generalised Additive Models.                                                                                                                                           (4)"
                },
                {
                    "title": "LINEAR CLASSIFICATION:",
                    "content": "Review of Classification Models, Logistic Regression, Linear Discriminant Analysis, Quadratic Discriminant Analysis, Comparison of Classification Methods.                                                                     (6)"
                },
                {
                    "title": "TREE BASED METHODS:",
                    "content": "Regression Trees, Classification Trees,Bagging, Random Forests, Boosting.                                       (9)"
                },
                {
                    "title": "support vector machines:",
                    "content": "Maximal Margin Classifier – Support Vector Classifiers - Support Vector Machines – Non-linear Decision Boundaries – SVMs with more than 2 classes. (4)"
                },
                {
                    "title": "UNSUPERVISED LEARNING:",
                    "content": "Principal Components Analysis – Clustering Methods – K-Means Clustering, Hierarchical Clustering.(4)"
                }
            ],
            "textbooks": [
                "1.\tGareth James, Daniela Witten, Trevor Hastie, Robert Tibshirani, “An introduction to Statistical learning”, Springer, 2013.",
                "2.\tTrevor Hastie, Robert Tibshirani, Jerome Friedman, “Elements of Statistical Learning: Data Mining, Inference and Prediction”, Springer, 2013."
            ]
        },
        {
            "title": "20XWAJ VIRTUAL AND AUGMENTED REALITY",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO VR AND AR:",
                    "content": "Overview of class, logistics, history of VR/AR.\t\t\t\t                        (5)"
                },
                {
                    "title": "THE GRAPHICS PIPELINE AND OPENGL:",
                    "content": "Overview and Transformations: rotation, translation, scaling, model view matrix, projection matrix, Lighting and Shading.\t\t\t\t\t\t\t(7)"
                },
                {
                    "title": "OPENGL SHADING LANGUAGE (GLSL):",
                    "content": "GLSL vertex and fragment shaders.\t\t\t\t\t         (5)"
                },
                {
                    "title": "THE HUMAN VISUAL SYSTEM:",
                    "content": "Perception of depth, color, contrast, resolution, Stereo Rendering.                   (5)"
                },
                {
                    "title": "HEAD MOUNTED DISPLAY OPTICS:",
                    "content": "Magnifier designs, stereo rendering for HMDs, lens distortion correction, advanced HMD optics.\t\t\t\t\t\t\t\t\t\t\t                          (7)"
                },
                {
                    "title": "INERTIAL MEASUREMENTS UNITS:",
                    "content": "gyros, accelerometers, magnetometers, sensor fusion, complementary filter, Arduino        (6)"
                },
                {
                    "title": "POSITIONAL TRACKING:",
                    "content": "Tracking with the light house, advanced positional tracking. SPATIAL SOUND.                                   (5)"
                },
                {
                    "title": "PANORAMIC IMAGING AND CINEMATIC VR:",
                    "content": "VR Engines and Other Aspects of VR (latency, eye tracking, post-rendering warp)\t\t\t\t\t\t\t\t\t\t\t\t           (5)"
                },
                {
                    "title": "TUTORIAL PRACTICES:",
                    "content": "1.\t1.   Lab: Hello, WebGL!\n                2.\t2.   Lighting and shading with GLSL\n                3.\t3.   Stereo rendering, anaglyph\n                4.\t4.   Building Own Head Mounted Display\n                5.\t5.   Build Your Own IMU, Arduino Programming\n                6.\t6.   Positional Tracking\n                7.\t7.   Spatial Sound\n                8.\t8.   Content creation with unity (Optional)"
                }
            ],
            "textbooks": [
                "1.\tMarschner, Shirley, “Fundamentals of Computer Graphics”, CRC Press, 2016.",
                "2.\tLa Valle, “Virtual Reality”, Cambridge University Press, 2016."
            ]
        },
        {
            "title": "20XWAK COMPUTER FORENSICS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "COMPUTER AND FORENSICS:",
                    "content": "Introduction – Stand-alone computer crimes –Computer evidence – Computer Forensics evidence and courts –Internet laws and statutes; Forensics process – Securing evidence – Law enforcement and methodology.                   (8)"
                },
                {
                    "title": "FORENSICS EVIDENCE:",
                    "content": "Sources – Seizure – Collection – Integrity – Handling; Acquisition and Duplication of data. (8)"
                },
                {
                    "title": "DATA ANALYSIS:",
                    "content": "Metadata extraction – File Signature analysis – System analysis – Examining unallocated space – Data carving – Recovering deleted data and partitions(6)"
                },
                {
                    "title": "WINDOWS FORENSICS:",
                    "content": "Registry Analysis – Executable file analysis – Recycle Bin Forensics – Evidence Recovery from Print and Spool files. (5)"
                },
                {
                    "title": "INTERNET FORENSICS:",
                    "content": "Domain Name Ownership Investigation – Email Forensics – Messenger Forensics – Browser Forensics.(6)"
                },
                {
                    "title": "MOBILE DEVICE FORENSICS:",
                    "content": "Hand-held devices and Forensics – Reconstructing user’s activities and deleted data.(4)"
                },
                {
                    "title": "MEMORY FORENSICS AND MALWARE ANALYSIS:",
                    "content": "Memory data collection and Examination – Analyzing Windows and Linux systems for malware – Reverse Engineering tools and techniques.(6)"
                },
                {
                    "title": "ANTI-FORENSICS:",
                    "content": "Erasing Evidence.(2)"
                }
            ],
            "textbooks": [
                "1.\tMarjie T. Britz, \"Computer Forensics and Cyber Crime: An Introduction\", Pearson Education, 2013.",
                "2.\tLinda Volonino, Reynaldo Anzaldua, Jana Godwin, \"Computer Forensics: Principles and Practices\", Pearson/Prentice Hall, 2007"
            ]
        },
        {
            "title": "20XWAL WIRELESS NETWORKS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "WIRELESS NETWORK OVERVIEW:",
                    "content": "Wired and wireless Networks- Effect of mobility on systems- Introduction to wireless technologies- RF Overview - Wireless Signal Propagation-Signal-to-Noise Ratio – Modulation - ISM Spectrum - Frequency Hopping Spread Spectrum (FHSS) - Direct Sequence Spread Spectrum (DSSS)- Orthogonal Frequency Division Multiplexing (OFDM) -Coordination mechanisms and MAC protocols for multi-user network access\t\t\t\t\t(6)"
                },
                {
                    "title": "WLAN TECHNOLOGIES:",
                    "content": "IEEE 802.11 Standard--WPA(Wi- Fi Protected Access)-WPA2- WEP (wired Equivalence Privacy)- Static WEP Wireless Architecture- Bluetooth –Zigbee Wireless data networks-Personal Area Networks-GPRS architecture\t(12)"
                },
                {
                    "title": "AD HOC AND SENSOR NETWORKS:",
                    "content": "Ad hoc Network- Characteristics- Table-driven and Source-initiated On Demand routing protocols, Hybrid protocols -. Wireless Sensor networks- Classification, MAC and Routing  Protocols.  \t\t           (8)"
                },
                {
                    "title": "MOBILE NETWORK AND TRANSPORT LAYERS:",
                    "content": "Mobile IP – Dynamic Host Configuration Protocol-Mobile Ad Hoc Routing Protocols–Multicast routing-TCP over Wireless Networks – Indirect TCP – Snooping TCP – MobileTCP – Fast Retransmit / Fast Recovery – Transmission/Timeout Freezing-Selective Retransmission – Transaction  Oriented TCP- TCP over 2.5 / 3G wireless Networks."
                },
                {
                    "title": "Wireless Threats and Risks:",
                    "content": "Security breaches on wireless Networks- Eavesdropping-Jamming - RF interference -Covert wireless channels-Traffic Analysis Spoofing- DOS attack - Malicious Code -Cryptographic threats- Rogue Access Points - MAC Filtering Attacks - Attack on MiC - RADIUS Vulnerabilities – WPA and 802.1x Vulnerabilities -  Attacks on Wireless Gateways(8)"
                }
            ],
            "textbooks": [
                "1.\tWilliam Stallings, “Wireless Communication and Networks”, Pearson Education, 2016.",
                "2.\tGary. S. Rogers and John Edwards, “An Introduction to Wireless Technology”, Pearson Education, 2012.",
                "3.\tSivaRam Murthy C and B.S Manoj, “Ad hoc Wireless Networks Architecture and Protocols”, Pearson Education, 2012.",
                "4.\tKaveh Pahlavan, Prashant K. Krishnamurthy, “Principles of Wireless Networks : A Unified Approach”, John Wiley, 2011."
            ]
        },
        {
            "title": "20XWAM NETWORK FORENSICS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION :",
                    "content": "Footprints  -  Concepts in Digital Evidence - Network Forensics Investigative Methodology (OSCAR) - Sources of Network-Based Evidence  - Evidence Acquisition \t\t\t\t\t\t\t\t           (6)"
                },
                {
                    "title": "TRAFFIC ANALYSIS:",
                    "content": "Protocol Analysis - Packet Analysis  -  Flow Analysis – Higher Layer Traffic Analysis  \t\t           (8)"
                },
                {
                    "title": "STATISTICAL FLOW ANALYSIS:",
                    "content": "Process Overview – Sensors - Flow Record Export protocols - Collection and Aggregation – Analysis.                                                                                                                                                                                               (7)"
                },
                {
                    "title": "NETWORK INTRUSION DETECTION AND ANALYSIS:",
                    "content": "Why Investigate NIDS/NIPS? -Typical NIDS/NIPS Functionality -  Modes of Detection - Types of NIDS/NIPSs  - NIDS/NIPS Evidence Acquisition  - Comprehensive Packet Logging -  Snort  \t           (9)"
                },
                {
                    "title": "EVENT LOG AGGREGATION, CORRELATION, AND ANALYSIS:",
                    "content": "Sources of Logs  - Network Log Architecture - Collecting and Analyzing Evidence – Switch Evidence – Router Evidence – Firewall Evidence\t\t\t\t\t           (6)"
                },
                {
                    "title": "WEB PROXIES:",
                    "content": "Why Investigate Web Proxies? -  Web Proxy Functionality  - Evidence -  Squid  -  Web Proxy Analysis -  Encrypted Web Traffic \t\t\t\t\t\t\t\t\t\t\t           (9)"
                }
            ],
            "textbooks": [
                "1.\tDavidoff, Sherri, and Jonathan Ham, “ Network forensics: tracking hackers through cyberspace” Vol. 2014. Upper Saddle River: Prentice hall, 2012."
            ]
        },
        {
            "title": "20XWAN RANDOMIZED ALGORITHMS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Randomized algorithms, randomized quick sort, Karger’s min-cut algorithm Las Vegas and Monte Carloalgorithms, computational models and complexity classes.        \t(5)"
                },
                {
                    "title": "MOMENT, DEVIATION AND TAIL INEQUALITIES:",
                    "content": "Occupancy problem, Markov and Chebyshev inequalities- randomized selection- coupon collector’s problem, the Chernoff bound- routing in a parallel computer- a wiring problem.                                   (7)"
                },
                {
                    "title": "PROBABILISTIC METHODS:",
                    "content": "Overview of the method-maximum satisfiability - finding a large cut, Expander graphs.                    (5)"
                },
                {
                    "title": "MARKOV CHAINS AND RANDOMWALKS:",
                    "content": "Markov chains, Random walk on graphs - connectivity in undirected graphs – Expanders and rapidly mixing random walks.       \t(6)"
                },
                {
                    "title": "DATA STRUCTURES AND GRAPH ALGORITHMS:",
                    "content": "Random Treaps, hashing – hash tables – perfect hashing, skip lists - Fast in-cut.        \t(6)"
                },
                {
                    "title": "ONLINE ALGORITHMS:",
                    "content": "Paging problem-adversary models- paging against an oblivious adversary-relating the adversaries-the adaptive online adversary, k-server problem.(5)"
                },
                {
                    "title": "PARALLEL AND DISTRIBUTED ALGORITHMS:",
                    "content": "Sorting on a PRAM – Maximal Independent sets. \t(4)"
                },
                {
                    "title": "NUMBER THEORETIC ALGORITHMS:",
                    "content": ", Polynomial roots and factoring, primality testing.       \t(3)"
                },
                {
                    "title": "DERANDOMIZATION:",
                    "content": "The method of Conditional Probabilities – Derandomizing max-cut algorithm – Constructing pairwise independent values modulo a prime - Pairwise independent – large cut.                \t(4)"
                }
            ],
            "textbooks": [
                "1.\tMotwani R and RaghavanP,“Randomized Algorithms”, Cambridge University Press, 2010.",
                "2.\tMichael Mitzenmacher and Eli Upfal, “Probability & Computing: Randomized Algorithms and Probabilistic Analysis”, Cambridge University Press, 2009."
            ]
        },
        {
            "title": "20XWAO   REINFORCEMENT LEARNING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "REINFORCEMENT PROBLEM:",
                    "content": "Introduction - Elements of RL, History of RL- Evaluative feedback -Goals and rewards – Returns -Bandit learning: Upper-confidence - bound algorithms - Thompson sampling, online learning - Multi agent reinforcement learning  (6)"
                },
                {
                    "title": "MARKOV DECISION PROCESS (MDP) :",
                    "content": "– Value functions - Optimality Criterion in MDPs.- Partially Observed Markov Decision Process  \t\t\t\t\t\t\t\t\t\t\t (4)"
                },
                {
                    "title": "DYNAMIC PROGRAMMING (DP):",
                    "content": "Policy Evaluation- Policy Improvement - Value Iteration, asynchronous DP- Efficiency of DP- Stochastic DP.                                                                                                 \t\t\t\t\t (5)"
                },
                {
                    "title": "MONTE CARLO METHODS:",
                    "content": "Policy Evaluation- Policy Improvement- On-policy and off- policy Monte Carlo controls-Incremental implementation.\t\t\t\t\t\t\t\t\t(8)"
                },
                {
                    "title": "TEMPORAL DIFFERENCE LEARNING (TD):",
                    "content": "TD-prediction- Optimality of TD - Sarsa- Q-Learning – R- Learning-Actor-Critic Model- Unifying Monte Carlo and TD-Traces- Games.\t\t\t\t\t\t (8)"
                },
                {
                    "title": "FUNCTION APPROXIMATION:",
                    "content": "- Value prediction and control – Gradient Descent methods-Linear methods – Artificial Neural Network based approximation- lazy learning - Policy Gradient methods- REINFORCE algorithm, exact gradient methods, estimating gradients, approximate policy gradient algorithms, actor-critic methods\t - Deep Q Learning - Inverse RL                (9)"
                },
                {
                    "title": "PLANNING AND LEARNING:",
                    "content": "Model based learning and planning - prioritized sweeping-Heuristic search.\t            (5)"
                },
                {
                    "title": "TEXT BOOKS",
                    "content": "1.\tSutton R. S. and Barto A. G., \"Reinforcement Learning: An Introduction\", MIT Press, 2018.\n                2.\tDimitri P. Bertsekas, \"Reinforcement Learning and Optimal Control”, Athena Scientific, 2019\n                3.\tCsaba Szepesvári, “Algorithms for Reinforcement Learning”, Morgan & Claypool, 2013.\n                4.\tMasashi Sugiyama, “Statistical Reinforcement Learning : Modern Machine Learning Approaches”, CRC Press, Taylor & Francis Group, 2015\nREFERENCES\n                    1.\tLattimore, T. and Szepesvári, C.” Bandit Algorithms”, Cambridge University Press, 2018.\n                    2.\tStuart Russell and Peter Norvig, “Artificial Intelligence: A Modern Approach”, Prentice Hall, 2014."
                }
            ]
        },
        {
            "code": "20XWO1",
            "title": "PRINCIPLES OF MANAGEMENT AND BEHAVIOURAL SCIENCES",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "PRINCIPLES OF MANAGEMENT:",
                    "content": "Meaning, Definition and Significance of Management, Basic Functions of Management – Planning, Organizing, Staffing, Directing and Controlling.  Organizational Environment – Social, Economic, Technological and Political.   Corporate Social Responsibility -  Case discussion\t(8)"
                },
                {
                    "title": "INDUSTRIAL AND BUSINESS ORGANIZATION:",
                    "content": "Growth of Industries (Small Scale, Medium Scale and Large Scale Industries).  Forms of Business Organizations. Resource Management – Internal and External Sources.\t(7)"
                },
                {
                    "title": "ORGANIZATIONAL BEHAVIOUR:",
                    "content": "Significance of OB, Impact of culture on organization. Role of leadership and leadership styles. Personality and Motivational Theories.  Attitudes, Values and Perceptions at work - Case discussion\t(7)"
                },
                {
                    "title": "GROUP BEHAVIOUR:",
                    "content": "Group dynamics, Group formation and development, group structure and group cohesiveness. Informal organization – Sociometry – Interaction analysis - Exercises\t(8)"
                },
                {
                    "title": "GLOBALISATION:",
                    "content": "Issues for global competitiveness, proactive and reactive forces of globalization. Cross cultural management – Management of work force diversity.\t(5)"
                },
                {
                    "title": "HUMAN RESOURCE MANAGEMENT:",
                    "content": "Objectives and Functions, Selection and Placement, Training and Development – Conflict management – Stress management -  Human resource management in global environment - Human resource information system(HRIS)  - Case discussion.                                                                                                                                                     (10)"
                }
            ],
            "textbooks": [
                "1.\tHarold Koontz, Heinz Weihrich and Ramachandra Aryasri, “Principles of Management”, Tata McGraw Hill, 2014.",
                "2.\tMamoria CB, “Personnel Management”, Sultan Chand & Sons, 2005."
            ]
        },
        {
            "code": "20XWO2",
            "title": "ENTERPRENEURSHIP",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO ENTREPRENEURSHIP:",
                    "content": "Definition – Characteristics and Functions of an Entrepreneur – Common myths about entrepreneurs – Importance or Entrepreneurship. Seminar in R5 & R6.\t\t\t\t\t(5)"
                },
                {
                    "title": "CREATIVITY AND INNOVATION:",
                    "content": "The role of creativity – The innovation Process – Sources of New Ideas – Methods of Generating Ideas – Creative Problem Solving – Entrepreneurial Process.\t\t\t\t\t\t\t(6)"
                },
                {
                    "title": "DEVELOPING AN EFFECTIVE BUSINESS MODEL:",
                    "content": "The Importance of a Business Model – Starting a small scale industry - Components of an Effective Business Model.\t\t\t\t\t\t\t\t(5)"
                },
                {
                    "title": "APPRAISAL OF PROJECTS:",
                    "content": "Importance of Evaluating Various options and future investments- Entrepreneurship incentives and subsidies – Appraisal Techniques.\t\t\t\t\t\t\t\t\t(8)"
                },
                {
                    "title": "FORMS OF BUSINESS ORGANIZATION:",
                    "content": "Sole Proprietorship – Partnership – Limited liability partnership - Joint Stock Companies and Cooperatives.\t\t\t\t\t\t\t\t\t\t\t(4)"
                },
                {
                    "title": "FINANCING THE NEW VENTURE:",
                    "content": "Determining  Financial Needs – Sources of Financing – Equity and Debt Funding – Case studies in Evaluating Financial Performance.\t\t\t\t\t\t\t\t(8)"
                },
                {
                    "title": "THE MARKETING FUNCTION:",
                    "content": "Industry Analysis – Competitor Analysis – Marketing Research for the New Venture – Defining the Purpose or Objectives – Gathering Data from Secondary Sources – Gathering Information from Primary Sources – Analyzing and Interpreting the Results – The Marketing Process.                                                                                 \t\t\t(5)"
                },
                {
                    "title": "INTELLECTUAL PROPERTY PROTECTION AND ETH ICS:",
                    "content": "Patents – Copyright - Trademark- Geographical indications – Ethical and social responsibility and challenges.\t\t\t\t\t\t\t\t\t(4)"
                }
            ],
            "textbooks": [
                "1.\tDonald F.Kuratko and Richard M.Hodgetts, “Entrepreneurship”, South-Western, 2003.",
                "2.\tThe Dynamics of Entrepreneurial Development and Management, Vasant Desai, Himalaya Publishing House, 2010."
            ]
        },
        {
            "code": "20XWO3",
            "title": "APPLIED GRAPH THEORY",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "BASIC CONCEPTS:",
                    "content": "Graphs - directed and undirected, subgraphs, graph models, degree of a vertex, degree sequence, Havel-Hakimi theorem, Hand-shaking lemma. Connectivity, walk, path, distance, diameter.  Isomorphic graphs. Common classes of graphs – regular, complete, petersen, cycle, path, tree, k-partite, hypercube, Spanning trees – Matrix tree theorem, graph decomposition.\t\t\t\t\t\t\t\t\t\t\t(6)"
                },
                {
                    "title": "CONNECTIVITY:",
                    "content": "Vertex and edge connectivity, Vertex and edge cuts, relationship between vertex and edge connectivity, bounds for connectivity.  Harary’s construction of k-connected graphs.\t\t\t\t\t\t(8)"
                },
                {
                    "title": "EULERIAN AND HAMILTONIAN GRAPHS:",
                    "content": "Eulerian graphs, Route inspection problem, Hamiltonian graphs, Gray codes and Hypercubes, Travelling sales person problem.\t\t\t\t\t\t\t\t(8)"
                },
                {
                    "title": "MATCHING, VERTEX-COLORING AND DOMINATION:",
                    "content": "Matching (unweighted), Perfect matching, Hall’s theorem, assignment problem, augmenting path algorithm. Vertex-coloring – bounds, assignment of frequencies, fast register allocation, scheduling problem. Dominating set, domination number, bounds, connected dominating set in Ad Hoc Networks.      \t\t(11)"
                },
                {
                    "title": "PLANAR GRAPHS:",
                    "content": "Properties, Kuratowski’s theorem, Hopcroft Tarjan Planarity testing algorithm. \t\t\t(5)"
                },
                {
                    "title": "RANDOM GRAPHS:",
                    "content": "Random graph – Definitions of G(n, p) and G(n, M) models, power law degree distribution, Web graph models, applications to social networks.\t\t\t\t\t\t\t\t\t(7)"
                }
            ],
            "textbooks": [
                "1.\tAnthony Bonato, “A Course on Web Graphs”, American Mathematical Society, 2008.",
                "2.\tHaynes T W, Hedetniemi and Slater P J, “Fundamentals of Domination in Graphs”, CRC Press, 2015.",
                "3.\tJonathan Gross and Jay Yellen, “Graph Theory and its Applications”,  Press, 2005."
            ]
        },
        {
            "code": "20XWO4",
            "title": "ENVIRONMENTAL SCIENCE AND GREEN COMPUTING",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "NATURAL RESOURCES, ECOSYSTEMS AND BIODIVERSITY:",
                    "content": "Environment, Definition, Scope and importance, Forest resources, Use and overexploitation, Water resources: Use and over utilization. Eco system; Structure and functions of an eco system, energy flow in the eco system.  Bio Diversity; values of biodiversity, biodiversity at global, national and local levels – threats to bio diversity.  Conservation of bio diversity – In-situ & Ex-situ conservation.      \t\t\t\t\t(9)"
                },
                {
                    "title": "ENERGY SOURCES:",
                    "content": "Growing energy needs, Renewable and non renewable energy sources,  Hydro power, Solar Power:  Photovoltaic Energy – Motivation for going Solar – Solar Electricity – PV cells. Wind Power: – Using the Wind: Generating Power at Remote Sites,– Measuring the Wind – Estimating the output.  Use of alternate energy sources.\t           (9)"
                },
                {
                    "title": "SOCIAL ISSUES AND THE ENVIRONMENT:",
                    "content": "From unsustainable to sustainable development, Urban problems related to energy, Water conservation, Rain water harvesting, Watershed management, Environment and human health, Role of information technology in environment and human health. Environment Protection Act: Air (Prevention and Control of Pollution) Act – Water Act,   Forest Conservation Act, Wildlife Protection Act,   Introduction to EIA and ISO 14000.   \t\t\t\t           (9)"
                },
                {
                    "title": "ENVIRONMENTAL POLLUTION AND DISASTER MANAGEMENT:",
                    "content": "Definition – causes, effects and control measures of air pollution, water pollution, soil pollution, noise pollution, thermal pollution and nuclear hazards. Disaster management - floods, earthquake, cyclone and landslides. Solid waste management - causes, effects and control measures of municipal solid wastes (Biomedical wastes, hazardous wastes). Role of an individual in prevention of pollution. \t\t(9)"
                },
                {
                    "title": "GLOBAL ATMOSPHERIC CHANGE& GREEN  FUNDAMENTALS:",
                    "content": "The Atmosphere of Earth – Global Temperature – Global Energy Balance , The  Greenhouse Effect  - Environmental Issues and Green Computing,  Electronic waste management: Introduction;- Environment and society,  producer responsibility legislation – the Waste Electrical and Electronic Equipment (WEEE) directive,  Materials Composition of WEEE: Mobile Phones – Television – Washing Machines, - Current and new electronic waste recycling technology- Future perspectives of electronic scrap.\t\t(9)"
                }
            ],
            "textbooks": [
                "1.\tMackenzie L. Davis, and David A. Cornwell, “Introduction to Environmental Engineering”, Tata McGraw Hill, 2010.",
                "2.\tChetan Singh Solanki, “Solar Photovoltaics”, PHI, 2011.",
                "3.\tSiraj Ahmed, “Wind Energy : Theory and Practice”, PHI, 2011.",
                "4.\tMahajan S. P. Pollution Control in Process Industries, Tata McGraw Hill, 1985.",
                "5.\tR. E. Hester and R. M. Harrison, “Electronic Waste Management”, Royal Society of Chemistry, 2009."
            ]
        },
        {
            "code": "20XWO5",
            "title": "QUANTUM MECHANICS AND FUNDAMENTALS OF QUANTUM COMPUTATION",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "WAVE MECHANICAL CONCEPTS AND FORMALISM:",
                    "content": "wave nature of particles – Interpretation of wave function- principle of super position- wave packet- uncertainty principle - Schrödinger’s time dependent and independent wave equations – Postulates of quantum mechanics – vector space-Linear and Hermitian operators - simultaneous measurability of observable\t\t           (7)"
                },
                {
                    "title": "ONE DIMENSIONAL ENERGY EIGEN VALUE PROBLEMS:",
                    "content": "Square well potential with rigid walls- Square well potential with finite walls- Square potential barrier – Linear Harmonic Oscillator \t\t\t\t\t\t\t           (6)"
                },
                {
                    "title": "THREE DIMENSIONAL ENERGY EIGEN VALUE PROBLEMS:",
                    "content": "Schrödinger’s equation in spherical polar coordinates- The hydrogen atom- Angular momentum-spin \t\t\t\t           (8)"
                },
                {
                    "title": "QUANTUM COMPUTATION:",
                    "content": "History of quantum computation and quantum information-qubits-qubit gates-quantum circuits-quantum teleportation-quantum entanglement\t\t\t\t\t\t\t\t         (12)"
                },
                {
                    "title": "QUANTUM COMPUTER-PHYSICAL REALIZATION:",
                    "content": "Guiding principles-conditions for quantum computation-Harmonic oscillator and optical photon quantum computer-physical apparatus -quantum computation-drawbacks                                          (12)"
                }
            ],
            "textbooks": [
                "1.\tDavid J Griffiths, “Introduction to Quantum Mechanics”, Cambridge University Press, 2017",
                "2.\tAruldhas G, “Quantum Mechanics”, PHI,  2011.",
                "3.\tMicheal A Nielsen, Isaac L Chuang, “Quantum Computation and Quantum Information”, Cambridge University Press, 2010."
            ]
        },
        {
            "code": "20XWO6",
            "title": "COMPUTATIONAL FOUNDATIONS FOR ROBOTICS",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Robots and their applications in industry, mobile and service applications, Configurations of industrial and mobile robots.Robot controllers, drives, actuators and sensors,\tSpatial descriptions and Transformations: Positions, orientations and frames, Mappings, translations, rotations and transformations, transformation arithmetic, Transform equations, representation of orientation, free vector transformation, Introduction to ROS.\t\t\t\t\t\t\t(8)"
                },
                {
                    "title": "FORWARD AND INVERSE KINEMATICS:",
                    "content": "Link co-ordinates, D-H Representation, Arm equation -Two axis and three axis, robots, Inverse kinematics of two axis and three axis robots, Maneuverability – Workspace – Control.          \t\t\t(9)"
                },
                {
                    "title": "LOCALIZATION AND MAPPING:",
                    "content": "Challenges in mobile robots, Introduction - Bayes filter – Kalman Filter - Extended Kalman Filter -  Information Filter -  Histogram Filter - Particle Filter –Localization- Map Representation- Probabilistic Map based Localization-Monte carlo localization- Landmark based navigation-Globally unique localization- Positioning beacon systems- Route based localization – Mapping - Metrical maps - Grid maps - Sector maps – Hybrid Maps – SLAM\t\t\t\t\t(10)"
                },
                {
                    "title": "DECISION MAKING:",
                    "content": "Discrete planning and dynamic programming principles, Configuration space abstraction, Sampling-based planners for mobile robots, Feedback-based planning for mobile robots- Feedback in discrete spaces, wave-front functions,  Potential and navigation functions for mobile robots.\t\t\t\t\t\t\t(9)"
                },
                {
                    "title": "PLANNING AND NAVIGATION:",
                    "content": "Overview of the three computational components and their interaction, sensing, planning, and control - Global path planning – A* Algorithm - local path planning - Road map path planning- Cell decomposition path planning-Potential field path planning-Obstacle avoidance – Path control. Markov Decision Process (MDP) in discrete spaces, optimal control and steering methods- Nonlinear optimization and gradient methods.\t\t\t\t\t\t(9)"
                }
            ],
            "textbooks": [
                "1.\t1. John J. Craig, ”Introduction to Robotics: Mechanics and Contro”, Pearson Education, 2008",
                "2.\t2. , “Planning Algorithms”, Cambridge University Press, 2006.",
                "3.\t3. Howie Choset, Kevin M. Lynch, Seth Hutchinson, George A. Kantor, Wolfram Burgard, Lydia E. Kavraki, and Sebastian Thrun, “Principles of Robot Motion:Theory, Algorithms, and Implementations”, (PRMTAI), MIT Press, 2005."
            ]
        },
        {
            "code": "20XWO7",
            "title": "MATHEMATICAL MODELLING",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO MODELING:",
                    "content": "Modeling process, Overview of different kinds of model.                                                            (3)"
                },
                {
                    "title": "EMPIRICAL MODELING WITH DATA FITTING:",
                    "content": "Error function, least squares method; fitting data with polynomials and splines.(4)"
                },
                {
                    "title": "CAUSAL MODELING AND FORECASTING:",
                    "content": "Introduction, Modeling the causal time series, forecasting by regression analysis, predictions by regression. Planning, development and maintenance of linear models, trend analysis, modeling seasonality and trend, trend removal and cyclical analysis, decomposition analysis. Modeling financial time series. Econometrics and time series models. Non seasonal models: ARIMA process for univariate and multivariate.                                                                               (8)"
                },
                {
                    "title": "INVENTORY MODELS:",
                    "content": "Classic Economic Order Quantity (EOQ)Model, EOQ with price breaks, Multi-item EOQ with Storage limitation, Dynamic EOQ , Probabilistic EOQ model , No setup model, Setup model (s-S Policy).                                                    (7)"
                },
                {
                    "title": "PORTFOLIO MODELING AND ANALYSIS:",
                    "content": "Portfolios, returns and risk, risk-reward analysis, asset pricing models, mean variance portfolio optimization, Markowitz model and efficient frontier calculation algorithm, Capital Asset Pricing Models (CAPM).             (8)"
                },
                {
                    "title": "MODELING WITH BIOINFORMATICS:",
                    "content": "Introduction, Biological data- types, mode of collection, documentation and submission. Sequence alignment- Definition, significance, dot matrix method, dynamic programming- Global and local alignment tools, scoring matrices and gap penalties. Multiple sequence alignment: Iterative methods. Hidden Markovian models, statistical methods, position specific scoring matrices.                                                                                                                                                                  (15)"
                }
            ],
            "textbooks": [
                "1.  Giordano F R, Weir M D and Fox W P,“A First Course in Mathematical Modeling”, Brooks/Cole, 2008.",
                "2.  Mount, DW, “Bioinformatics Sequence and genome analysis”, Cold Spring Harbor Laboratory, 2004."
            ]
        },
        {
            "code": "20XWO8",
            "title": "COMPUTATIONAL FINANCE",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "MATHEMATICAL  PRELIMINARIES:",
                    "content": "Conditional expectation – Sigma Algebra – Filtrations, Stochastic Calculus -  Random walk – Brownian motion – Martingales  – Ito’s Lemma. \t\t\t\t\t(5)"
                },
                {
                    "title": "FINANCIAL DERIVATIVES:",
                    "content": "Law of one price – Risk neutral pricing – Arbitrage and Hedging – Financial Products and capital markets – Futures, Forwards and options – Options pricing  problem. Risk free assets – risky assets.    (8)"
                },
                {
                    "title": "BASIC OPTIONS THEORY:",
                    "content": "Definitions – Pay off diagrams – Single period binomial options theory – Multi period binomial options theory – Real options – American options, Simulation methods for options pricing – Random variable generation – simulation of stochastic processes. Black Schole’s formula. (11)"
                },
                {
                    "title": "PORTFOLIO THEORY:",
                    "content": "Introduction - Portfolio theory with matrix algebra - Review of constrained optimization methods, Markowitz algorithm, Markowitz Algorithm using the solver and matrix algebra – Portfolio choice and linear pricing – Statistical analysis of efficient portfolios. Sharpe’s single index model.\t\t\t(11)"
                },
                {
                    "title": "THE CAPITAL ASSET PRICING (CAP) AND RISK BUDGETING:",
                    "content": "Mean variance portfolio theory – Asset returns – Variance as a risk measure - The one and two fund theorems, The capital market line – CAP  as a pricing formula – Systematic and unsystematic risk – Euler’s theorem – Asset contributions to volatility – beta as a measure of portfolio risk ,  Limitations of mathematical models in finance.\t\t(10)"
                }
            ],
            "references": [
                "1.\tMarek Capinski, Tomasz Zastawniak, “Mathematics for Finance: A Introduction to Financial engineering”, Springer, 2011.",
                "2.\tDavid Ruppert, “Statistics and Data Analysis for Financial Engineering”, Springer-Verlag, 2011.",
                "3.\t Edwin J. Elton, Martin J. Gruber, Stephen J. Brown and William N. Goetzmann “Modern Portfolio Theory and Investment Analysis”, Wiley, 2014.",
                "4.\t Simon Benninga, “Financial Modeling”, MIT Press, 2014.",
                "5.\tSteven E Shreve, “Stochastic  Calculus for Finance – I” , Springer, 2012",
                "6.\tGlasserman Paul, “Monte Carlo Methods in financial Engineering”, Springer Science and Business media, 2013."
            ]
        }
    ],
    "url": "https://amcsregulations.psgtech.ac.in/curriculum/ss/2020/syllabi.html",
    "coordinator": "Dr.Periakaruppan R M"
}