{
    "program_name": "M.Sc Theoretical Computer Science",
    "year": "2023",
    "courses": [
        {
            "code": "23XT11",
            "title": "CALCULUS AND ITS APPLICATIONS",
            "semester": 1,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "LIMITS AND CONTINUITY:",
                    "content": "Standard functions – Graphs - Limit- continuity- piecewise continuity- periodic- differentiable functions - Riemann sum- integrable functions- fundamental theorem of calculus. (4+4)"
                },
                {
                    "title": "SEQUENCES & SERIES:",
                    "content": "Sequences – increasing- decreasing- bounded- function limit properties - Series – convergence and divergence – alternating series test- absolute convergence – ratio test- power series- Taylor series (single variable). (8+6)"
                },
                {
                    "title": "FUNCTIONS OF TWO VARIABLES:",
                    "content": "Models- partial derivative and its geometrical interpretation- Stationary points – maxima and minima- saddle points- Taylor series- Constrained maxima and minima – Lagrange multiplier method. (6+4)"
                },
                {
                    "title": "MULTIPLE INTEGRALS:",
                    "content": "Evaluation of multiple integrals – Cartesian and polar forms- Change of order of integration - Applications of multiple integrals to find area and volume. (9+6)"
                },
                {
                    "title": "ORDINARY DIFFERENTIAL EQUATIONS:",
                    "content": "Linear Differential Equations of first order - Exact differential equations -\n                        Integrating factors - Bernoulli equations - Linear Differential Equations of higher order with constant coefficients - Euler's\n                        equation with variable coefficients - Simultaneous equations - Method of variation of parameters - Modelling simple systems.\n                        (12+8)"
                },
                {
                    "title": "VECTOR CALCULUS:",
                    "content": "Vector differentiation-gradient- divergent- curl- vector integration- Green’s theorem- Stokes theorem-\n                        Gauss divergence theorem (6+2)"
                }
            ],
            "textbooks": [
                "1.\tThomas G B Jr., Maurice D Wier, Joel Hass, Frank R. Giordano, “Thomas’ Calculus”, Pearson Education, 2018.",
                "2.\tErwin Kreyszig, “Advanced Engineering Mathematics”, John Wiley, 2017."
            ]
        },
        {
            "code": "23XT15",
            "title": "ENGLISH FOR PROFESSIONAL SKILLS",
            "semester": 1,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "COMMUNICATION SKILLS USING SCIENTIFIC TEXTS:",
                    "content": "Comprehension and critical evaluation of Scientific Essays – Focus on Language Style, Word Formation, Use of Prefixes and Suffixes, Synonyms, Antonyms, Abbreviations and Acronyms and Technical Vocabulary.(6)"
                },
                {
                    "title": "FOCUS ON GRAMMAR:",
                    "content": "Identifying Common Errors In Articles And Prepositions, Common Errors-Misplaced Modifiers-Tenses-Redundancies And Clichés-Practice Exercises In Common Errors. (6)"
                },
                {
                    "title": "READING:",
                    "content": "Reading and Importance-Techniques Of Effective Reading-Improving Comprehension Skills-Techniques For Good Comprehension-Skimming And Scanning-Comprehension-Intensive And Extensive Reading-Practice In Reading Comprehension.(4)"
                },
                {
                    "title": "WRITING:",
                    "content": "Formal Letters-Letter of Complaint, Requisition Letter- Job Application and Resume- Report Writing- Types Of Reports- Business And Technical Reports.(6)"
                },
                {
                    "title": "FOCUS ON SOFT SKILLS:",
                    "content": "Intra & Interpersonal Communication-Interview Techniques-Etiquette-Body Language-Telephone Conversation. (8)"
                },
                {
                    "title": "PRACTICALS:",
                    "content": "Presentations-Group Discussions-Listening Exercises-Mock Interviews. (15)"
                }
            ],
            "textbooks": [
                "1.\tN.P.Sudharshana, C. Savitha “English for Engineers”, Cambridge University Press, 2018."
            ]
        },
        {
            "code": "23XT12",
            "title": "APPLIED PHYSICS",
            "semester": 1,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "MECHANICS:",
                    "content": "Displacement. First, second and third order time-derivatives of displacement. Concept of generalised\n                    coordinates. Inertial mass, moment of inertia, force, torque. Equilibrium and principle of virtual work. 2D Motion in a\n                    gravitational field. Conservative and non-conservative force-fields. Conservation of momentum. Elastic and inelastic\n                    collisions. Energy loss and deformation in inelastic collisions. Energy absorbed in material fracture. Applications to\n                    packaging, protection and inspection of equipment. (12)"
                },
                {
                    "title": "MECHANICAL OSCILLATIONS",
                    "content": "Hooke’s law. Characteristics of a spring and damper. Differential equation of a spring, mass and damper system and its solution. Natural frequency. Forced oscillations. Frequency response of the system and resonance. Damping and energy dissipation. Application to vibration control and shock absorbers. Considerations for mechanical isolation of equipment. Magneto-rheological fluids and application to adaptive dampers. (12)"
                },
                {
                    "title": "HEAT AND THERMAL CONTROL:",
                    "content": "Temperature, specific heat-capacity. Temperature and temperature gradient in heat\n                        flow. Temperature gradient due to internal and external heat sources. Thermal conductivity. Differential equation of one and\n                        two dimensional heat conduction. Boundary conditions and solutions. Thermal insulation. Principles of convective and\n                        radiative heat transfer. Heat sinks and heat pipes for heat removal from equipment. Forced air convection. (12)"
                },
                {
                    "title": "HYGROMETRY:",
                    "content": "Air and water-vapour mixtures. Saturation and condensation of moisture from air and its relation to\n                        temperature. Dew point. Moisture condensation in electronic equipment and its hazards. Relative humidity. Measurement of\n                        relative humidity by dry and wet bulb methods. Humidity sensors and software support for hygrometry. Need for humidity\n                        control in installations and equipment. Methods to control humidity. Humidifiers, driers and desiccators. (12)"
                },
                {
                    "title": "OPTICS:",
                    "content": "Light propagation through non-homogeneous refractive media. Fermat’s principle and determination of optical\n                        path. Application to light propagation through optical fibres. Numerical aperture. Step-index and graded-index fibres, single\n                        mode and multi-mode fibres. Multiplexing and modulation. Bandwidth advantage. Digital optical communication principles.\n                        Pulse-broadening in digital communication by optical fibres. Signal degradation due to attenuation and dispersion -\n                        Advantages of optical communication. (12)"
                }
            ],
            "textbooks": [
                "1.  Halliday, David, Robert Resnick, and Jearl Walker. Fundamentals of physics,  John Wiley & Sons, 2010",
                "2.  Richard. Wolfson. Essential University Physics with Mastering Physics, Pearson education Limited, 2015",
                "3.\tYoung, Hugh D., Roger A. FreedmanUniversity Physics with Modern Physics Pearson Education, 2017"
            ]
        },
        {
            "code": "23XT13",
            "title": "DIGITAL ELECTRONICS",
            "semester": 1,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "NUMBER SYSTEM:",
                    "content": "Review of number systems-representation-conversions, error detection and error correction.\n                        Representation of unsigned and signed numbers – arithmetic operation on signed numbers -Representation of integer data -\n                        floating point representation of real data-IEEE representation. (11)"
                },
                {
                    "title": "BOOLEAN ALGEBRA AND SIMPLIFICATION TECHNIQUES:",
                    "content": "Review of Boolean algebra - theorems, sum of product and\n                        product of sum simplification, canonical forms-minterm and maxterm, Simplification of Boolean expressions-Karnaugh map,\n                        completely and incompletely specified functions of Boolean expressions - Quine-McCluskey -NAND-NAND realizations. (11)"
                },
                {
                    "title": "COMBINATIONAL LOGIC CIRCUITS:",
                    "content": "Adders, subtractor’s, BCD adder, ripple carry look ahead adders, parity generator,\n                        decoders, encoders, multiplexers, demultiplexers, Realization of Boolean expressions- using decoders-using multiplexers, PAL\n                        and PLA logics. (11)"
                },
                {
                    "title": "SEQUENTIAL CIRCUITS:",
                    "content": "latches, flip flops, edge triggering, asynchronous inputs. Shift registers, Universal shift register,\n                        applications. Binary counters – Synchronous and asynchronous up/down counters, mod-N counter, Counters for random\n                        sequence. (11)"
                },
                {
                    "title": "SYNCHRONOUS CIRCUIT ANALYSIS:",
                    "content": "structure and operation, analysis-transition equations, state tables and state diagrams,\n                        Modelling- Moore machine and Mealy machine- serial binary adder, sequence recognizer, state table reduction, state\n                        assignment. Hazard; Overview and comparison of logic families. (11)"
                },
                {
                    "title": "SIGNALS AND DATA:",
                    "content": "Representation of Analog and Digital signals – Digital /Analog data to Digital/Analog signals conversion\n                        Shift Keying techniques(5)"
                }
            ],
            "textbooks": [
                "1.\tLeach DP, “Digital Principles & Applications”, Tata McGraw Hill, 2011.",
                "2.\tWakerly J F, “Digital Design: Principles and Practices, Prentice-Hall”, 2nd Ed., 2002.",
                "3.  Charles H. Roth, Jr, Larry L.Kinney, “Fundamentals of Logic Design”, Cengage Learning, 2014."
            ]
        },
        {
            "code": "23XT14",
            "title": "PROBLEM SOLVING AND C PROGRAMMING",
            "semester": 1,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "PROBLEM SOLVING:",
                    "content": "Introduction to Problem Solving- Program development- Analyzing and Defining the Problem- Algorithm-Flow\n                        Chart - Programming languages-Types of programming languages- Program Development Environment. (5)"
                },
                {
                    "title": "C LANGUAGE:",
                    "content": "Introduction to C Language - C Character Set - Identifiers and Keywords - Data Types – Literal Constants - Variables\n                        – l-value-r-value - Qualifiers – Modifiers - Operators and Expressions – Type conversions - Library Functions - Data Input and Output Functions – escape sequence characters – Formatted input and output. (6)"
                },
                {
                    "title": "CONTROL STATEMENTS:",
                    "content": "Making Decisions : If Statement – If/else Statement - If/else if Statement – Nested if Statements – dangling\n                        else - Switch Multiple Selection Statement– Repetition : Repetition Essentials - While Loop – do-While Loop – For Loop – Nested\n                        Loops – Breaking out of a Loop Continue statement – goto Statement. (6)"
                },
                {
                    "title": "FUNCTIONS:",
                    "content": "Modular Programming – Function Prototypes - Defining and Calling Functions –Function Call Stack and Activation\n                        Records - Passing Arguments to Functions – Returning a value from a function- Recursion – Recursion vs. Iteration – Scope and\n                        lifetime of variables – Memory layout of a C program - Storage Classes - Auto - Static - Extern and Register Variables. (8)"
                },
                {
                    "title": "ARRAYS:",
                    "content": "Defining Array –Array Initialization - Accessing array elements - Processing arrays - Arrays as function arguments - Multidimensional arrays – Memory address calculation of an array – Row major and column major order - String Handling. (8)"
                },
                {
                    "title": "POINTERS:",
                    "content": "Pointer Variable Definitions and Initializations – Passing Arguments to Functions by address – Pointer Expressions and\n                        Pointer Arithmetic - Relationship between Pointers and Arrays - Pointers and multidimensional arrays –Constant Pointer – Pointer to\n                        Constant –NULL pointer- dangling pointers - Pointers to functions - passing functions to other functions – Introduction to Stack and\n                        Heap Memory - Dynamic Memory Allocation. (10)"
                },
                {
                    "title": "STRUCTURES AND UNIONS:",
                    "content": "Structure Definitions – Initializing Structures – Accessing Structure Members - Processing a structure\n                        - typedef- Structures and pointers - Passing structures to functions – Self-Referential Structures- Bit fields - Unions – Enumeration Constants. (8)"
                },
                {
                    "title": "FILES:",
                    "content": "Files and Streams - Operations on Files – Types of Files, Various Read and Write Functions for Sequential-Access and Random-Access Files -Command Line Arguments. (5)"
                },
                {
                    "title": "PREPROCESSOR DIRECTIVES:",
                    "content": "#include Preprocessor Directive - #define Preprocessor Directive: Symbolic Constants - #define\n                        Preprocessor Directive : Macros - Conditional Compilation. (4)"
                }
            ],
            "textbooks": [
                "1.\tBrian W. Kernighan and Dennis Ritchie, “The C Programming Language”, Pearson Education India, 2015.",
                "2.\tR G Dromey, “How to solve it by computer”, Pearson 2008."
            ]
        },
        {
            "code": "23XT16",
            "title": "APPLIED PHYSICS AND DIGITAL ELECTRONICS LAB",
            "semester": 1,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "APPLIED PHYSICS LABORATORY:",
                    "content": "1.  Determination of the moment of inertia of a flywheel.\n                        2.  Verification of Hooke's law using spring-mass system.\n                        3.  Determination of thermal conductivity of bad conductor - Lee's disc method.\n                        4.  Determination of thermal conductivity of good thermal conductor-Forbes method.\n                        5.  Determination of the relative humidity by using wet and dry bulb hygrometer.\n                        6.  Determination of refractive index of liquids using hollow prism.\nDIGITAL ELECTRONICS LABORATORY:\n                        1. Study of basic logic gates and realization of logic gates using universal gates.\n                        2. Verification of Boolean expression using logic gates.\n                        3. Binary to gray and gray to binary conversion\n                        4. Half and full adder / subtractor.\n                        5. Encoder and decoder.\n                        6. Multiplexer and demultiplexer.\n                        7. S-R and D- flip flop using NOR and NAND gates.\n                        8. Binary decade counter."
                }
            ]
        },
        {
            "code": "23XT17",
            "title": "C PROGRAMMING LAB",
            "semester": 1,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "APPLIED PHYSICS LABORATORY:",
                    "content": "1. Simple programs to understand the concepts of data types.\n                        2. Familiarizing conditional, control and repetition statements.\n                        3. Usage of single and double dimensional arrays including storage operations.\n                        4. Implementation of functions, recursive functions.\n                        5. Defining and handling structures, array of structures and union.\n                        6. Implementation of pointers, operation on pointers dynamic storage allocation.\n                        7. Creating and processing data files."
                }
            ]
        },
        {
            "code": "23XT18",
            "title": "MATHEMATICS LABORATORY",
            "semester": 1,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "SageMath will be used for demonstrations",
                    "content": "Hands-on experiments and models include fundamental mathematical concepts given below but not limited to. Open-source mathematics software\n                        ."
                },
                {
                    "title": "CALCULUS:",
                    "content": "Sequences, golden ratio, Shortest Distance Problem, Brachistochrone Problem, Riemann sum for double and triple integrals, extrema\n                        and saddles, rate of change, Mobius strip, Visualization of vectors."
                },
                {
                    "title": "GEOMETRY:",
                    "content": "Curve drawing, conics and properties using string art, spirals in nature, trajectories, tiling and tessellations, packing objects, polygons, polyhedrons, plane partition using polygons and nearest neighbor, origami, geometric folding and optimization."
                },
                {
                    "title": "COMBINATORICS:",
                    "content": "Pigeon hole principle, permutations, combinations, induction, recurrences, probability examples using cards and dice, counting symmetries, graph - structures, game of maze, cops and robbers, pebbling and rubbling."
                },
                {
                    "title": "ALGEBRA:",
                    "content": "Graphing Functions, solving 2D and 3D linear equations and inequalities, symmetric groups, logical gates using simple circuits, counting operations – ordinary vs Strassen matrix multiplication."
                }
            ],
            "references": [
                "1. Adrian Y E O, “The Pleasures of Pi, e and Other Interesting Numbers”, World Scientific, 2006.",
                "2. Akiyama Jin, “A Day's Adventure in Math Wonderland”, World Scientific, 2008.",
                "3. Alfred S Posamentier and Stephen Krulik, “Strategy Games to Enhance Problem-Solving Ability in Mathematics”, World Scientific, 2017.",
                "4. Erik D. Demaine and Joseph O'Rourke, “Geometric Folding Algorithms: Linkages, Origami, Polyhedra”, Cambridge University Press,",
                "5. Ian Stewart, “The Beauty of Numbers in Nature: Mathematical Patterns and Principles from the Natural World”, The MIT Press, 2017.",
                "6. Jay Kappraff , “The Geometric Bridge between Art and Science”, World Scientific, 2001.",
                "7. Jon Millington, “Curve Stitching: Art of Sewing Beautiful Mathematical Patterns”, Tarquin Group, 1999.",
                "8. Miklós Bóna, “A Walk Through Combinatorics: An Introduction to Enumeration and Graph Theory”, World Scientific, 2016."
            ]
        },
        {
            "code": "23XT21",
            "title": "DISCRETE STRUCTURES",
            "semester": 2,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "MATHEMATICAL LOGIC:",
                    "content": "Proposition - Logical operators - Truth tables – Laws of Logic – Equivalences – Normal forms - Rules of\n                        inference - Validity of arguments – Consistency of specifications – Propositional Calculus – Quantifiers and universe of discourse. (10+7)"
                },
                {
                    "title": "PROOF TECHNIQUES:",
                    "content": "Methods of proving theorems – Direct proofs, Indirect proofs – Mathematical induction – Strong\n                        mathematical induction and Well ordering principle. (6+4)"
                },
                {
                    "title": "RELATIONS AND FUNCTIONS:",
                    "content": "Binary relations, Properties and Representation of Relations – Closures of Relations –\n                        Composition of Relations – Equivalence Relations– Partial Orderings – Partitions and Covering of Sets, Hasse Diagrams, n-ary\n                        Relations and their Applications. Functions - Injective, Subjective, Bijective, Composition, and Inverse. (10+7)"
                },
                {
                    "title": "COMBINATORICS:",
                    "content": "Basics of counting – Principle of inclusion and exclusion, Pigeonhole principle. Permutations and\n                        Combinations without repetition, Permutations and Combinations with repetition, Permutations with Indistinguishable Objects,\n                        Distributing Objects into Boxes, Generating permutations and combinations in lexicographic order. (8+4)"
                },
                {
                    "title": "RECURRENCE RELATIONS:",
                    "content": "RELATIONS: Recurrence Relation Models- Solving linear homogeneous recurrence relations with constant\n                        coefficients, Solving linear non-homogeneous recurrence relations by the method of characteristic roots. (5+4)"
                },
                {
                    "title": "LATTICES:",
                    "content": "Lattices as partially ordered set – Properties of Lattices– Lattices as algebraic system - Sub lattices – Direct\n                        product and Homomorphism – Some special lattices. (6+4)"
                }
            ],
            "textbooks": [
                "1.\tKenneth H Rosen, “Discrete Mathematics and its Application”, McGraw Hill, 2021.",
                "2.  Tremblay J P and Manohar R, “Discrete Mathematical Structures with application to Computer Science”, Tata McGraw Hill, 2011."
            ]
        },
        {
            "code": "23XT22",
            "title": "ABSTRACT ALGEBRA",
            "semester": 2,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "GROUPS:",
                    "content": "Introduction to algebraic structures. Groups- Definition and examples, properties of groups, Permutation Groups,\n                        Symmetric Groups, Cyclic Groups, Check digit scheme. (12)"
                },
                {
                    "title": "SUBGROUPS AND NORMAL SUBGROUPS:",
                    "content": "Subgroups – Definition, Cosets and Lagrange’s theorem, Homomorphism,\n                        Isomorphism, Automorphism – Cayley’s theorem – Normal subgroups – Factor group – Fundamental theorem of group\n                        homomorphism. (12)"
                },
                {
                    "title": "GROUP CODING:",
                    "content": "Coding of Binary information and Error detection – Group codes – Decoding and Error correction. (8)"
                },
                {
                    "title": "RINGS:",
                    "content": "Definition - Properties – Subrings, Ring of Quaternions, Integral domain - Homomorphism – Ideals and Quotient Rings\n                        – Euclidean ring - Unique factorization theorem, Domain of Gaussian Integers - Polynomial Rings – Properties, Division\n                        Algorithm, Factorization of Polynomials-Primitive polynomials. (14)"
                },
                {
                    "title": "FIELDS:",
                    "content": "Definition – subfields - Finite fields – structure of Finite field, GF(2n).(7)"
                },
                {
                    "title": "GEOMETRIC CONSTRUCTIONS:",
                    "content": "Constructible numbers, Angles, tri-sectors, circle-squarers.(7)"
                }
            ],
            "textbooks": [
                "1. Herstein I N., “Topics in Algebra ”, John Wiley, 2022.",
                "2. Joseph A. Gallian, “Contemporary Abstract Algebra”, Chapman and Hall, 2021.",
                "3. Humphreys, J. F and Prest, M. Y. \"Numbers, Groups and Codes\" Cambridge University Press, 2018."
            ]
        },
        {
            "code": "23XT23",
            "title": "DATA STRUCTURES AND ALGORITHMS",
            "semester": 2,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Primitive Data Structures - Abstract Data Types - Analysis of algorithms – Best and worst case time complexities – Asymptotic notation - Growth of functions (4)"
                },
                {
                    "title": "ARRAYS:",
                    "content": "Operations and Implementation– Linear search, non-recursive binary search – Sparse matrices – Operations. (4)"
                },
                {
                    "title": "STACKS:",
                    "content": "Primitive operations - Sequential implementation - Applications: Recursive functions, Expression processing and parentheses matching. (6)"
                },
                {
                    "title": "QUEUES:",
                    "content": "Primitive operations - Sequential implementation – Linear queue-Circular queue-Priority queues – Double ended queues– Applications. (4)"
                },
                {
                    "title": "LISTS:",
                    "content": "Primitive operations - Singly linked lists, Doubly linked lists, Circular lists, Multiply linked lists - Application: Addition of Polynomials – Linked Stacks - Linked queues - Linked priority queues. (8)"
                },
                {
                    "title": "TREES:",
                    "content": "Terminologies – Binary tree - Sequential and linked representation - Traversals - Expression trees - Infix, Postfix and Prefix expressions - Threaded trees – Heaps - Max heap, Min heap and their operations. (8)"
                },
                {
                    "title": "GRAPHS:",
                    "content": "Terminologies– Representations using Adjacency matrix, adjacency list - Graph Traversal Algorithms - Breadth first and Depth first - Time complexity Analysis. (8)"
                },
                {
                    "title": "SORTING:",
                    "content": "Insertion Sort, Selection Sort, Bubble Sort, Heap Sort, Radix Sort – Algorithms and their time complexity. (6)"
                }
            ],
            "textbooks": [
                "1.\tYedidyah Langsam, Moshe J Augenstein and Aaron M Tenenbaum, \"Data structures using C and C++\", Prentice Hall, 2016.",
                "2.\tSartaj Sahni, \"Data Structures, Algorithms and Applications in C++\", Silicon Press, 2013.",
                "3.\tMichael T. Goodrich, Roberto Tamassia and David Mount, “ Data Structures and Algorithms in C++”, John Wiley, 2016."
            ]
        },
        {
            "code": "223XT24",
            "title": "OBJECT ORIENTED PROGRAMMING",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "PRINCIPLES OF OBJECT ORIENTED PROGRAMMING:",
                    "content": "Software crisis Software Evolution - Procedure Oriented\n                        Programming - Object Oriented Programming Paradigm - Basic Concepts and Benefits of OOP - Object Oriented\n                        Programming Language- Application of OOP - Structure of C++ - Tokens, Expressions and Control Structures -\n                        Operators in C++ - Manipulators (6)"
                },
                {
                    "title": "FUNCTIONS IN C++:",
                    "content": "Function Prototyping - Call by Reference - Return by reference - Inline functions - Default, Const\n                        Arguments - Function - Overloading - Friend and Virtual Functions - Classes and Objects - Member functions -\n                        Nesting of Member functions - Private member functions - Memory allocation for Objects - Static data members -\n                        Static Member Functions - Arrays of Objects - Objects as Function Arguments - Friend Functions - Returning Objects -\n                        Const Member functions - Pointers to Members. (10)"
                },
                {
                    "title": "CONSTRUCTORS:",
                    "content": "Parameterized Constructors - Multiple Constructors in a Class - Constructors with Default Arguments -\n                        Dynamic Initialization of Objects - Copy and Dynamic Constructors – Destructors overloading. (5)"
                },
                {
                    "title": "OPERATOR OVERLOADING:",
                    "content": "Overloading Unary and Binary Operators - Overloading Binary Operators using Friend\n                        functions – Operator Type conversion. (5)"
                },
                {
                    "title": "INHERITANCE:",
                    "content": "Defining Derived Classes - Single Inheritance - Making a Private Member Inheritable - Multiple Inheritance\n                        - Hierarchical Inheritance - Hybrid Inheritance - Virtual Base Classes - Abstract Classe - Constructors in Derived Classes-\n                        Member Classes - Nesting of Classes -Composition -Aggregation. (10)"
                },
                {
                    "title": "POLYMORPHISM:",
                    "content": "Basics of polymorphism – Types of polymorphism - Compile and Run Time Polymorphism - Virtual\n                        function – Object Slicing – Virtual Destructor – Dynamic binding. (4)"
                },
                {
                    "title": "TEMPLATES & EXCEPTION HANDLING:",
                    "content": "Introduction to Templates, Generic Functions and Generic Classes – Exception\n                        Handling – Examples. (4)"
                },
                {
                    "title": "STREAMS:",
                    "content": "String I/O -Character I/O - Object I/O - I/O with multiple Objects - File pointers - Disk I/O with member functions. (3)"
                }
            ],
            "textbooks": [
                "1. Bjarne Stroustrup, “The C++ Programming Language”, Pearson, 2014.",
                "2. Stanley B Lippman, JoseeLajoie, Barbara E. Moo, “The C++ Primer”, Addison Wesley, 2013."
            ]
        },
        {
            "code": "23XT25",
            "title": "TRANSFORMS AND ITS APPLICATIONS",
            "semester": 2,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "TRANSFORM METHODS:",
                    "content": "Concept of Transformation - Examples - Integral Transforms. (2+1)"
                },
                {
                    "title": "LAPLACE TRANSFORM:",
                    "content": "TRANSFORM: Definition - Transform of standard functions - Transform of special function- unit step function -\n                        Dirac delta function – Transform of derivatives and integrals -Transform of Periodic functions - Inverse Laplace transform-\n                        Convolution Theorem – Solving ordinary linear differential equations with constant coefficient – Solving integral equations\n                        by Laplace transform technique. (10+7)"
                },
                {
                    "title": "FOURIER SERIES:",
                    "content": "Dirichlet’s conditions – statement of Fourier theorem – Fourier coefficients – change of scale - Even\n                        and odd functions - Half -range sine and cosine series – RMS value - Parseval’s theorem. (6+4)"
                },
                {
                    "title": "FOURIER TRANSFORM:",
                    "content": "Fourier integrals - Fourier transform- Fourier sine and cosine transform - Transforms of standard\n                        functions - Properties, Convolution theorem. (6+4)"
                },
                {
                    "title": "DISCRETE FOURIER TRANSFORM:",
                    "content": "Discrete Convolution – Periodic sequence and circular convolution – Discrete Fourier\n                        Transform Fast Fourier Transforms – decimation–in-time algorithm – Decimation-in-frequency algorithm – Computation of\n                        inverse DFT. (6+4)"
                },
                {
                    "title": "Z-TRANSFORM:",
                    "content": "Transform of standard functions - inverse Z-transform – properties of Z – transform – Difference\n                        equations – Modelling and solution of difference equations. (6+4)"
                }
            ],
            "textbooks": [
                "1. Erwin Kreyszig, “Advanced Engineering Mathematics”, John Wiley, 2017.",
                "2. Ray Wylie C, Louis C Barret , ‘Advanced Engineering Mathematics”, McGraw Hill, 2013."
            ]
        },
        {
            "code": "23XT26",
            "title": "DATA STRUCTURES LAB",
            "semester": 2,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "23XT27",
            "title": "OBJECT ORIENTED PROGRAMMING LAB",
            "semester": 2,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "23XT28",
            "title": "PYTHON PROGRAMMING LAB",
            "semester": 2,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "23XT31",
            "title": "LINEAR ALGEBRA",
            "semester": 3,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "SYSTEM OF LINEAR EQUATIONS:",
                    "content": "System of linear equations, Gauss – elimination, Gauss-seIdal method- Application of Linear\n                        systems. (5+3)"
                },
                {
                    "title": "VECTOR SPACES:",
                    "content": "Vector spaces and subspaces – Span, Linear independence and dependence– Basis and dimension - Row space, Column space, and Null space– Rank and nullity- Change of basis– Similarity - Isomorphism. (10+7)"
                },
                {
                    "title": "INNER PRODUCT SPACES:",
                    "content": "Inner products, Length and Angle in inner product spaces - Orthonormal bases, Gram Schmidt process - Orthogonal matrices- QR decomposition - Best Approximation and Least-squares. (10+7)"
                },
                {
                    "title": "LINEAR TRANSFORMATION:",
                    "content": "Introduction to linear transformations – General Linear Transformations – Kernel and range – Matrices of general linear transformation- Geometry of linear operators. (6+4)"
                },
                {
                    "title": "SPARSE MATRICES:",
                    "content": "Introduction – Storage Schemes – Basic sparse matrix operations – Sparse direct solutions – random walk problems. (4+2)"
                },
                {
                    "title": "EIGEN VALUES AND EIGEN VECTORS:",
                    "content": "Introduction to Eigen values Eigen vectors, Complex Eigen values, - Diagonalization - Orthogonal diagonalization- Positive definite matrices - Quadratic forms - Quadric surfaces - Singular value decomposition. Applications to differential equations, dynamical systems. (10+7)"
                }
            ],
            "textbooks": [
                "1. Howard Anton and Chris Rorres, “Elementary Linear Algebra”, Wiley, 2017.",
                "2. David C. Lay, “Linear Algebra and its Applications’, Pearson Education, 2016."
            ]
        },
        {
            "code": "23XT32",
            "title": "GRAPH THEORY",
            "semester": 3,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "BASIC CONCEPTS:",
                    "content": "Graphs - directed and undirected, subgraphs, graph models, degree of a vertex, degree sequence, Havel-Hakimi theorem,Hand-shakinglemma.Connectivity,walk,path,distance,diameter. Isomorphicgraphs. Commonclassesofgraphs–regular, complete, Petersen, cycle, path, tree, k-partite, planar, hypercube. Spanning trees – Matrix tree theorem, graph decomposition. (14)"
                },
                {
                    "title": "CONNECTIVITY:",
                    "content": "Vertex and edge connectivity, Vertex and edge cuts, relationship between vertex and edge connectivity, bounds for connectivity. Harary’s construction of k-connected graphs. (10)"
                },
                {
                    "title": "EULERIAN AND HAMILTONIAN GRAPHS:",
                    "content": "Eulerian graphs, Route inspection problem, Hamiltonian graphs, Dirac’s and Ore’s\n                        theorems, Gray codes. (10)"
                },
                {
                    "title": "MATCHING, VERTEX-COLORING AND DOMINATION:",
                    "content": "Matching, Berge theorem, Perfect matching - Tutte’s theorem, Bipartite matching, Hall’s theorem- Vertex-coloring –chromatic number, upper and lower bounds, Welsh – Powell theorem, Largest degree first\n                        and Sequential vertex coloring algorithms. Dominating set, domination number and bounds. Types – total, independent, bipartite, connected, distance dominations. Applications of the above concepts to networks. (14)"
                },
                {
                    "title": "SPARSE MATRICES:",
                    "content": "Introduction – Storage Schemes – Basic sparse matrix operations – Sparse direct solutions – random walk problems. (4+2)"
                },
                {
                    "title": "RANDOM GRAPHS:",
                    "content": "Random graph – Definitions of G(n, p) and G(n, M) models. Ramsey number – definition, Erdos theorem. n- existentially closed graphs, asymptotically almost surely graphs and their existence theorem. Web graph models, applications to social and biological networks. (12)"
                }
            ],
            "textbooks": [
                "1. Anthony Bonato, “A Course on Web Graphs”, American Mathematical Society, 2008.",
                "2. Jonathan Gross and Jay Yellen, “Graph Theory and its Applications”, CRC Press, 2006.",
                "3. Balakrishnan R and Ranganathan, K, “A Textbook of Graph Theory”, Springer-Verlag, 2019."
            ]
        },
        {
            "code": "23XT33",
            "title": "PROBABILITY AND STATISTICS",
            "semester": 3,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "SAMPLE SPACE AND PROBABILITY:",
                    "content": "Sets, probabilistic models, conditional probability, total probability theorem and Bayes’ rule,\n                        independence, gamblers ruin problem. (6+4)"
                },
                {
                    "title": "DISCRETE RANDOM VARIABLES:",
                    "content": "Random variables concept- Probability mass function. Expectation, mean, and variance. Bernoulli, Binomial, Poisson and Geometric random variables. Joint probability mass function of multiple random variables, conditioning, independence. (6+4)"
                },
                {
                    "title": "CONTINUOUS RANDOM VARIABLES:",
                    "content": "Probability density function, cumulative distribution function, Uniform, Normal, Exponential, Weibull, and Gamma random variables. Joint probability density function of multiple random variables, conditioning, continuous Bayes’ rule. Sums of independent random variables, convolution, covariance, correlation, and conditional expectation. (6+4)"
                },
                {
                    "title": "LIMIT THEOREMS:",
                    "content": "Markov and Chebyshev inequalities, Weak Law of Large Numbers, Convergence in probability, Central Limit Theorem, Strong Law of Large Numbers. (5+3)"
                },
                {
                    "title": "SIGNIFICANCE OF EVIDENCE:",
                    "content": "Significance, p-values, comparing the mean of two populations, other useful tests of significance. (6+4)"
                },
                {
                    "title": "INFERRING PROBABILITY MODELS FROM DATA:",
                    "content": "Estimating model parameters with Maximum Likelihood, incorporating priors\n                        with Bayesian inference, Bayesian inference for Normal distributions.(6+4)"
                },
                {
                    "title": "REGRESSION:",
                    "content": "Regression to make predictions, to spot trends, linear regression and least squares, Producing Good Linear Regressions. (4+3)"
                }
            ]
        },
        {
            "code": "23XT34",
            "title": "ADVANCED DATA STRUCTURES",
            "semester": 3,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Review of analysis of algorithms – Average case time complexity- Amortized time complexity. (4)"
                },
                {
                    "title": "HASH TABLES:",
                    "content": "Dictionaries – Dictionary ADT, Hash functions – Collision handling schemes - Separate chaining, Linear probing,\n                        Quadratic probing, Double Hashing – Load factor and rehashing-Analysis . (8)"
                },
                {
                    "title": "BINARY SEARCH TREES:",
                    "content": "Searching – Insertion and deletion of elements – randomly built binary search trees- Analysis. (4)"
                },
                {
                    "title": "AVL TREES:",
                    "content": "Height – Searching – insertion and deletion of elements- AVL rotations – analysis. (5)"
                },
                {
                    "title": "RED BLACK TREES:",
                    "content": "Searching, Insertion and Deletion Operations – Analysis (4)"
                },
                {
                    "title": "MULTIWAY SEARCH TREES:",
                    "content": "Indexed Sequential Access – m-way search trees – B-Tree – height-Searching, Insertion and deletion\n                        - B+ trees –kd trees-quad trees-Tries - dictionary applications-analysis. (14)"
                },
                {
                    "title": "PRIORITY QUEUES (HEAPS):",
                    "content": "d-Heaps- Leftist Heaps - Leftist Heaps property and operations: Skew Heaps- Fibonacci heap. (8)"
                },
                {
                    "title": "DATA STRUCTURES FOR DISJOINT SETS:",
                    "content": "Disjoint set operations-linked list representation of disjoint sets, disjoint set forests, tree representation, union by rank, find by path compression - analysis (10)"
                }
            ],
            "textbooks": [
                "1. Thomas H Cormen, Charles E Leiserson and Ronald L Rivest, “Introduction to Algorithms”, MIT Press, 2015.",
                "2. Mark Allen Weiss, “Data Structures and Algorithm Analysis in C++”, Addison-Wesley, 2014."
            ]
        },
        {
            "code": "23XT35",
            "title": "COMPUTER ORGANIZATION AND ASSEMBLY LANGUAGE PROGRAMMING",
            "semester": 3,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Basic principles - Functional components of a computer system- CPU, Storage, I/O, Multimedia devices - Workstations, Servers,-Interaction among functional components -Bus organization -Data representation- Integer and floating point representation. (6)"
                },
                {
                    "title": "PROGRAM EXECUTION:",
                    "content": "Processing of High Level Language Code-Assembler- Code generation,-Application binary interface-- Instruction set architecture of a simple CPU - Microarchitecture of CPU, Instruction codes-The hardware-software interface -Hardware\n                        features influenced by software requirements - Specifications of the performance of a system. (6)"
                },
                {
                    "title": "BASIC PROCESSING UNIT:",
                    "content": "Fundamental Concepts-- Computer registers -Register transfer language -Generation and Execution of\n                        machine code- Hardware Components-Instruction Fetch and Execution Steps-Control Signals - Hardwired Control Processors (6)"
                },
                {
                    "title": "MEMORY SYSTEM :",
                    "content": "Basic Concepts- Internal Organization of Memory - Semiconductor RAM Memories - Static and Dynamic\n                        RAMs - Read-only Memories - Flash Memory - Direct Memory Access - Cache Memories - Performance Considerations - Caches\n                        on the Processor Chip – Cache coherence - Virtual Memory – Segmentation. (8)"
                },
                {
                    "title": "PIPELINING",
                    "content": "Basic Concept of pipelining - Pipeline Organization - Pipelining Issues - Data Dependencies - Operand Forwarding -\n                        Handling Data Dependencies in Software - Memory Delays- Branch Delays - Branch Prediction -Resource Limitations -Performance Evaluation. (6)"
                },
                {
                    "title": "PARALLEL PROCESSING AND PERFORMANCE:",
                    "content": "Fylnns taxonomy- Classification – Instruction level parallelism and its exploitation\n                        - Data Level parallelism –Thread Level parallelism- Hardware multithreading – Multicore processors - Instruction Exceptions.-CISC\n                        and RISC Processors- instruction set architecture of x86. (6)"
                },
                {
                    "title": "INPUT/OUTPUT INTERFACES:",
                    "content": "Bus Structure - Operation - Synchronous and Asynchronous Bus - FireWire - PCI Bus - SCSI Bus\n                        - SATA - SAS - PCI Express - Interface Circuits- Parallel/Serial /Universal Serial Bus (USB) Program-Controlled I/O - I/O Interrupts -\n                        Handling Multiple Devices - Exception handling. (7)"
                }
            ],
            "textbooks": [
                "1. Computer Architecture and Organization Designing for Performance, William Stallings, Pearson Education series, 2014.",
                "2. Computer Organization and Design :The Hardware/Software Interface, David A. Patterson and John L. Hennessy, Morgan Kaufmann, 2013",
                "3. Morris Mano, \"Computer Systems Architecture\", Pearson Education, 2014.",
                "4. Barry B. Brey, \"The Intel Microprocessors - 8086/88, and 80186, 80286, 80386, and 80486\", Pearson Education, 2009."
            ]
        },
        {
            "code": "23XT36",
            "title": "STATISTICAL COMPUTING AND R PROGRAMMING LAB",
            "semester": 3,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "23XT37",
            "title": "ADVANCED DATA STRUCTURES LAB",
            "semester": 3,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "23XT38",
            "title": "ASSEMBLY LANGUAGE PROGRAMMING LAB",
            "semester": 3,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "Practice problems on",
                    "content": ""
                }
            ]
        },
        {
            "code": "23XT41",
            "title": "STOCHASTIC PROCESSES",
            "semester": 4,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "STOCHASTIC PROCESSES:",
                    "content": "Introduction – Definition- Classification of Stochastic Processes. (2)"
                },
                {
                    "title": "DISCRETE TIME MARKOV CHAIN:",
                    "content": "Transition Probability Matrices – Chapman Kolmogorov Equations - Classification of States – Limit\n                        Theorems – Branching Processes – Time Reversible Markov chains – Markov Decision Processes - Applications. (9+7)"
                },
                {
                    "title": "CONTINUOUS TIME MARKOV CHAINS:",
                    "content": "Introduction – Poisson Process - Birth and Death Processes – Kolmogorov Differential Equations – Pure Birth Process - Pure Death Process - Applications. (9+6)"
                },
                {
                    "title": "RENEWAL THEORY:",
                    "content": "Introduction – Distribution - Renewal Theorems - Residual and Excess Life Times -Alternating Renewal Process - Renewal Reward Processes – Regenerative Processes. (8+6)"
                },
                {
                    "title": "GENERAL QUEUEING MODELS:",
                    "content": "Single and Multi server Poisson Queues - Single Server Queue with Poisson input and general service M / G/1 – General input and exponential service – G/M/1 Queueing model. (8+6)"
                },
                {
                    "title": "BROWNIAN MOTION:",
                    "content": "First Passage time distribution – The maximum of a Brownian Motion – The Zeros of Brownian Motion – Brownian Motion with Drift - Geometric Brownian Motion. (9+5)"
                }
            ],
            "textbooks": [
                "1. Mark A Pinsky, Samuel Karlin, “An Introduction to Stochastic Modelling”, Academic Press, 2011.",
                "2. Nicolas Privault, “Understanding Markov Chains”, Springer, 2018.",
                "3. Roy D.Yates and David J. Goodman, “Probability and Stochastic Processes – A friendly Introduction for Electrical and Computer Engineers”, John Wiley & Sons, 2014."
            ]
        },
        {
            "code": "23XT42",
            "title": "DATABASE DESIGN",
            "semester": 4,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "BASIC CONCEPTS:",
                    "content": "Introduction to databases – Conventional file processing – Characteristics of a database – Data Models – Data abstraction - DBMS Architecture– Data Independence – Database Languages – Database System Environment – Advantages and disadvantages of DBMS – Users of DBMS. (5)"
                },
                {
                    "title": "DATA MODELING:",
                    "content": "Introduction – entities, attributes, relationships – Structural and participation constraints – High Level conceptual\n                        data model - ER Diagrams (ERD) – Specialization and Generalization Constraints – Enhanced ER diagrams (EER) – Mapping of ER/EER into Relational Schema (6)"
                },
                {
                    "title": "RELATIONAL MODEL AND CONSTRAINTS:",
                    "content": "Introduction – Relational data model – Data Integrity Constraints – Introduction to Relational Algebra – Relational algebra queries. (4)"
                },
                {
                    "title": "RELATIONAL DATABASE MANIPULATION:",
                    "content": "Structured Query Language (SQL) - Basic data retrieval – SQL Joins – SQL complex queries – Views – Advanced SQL (5)"
                },
                {
                    "title": "FILE ORGANIZATION :",
                    "content": "Storage device characteristics – Constituents of a file – Operations on file - Serial files – Sequential files – Hashing techniques - Index Sequential files – Direct files – Primary, secondary and cluster indexes – Indexing using Tree structures. (6)"
                },
                {
                    "title": "DATA BASE DESIGN:",
                    "content": "Functional dependencies – Normal forms based on primary keys – First, Second and Third Normal forms - Boyce Codd Normal form - Multivalued dependencies – Fourth Normal form - Decomposition Algorithms for relational database design.\t(6)"
                },
                {
                    "title": "QUERY PROCESSING AND OPTIMIZATION:",
                    "content": "Query processing - Query execution concepts – Query Optimization Techniques - Physical database design – Database tuning.(5)"
                },
                {
                    "title": "TRANSACTION AND SECURITY MANAGEMENT:",
                    "content": "Introduction - Serializability and concurrency control – Locking techniques -\n                        Times Stamping Method – Deadlock - Recovery Techniques - Security and Integrity threats – Access Controls and Defense mechanisms. (8)"
                }
            ],
            "textbooks": [
                "1. Elmasri R and Navathe SB, “Fundamentals of Database Systems”, Pearson Education, 2016.",
                "2. Silberschatz A, Korth H and Sudarshan S, “Database System Concepts”, McGraw Hill, 2011."
            ]
        },
        {
            "code": "23XT43",
            "title": "OPTIMIZATION TECHNIQUES",
            "semester": 4,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "LINEAR PROGRAMMING:",
                    "content": "Linear programming model - Graphical solution for two dimensional problems –Simplex method, Special cases in the Simplex method - Two phase simplex method – Revised Simplex method \t(7)"
                },
                {
                    "title": "DUALITY AND POST-OPTIMAL ANALYSIS:",
                    "content": "Dual problem, Primal – Dual relationships, Economic interpretation of Duality, Dual Simplex algorithm, Post optimal analysis (7)"
                },
                {
                    "title": "TRANSPORTATION MODEL AND ITS VARIANTS:",
                    "content": "Transportation problem and its solution – Travelling salesman problem - Assignment problem and its solution by Hungarian method. (7)"
                },
                {
                    "title": "INTEGER PROGRAMMING:",
                    "content": "Gomory cutting plane methods for all integer and mixed integer programming problems - Branch and\n                        Bound method (Land – Dolg and Dakin algorithms) (7)"
                },
                {
                    "title": "DYNAMIC PROGRAMMING:",
                    "content": "Principle of Optimality – Backward and forward induction methods-– Shortest path network problems – Cargo loading model. (5)"
                },
                {
                    "title": "NON LINEAR PROGRAMMING:",
                    "content": "Karush-Kuhn-Tucker conditions – Univariate and Pattern search method – Steepest descent and Conjugate gradient method. (7)"
                },
                {
                    "title": "CONVEX OPTIMIZATION:",
                    "content": "Convex optimization problems- linear and quadratic programs; quasi-convex optimization problems. (5)"
                }
            ]
        },
        {
            "code": "23XT44",
            "title": "OPERATING SYSTEMS",
            "semester": 4,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Abstract view of an operating system - Operating Systems Objectives and Functions – Evolution of Operating\n                        Systems - Dual-mode operation - System calls- Structure of Operating System. (3)"
                },
                {
                    "title": "PROCESS DESCRIPTION AND CONTROL:",
                    "content": "Process concepts - Process Creation – Process Termination - Process states - Process Description – Process Control. (5)"
                },
                {
                    "title": "PROCESS AND THREADS:",
                    "content": "Relationship between process and threads – Thread States – Thread Synchronization – Types of Thread\n                        – Multithreading model. (6)"
                },
                {
                    "title": "PROCESS SCHEDULING:",
                    "content": "Scheduling basics - CPU-I/O interleaving- (non-)preemption - context switching- Types of Scheduling – Scheduling Criteria - Scheduling Algorithms – Algorithm evaluation – Real-time scheduling. (5)"
                },
                {
                    "title": "PROCESS SYNCHRONIZATION:",
                    "content": "Concurrent Process – Principles of Concurrency – Race Condition - Mutual Exclusion – Critical\n                        section problems – Software support – Hardware Support – Operating System Support: Semaphore, Monitor – Classical problems of synchronization – Synchronization examples. (8)"
                },
                {
                    "title": "DEADLOCK:",
                    "content": "Principles- Characterization – Methods for handling deadlock - Deadlock prevention, Avoidance, Detection, and recovery. (4)"
                },
                {
                    "title": "MEMORY MANAGEMENT:",
                    "content": "Memory hierarchy –Memory Management requirements - Memory partitioning: Fixed partitioning,\n                        Dynamic partitioning, Buddy systems – Simple paging – Page table structures – Simple Segmentation – segmentation and paging. (8)"
                },
                {
                    "title": "TRANSACTION AND SECURITY MANAGEMENT:",
                    "content": "Introduction - Serializability and concurrency control – Locking techniques -\n                        Times Stamping Method – Deadlock - Recovery Techniques - Security and Integrity threats – Access Controls and Defense mechanisms. (8)"
                },
                {
                    "title": "VIRTUAL MEMORY MANAGEMENT:",
                    "content": "Need for Virtual Memory management – Demand Paging –Copy on write -Page Fault handling\n                        - Page replacement - Frame allocation- Thrashing - working set model. (6)"
                },
                {
                    "title": "I/O MANAGEMENT AND DISK SCHEDULING:",
                    "content": "Organization of I/O function – Evolution of I/O function – Types of I/O devices –\n                        Logical Structure of I/O functions – I/O Buffering – Disk I/O – Disk Scheduling algorithms – RAID - Disk Cache. (5)"
                },
                {
                    "title": "FILE SYSTEM MANAGEMENT:",
                    "content": "Files – Access methods - File system architecture – Functions of file management –Directory and\n                        disk structure -Mounting - File sharing –File system implementation – Directory implementation - File Allocation – Free space management. (5)"
                },
                {
                    "title": "VIRTUALIZATION:",
                    "content": "Requirements for Virtualization - Type 1, Type 2 Hypervisors – Paravirtualization- Memory Virtualization - I/O Virtualization - Virtual machines on Multicore CPUs–Virtualization in Multiprocessor environment. (5)"
                }
            ],
            "textbooks": [
                "1. Silberschatz A, Galvin, PB. and Gagne, G. “Operating System Concepts”, John Wiley & Sons, Inc.,2018.",
                "2. William Stallings, “Operating Systems: Internals and Design Principles”, Pearson Education, 2017.",
                "3. Andrew S Tanenbaum, \"Modern Operating System\", Prentice Hall,2018."
            ]
        },
        {
            "code": "23XT45",
            "title": "COMPUTER NETWORKS",
            "semester": 4,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Network goals - Applications of Networks - Design issues for the layers - OSI Reference Model - Types of Network\n                        - Network Topologies- Analog and Digital data transmission- Data encoding- Bandwidth and data rate-.Bit Rate, Baud Rate- Sampling\n                        Rate. (5)"
                },
                {
                    "title": "DATA COMMUNICATION:",
                    "content": "Multiplexing - Synchronous and Asynchronous TDM – FDM –CDM - Switching, Circuit Switching, Packet Switching (3)"
                },
                {
                    "title": "TRANSMISSION OF DIGITAL DATA:",
                    "content": "Transmission Impairments - Single and Multiple bit error correction-Error Detection and Correction - Cyclic Redundancy Check Code -.Hamming Code. (4)"
                },
                {
                    "title": "DATA LINK CONTROL AND PROTOCOLS:",
                    "content": "Line Discipline - Flow Control - Sliding Window Protocol - Error Control - Automatic\n                        Repeat Request – Stop and wait - ARQ - Go back by n ARQ - Selective Reject ARQ. (5)"
                },
                {
                    "title": "LOCAL AREA NETWORKS:",
                    "content": "Random Access protocols- Ethernet – Fast Ethernet – Gigabit Ethernet – Wireless LANs- Internetworking- LAN -LAN Connections – Repeaters- Hubs - Bridge – Spanning tree-Switches – Routers (5)"
                },
                {
                    "title": "IP:",
                    "content": "TCP/IP Protocol Structure - Internet Protocol – IP addressing-Subnetting-NAT- IPV6-ICMP-ARP-DHCP (9)"
                },
                {
                    "title": "ROUTING:",
                    "content": "Distance vector routing _ Link state Routing – RIP – OSPF (4)"
                },
                {
                    "title": "TRANSPORT LAYER:",
                    "content": "TCP concepts - Port number – Connection control – Flow control - Congestion Control(5)"
                },
                {
                    "title": "APPLICATIONS:",
                    "content": "SMTP - MIME Format, FTP, DNS, HTTP. (5)"
                }
            ],
            "textbooks": [
                "1. Behrouz A Forouzan, “Data Communications and Networking”, Tata McGraw Hill, 2013.",
                "2. Behrouz A Forouzan, “TCP/ IP Protocol Suite”, Tata McGraw Hill, 2017.",
                "3. Peterson, Larry L., and Bruce S. Davie. Computer networks: a systems approach. Elsevier, 2012.."
            ]
        },
        {
            "code": "23XT46",
            "title": "RDBMS LAB",
            "semester": 4,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "23XT47",
            "title": "OPERATING SYSTEMS LAB (LINUX)",
            "semester": 4,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "Linux:",
                    "content": "History - General structure - Unix file system - file abstraction, directories, mount points, implementation details - Processes: memory image, life cycle, start of day. The shell: basic operation, commands, standard I/O, redirection, pipes, signals. Character and block I/O. Process scheduling.\n                        1. Overview of an Operating System, Boots and Shutdown\n                        2. UNIX File System Commands\n                        3. UNIX Commands\n                        4. SHELL Programming\n                        5. Programs using UNIX System Calls\n                        6. Process Creation and Execution\n                        7. Thread Creation and Execution\n                        8. Process / Thread Synchronization using semaphore\n                        9. Developing Application using Inter Process communication (using sharedmemory, pipes or message queues)\n                        10. Implementation of Memory Management Schemes\n                        11. Creating Linux Modules"
                }
            ],
            "textbooks": [
                "1. Robert Love, “Linux System Programming”, O’Reilly, 2013",
                "2. Neil Matthew and Richard Stones, “Beginning Linux programming”, John Wiley, 2011.",
                "3. Dale Doughherty and Arnold Robbins, “SED & AWK programming”, O’Reilly, 2010."
            ]
        },
        {
            "code": "23XT48",
            "title": "COMPUTER NETWORKS LAB",
            "semester": 4,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "23XT51",
            "title": "THEORY OF COMPUTING",
            "semester": 5,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION TO LANGUAGE AND GRAMMAR:",
                    "content": "Overview of Languages and grammars – Alphabets – Strings – Operations\n                        on languages – Introduction to Compilers - Analysis of the Source Program - Phases of a Compiler.\t(4)"
                },
                {
                    "title": "FINITE STATE AUTOMATA AND REGULAR EXPRESSION:",
                    "content": "Finite state automata (FSA) – DFA – NFA – Equivalence of NFA (5)"
                },
                {
                    "title": "REGULAR EXPRESSION AND LEXICAL ANALYSIS:",
                    "content": "Regular expressions – Conversion between RE and FSA – Role of Lexical\n                        Analyzer – Specification and Recognition of Tokens (4)"
                },
                {
                    "title": "MORE ON REGULAR LANGUAGES:",
                    "content": "Decision and closure properties of regular languages – Pumping Lemma for Regular languages – Finite State Transducers – Mealy and Moore Machines. \t(4)"
                },
                {
                    "title": "CONTEXT FREE GRAMMARS:",
                    "content": "Decision and closure properties of regular languages – Pumping Lemma for Regular languages – Finite State Transducers – Mealy and Moore Machines.\n                        Chomsky Normal Form – Greibach Normal Form – Backus Normal Form – CYK algorithm. (5)"
                },
                {
                    "title": "SYNTAX ANALYSIS:",
                    "content": "Top-down Parsing – LL(1) parser – Shift Reduce Parser – LR(0) and SLR(1) parsers – LALR(1) and CLR(1)\n                        parsers. (5)"
                },
                {
                    "title": "PUSHDOWN AUTOMATA:",
                    "content": "Pushdown Automata – Deterministic Pushdown Automata – Equivalence of CFG and PDA - Pumping\n                        Lemma for CFG – Decision and closure properties of context-free. (5)"
                },
                {
                    "title": "TURING MACHINES:",
                    "content": "Turing Machines – Recursive and recursively enumerable languages – Chomsky hierarchy – Variants of\n                        Turing Machines – Universal Turing Machine – Decidable and closure properties of recursive and recursively enumerable\n                        languages – Rice’s theorem (5)"
                },
                {
                    "title": "UNDECIDABLE AND INTRACTABLE PROBLEMS:",
                    "content": "Decidability and undecidability – Halting problem – Post Correspondence\n                        Problem –Complexity classes of P and NP - NP-Complete Problems. (4)"
                },
                {
                    "title": "MODELS OF COMPUTATION:",
                    "content": "Primitive Recursive Functions – Ackermann’s Function – matrix rewriting grammars – L-systems. (4)"
                }
            ],
            "textbooks": [
                "1. Peter Linz, An Introduction to Formal languages and Automata, Jones & Bartlett Learning, 2017.",
                "2. John E. Hopcroft, Rajeev Motwani, Jeffrey D Ullman, Introduction to Automata Theory, Languages and Computation, Pearson, 2014."
            ]
        },
        {
            "code": "23XT52",
            "title": "COMPUTATIONAL NUMBER THEORY AND CRYPTOGRAPHY",
            "semester": 5,
            "course_type": "regular",
            "credits": "4 0 0 4",
            "content": [
                {
                    "title": "BASICS OF NUMBER THEORY:",
                    "content": "Divisibility and Primality – Greatest common divisors - Euclidean and Extended Euclidean algorithms, Modular arithmetic- Computing modular inverse – modular exponentiation- efficient algorithms, Congruence’s – Basic properties – Solving linear congruence’s – Residue classes - Chinese remainder theorem - Euler’s Phi function – Euler’s theorem –\n                        Fermat’s little theorem, generators and primitive roots in groups – Discrete logarithm. (15)"
                },
                {
                    "title": "BASIC CRYPTOGRAPHIC TECHNIQUES:",
                    "content": "Encryption and Decryption, Classical ciphers- Monoalphabetic cipher - Substitution ciphers-Affine ciphers - Polyalphabetic ciphers – one time pad – Hill cipher – Cryptanalysis of above ciphers (6)"
                },
                {
                    "title": "SYMMETRIC KEY CRYPTOGRAPHY:",
                    "content": "Basic idea – Types of Symmetric key cryptography – stream cipher – LFSR stream cipher,\n                        Block ciphers – AES – analysis of AES – modes of operation (5)"
                },
                {
                    "title": "PUBLIC KEY CRYPTOGRAPHY:",
                    "content": "Concept of public key cryptography – One way functions – trap door functions – Computational indistinguishability – Pseudorandom generators and pseudo random functions – semantic security - RSA cryptosystem- cryptanalysis\n                        of RSA- the RSA problem – Primality testing -Legendre and Jacobi symbols – quadratic residues – Miller Rabin algorithm - Integer factorization problem, Discrete log problem, ElGamal cryptosystem, Elliptic curve cryptosystem, need for stronger security notions for\n                        public key cryptography – CCA security. (13)"
                },
                {
                    "title": "DATA INTEGRITY TECHNIQUES:",
                    "content": "Symmetric techniques- Cryptographic hash functions – Security of hash functions, Random oracle\n                        model – Iterated hash function – Merkle – Damgard construction - MAC, unconditionally secure MAC- strongly universal Hash families, asymmetric techniques – Digital signatures – RSA signature, ElGamal signature, Digital signature standard algorithm, strong security\n                        notion for digital signatures- provable security for ElGamal signature (11)"
                },
                {
                    "title": "AUTHENTICATION AND KEY DISTRIBUTION PROTOCOLS:",
                    "content": "TData origin authentication and entity authentication, challenge and response-certificates, Schnorr identification scheme, zero knowledge protocol, Diffie-Hellman key pre-distribution, session key distribution – The Needham Schroeder scheme, Kerberos, Diffie- Hellman key agreement scheme, man in the middle attack, station to station key agreement protocol.\n                        (10)"
                }
            ],
            "textbooks": [
                "1. Victor Shoup, “A Computational introduction to Number Theory and Algebra”, Cambridge University Press, 2009.",
                "2. Douglas R Stinson, “Cryptography Theory and Practice”, CRC Press, 2018",
                "3. Jonathan Katz, Yehuda Lindell, “Introduction to Modern Cryptography”, CRC press, 2015"
            ]
        },
        {
            "code": "23XT53",
            "title": "MACHINE LEARNING",
            "semester": 5,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Machine learning – Types – Supervised learning, unsupervised, Reinforcement learning, semi supervised learning\n                        - Regression – Linear – Polynomial – Multiple regression – Evaluation measures – Bias –variance – overfitting – under fitting – Regularization (10)"
                },
                {
                    "title": "CLASSIFICATION:",
                    "content": "Linear classification – Logistic regression – linear discriminant analysis – Optimization – Convex set - Convex functions\n                        – Loss functions in machine learning - Gradient descent – variants – Perceptron - Support Vector Machines – Linear, Soft margin, (10) Linearly non separable data - Kernel functions"
                },
                {
                    "title": "NEURAL NETWORKS:",
                    "content": "Multilayer perceptron - Back propagation – Training – Bayesian Classifier – Decision theory – Maximum A Posteriori\n                        estimate – maximum likelihood estimate - K nearest neighbor classifier. (10)"
                },
                {
                    "title": "DECISION TREES:",
                    "content": "Introduction – Purity measures – Entropy, cross entropy, information gain, gain ratio, Gini Index – Regression trees\n                        – ID3 – Pruning – Model selection – Bootstrapping and cross validation – Model evaluation – Performance Measures – Receiver operating characteristic curve (ROC) – AUC. (8)"
                },
                {
                    "title": "UNSUPERVISED LEARNING:",
                    "content": "Clustering –Types - K-means – Mixture of Gaussians –Spectral clustering - Cluster validity measures – dimensionality reduction- PCA (Principal components analysis) - ICA (Independent components analysis) - Applications : image segmentation – Image compression –Outlier analysis. (7)"
                }
            ],
            "textbooks": [
                "1. Christopher M Bishop, “Pattern Recognition and Machine Learning”, Springer, 2016.",
                "2. Richard O Duda, Peter E Hart and David G Stork, “Pattern Classification (Digitized)”, John Wiley, 2012."
            ]
        },
        {
            "code": "23XT54",
            "title": "DESIGN AND ANALYSIS OF ALGORITHMS",
            "semester": 5,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Fundamentals of algorithmic problem solving, deciding an appropriate data structure and algorithm design technique – Methods of specifying an algorithm –Proving the correctness – Review of analysis of algorithms, analysis of recursive algorithms – Master’s Theorem. (5)"
                },
                {
                    "title": "DIVIDE AND CONQUER:",
                    "content": "Binary search - Quick sort and Merge sort - Large Integer multiplication, -Strassen’s matrix multiplication\n                        - Closest pair. (5)"
                },
                {
                    "title": "GREEDY METHOD:",
                    "content": "Optimal caching, minimum cost spanning tree. (Kruskal and Prim’s algorithms),Topological sorting, Huffman\n                        codes and data compression (6)"
                },
                {
                    "title": "DYNAMIC PROGRAMMING:",
                    "content": "Principles of dynamic programming – 0/1 Knapsack problem- Longest common subsequence problem\n                        - All pairs shortest problem- Optimal binary search trees- Traveling salesman problem. (7)"
                },
                {
                    "title": "STRING MATCHING:",
                    "content": "The Naïve Method, Rabin – Karp Algorithm, The Knuth – Morris – Pratt Algorithm. (4)"
                },
                {
                    "title": "NETWORK FLOW:",
                    "content": "Flow networks and Flows –Network with multiple sources and working with flows- The Ford - Fulkerson Method-\n                        Augmenting paths- Max- Flow min - cut theorem-The Edmonds - Karp algorithm. (4)"
                },
                {
                    "title": "NP AND COMPUTATIONAL INTRACTABILITY:",
                    "content": "Basic concepts – Polynomial time reductions- vertex cover and independent sets,\n                        3-SAT and independent sets, 3-SAT and Hamiltonian cycle, Hamiltonian cycle and traveling salesman problem, efficient certification\n                        and NP, NP hard and NP complete problems – co-NP and the asymmetry of NP, Examples, Space Complexity-P SPACE , Some hard problems in PSPACE-QSAT (7)"
                },
                {
                    "title": "COPING WITH NP-COMPLETENESS:",
                    "content": "Backtracking: n- queens problem, Graph coloring problem, Hamiltonian cycle, Branch and bound: Assignment problem, Traveling salesman problem, 0/1 knapsack problem, Approximation algorithm – Introduction – Traveling salesman problem-Parametrized algorithm-Introduction-0/1 Knapsack problem.\n                        (7)"
                }
            ],
            "textbooks": [
                "1. Thomas H. Cormen, Charles E Leiserson, and Ronald LRivest, “Introduction to Algorithms”, MIT Press, 2015.",
                "2. Jon Kleinberg and Eve Tardos, “Algorithm Design”, Pearson Education, 2013."
            ]
        },
        {
            "code": "23XT56",
            "title": "SCIENTIFIC COMPUTING LAB",
            "semester": 5,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "SOLUTION OF ALGEBRAIC EQUATIONS:",
                    "content": "Newton Raphson method, Modified Newton Raphson method, Method of false position,\n                        Graffe’s root squaring method, Bairstow’s method"
                },
                {
                    "title": "SOLUTION OF ALGEBRAIC SIMULTANEOUS EQUATIONS:",
                    "content": "Gauss – Jordan elimination, Cholesky method, Crout’s method, Gauss – Jacobi method, Gauss – Seidel method. Matrix Inverse by Gauss – Jordan method."
                },
                {
                    "title": "EIGENVALUES AND EIGENVECTORS:",
                    "content": "Power method for finding dominant eigenvalue and inverse power method for finding smallest eigenvalue, Jacobi method for symmetric matrices."
                },
                {
                    "title": "INTERPOLATION AND CURVE FITTING:",
                    "content": "Finite difference operators-Interpolating Polynomials, Divided Difference, Spline Curves, Bezier Curves and B-Spline Curves. Solution of linear second order difference equations with constant coefficients."
                },
                {
                    "title": "PARTIAL DIFFERENTIAL EQUATIONS:",
                    "content": "Classification of partial differential equations of second order. Liebmann’s method for Laplace equation and Poisson equation, Explicitmethod and Crank – Nicolson method for parabolic equations. Explicit method for hyperbolic equations."
                }
            ]
        },
        {
            "code": "23XT57",
            "title": "DESIGN AND ANALYSIS OF ALGORITHMS LAB",
            "semester": 5,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "23XT58",
            "title": "JAVA PROGRAMMING LAB",
            "semester": 5,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "JAVA PROGRAMMING:",
                    "content": "Introduction - Data Types - Operators - Declarations - Control Structures - Arrays and Strings - Input/Output-\n                        Java Classes - Fundamentals - Methods - Constructors - Scope rules - this keyword - object based vs oriented programming – Inheritance-Reusability - Composing class - Method overloading - Abstract classes - Virtual Functions. (10)"
                },
                {
                    "title": "PACKAGES AND INTERFACES:",
                    "content": "Packages - Access protection - Importing packages - Interface - Defining and Implementing\n                        Interface - Applying Interface - Variables in Interfaces. (8)"
                },
                {
                    "title": "EXCEPTION HANDLING:",
                    "content": "Fundamentals - Exception types - Uncaught Exception - Using Try and Catch - Multiple catch clauses -\n                        Nested Try statements - Throw - Throws - Java Built-in Exception - Creating your own subclasses. (8)"
                },
                {
                    "title": "MULTI THREADED PROGRAMMING:",
                    "content": "Java thread model - Priorities - Synchronization - Messaging - Thread class and runnable\n                        Interface - Main thread - Creating the Thread - Synchronization – Inter-thread Communication – Deadlock. (12)"
                },
                {
                    "title": "I/O, APPLETS:",
                    "content": "I/O basics - Stream - Stream Classes - Predefined stream - Reading/Writing console input - Applet fundamentals - Native methods.- GUI Components - Applets - Java Scripts –Swing. (10)"
                },
                {
                    "title": "COLLECTIONS FRAMEWORK:",
                    "content": "Generics – Autobox – Auto unboxing – Annotations – Collections Frame works – List – Set – Map (7)"
                },
                {
                    "title": "NEW FEATURES :",
                    "content": "Functional Programming, lambda expressions. (5)"
                }
            ],
            "textbooks": [
                "1. Herbert Schildt, “Java: the Complete Reference”, McGraw Hill, 2014."
            ]
        },
        {
            "code": "23XT61",
            "title": "SOFTWARE ENGINEERING",
            "semester": 6,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "System - System Development - Types of systems – People involved in the systems development - The project life\n                        cycle models - Need for Software Engineering - Objectives and Benefits of Software Engineering - Factors that influence Quality & Productivity – Quality attributes of a software product -Software Development Models. (7)"
                },
                {
                    "title": "SOFTWARE PLANNING:",
                    "content": "Software Project Estimation - Different techniques of Project cost estimation Decomposition techniques - COCOMO & PUTNAM models- SOFTWARE ANALYSIS: Functional and non-functional requirements- Requirements engineering\n                        process – Elicitation – validation and management --Principles of Analysis - Analysis tools -Analysis Models. (8)"
                },
                {
                    "title": "DESIGN CONCEPTS AND PRINCIPLES:",
                    "content": "Design process and concepts – Levels of Design - Coupling – Cohesion -Design Tools -\n                        Software Design Methods – Design Techniques - Design of Input and control - Design of Output. (8)"
                },
                {
                    "title": "SOFTWARE QUALITY and TESTING:",
                    "content": "Quality Assurance versus Quality Control-The Cost of Quality-Software Quality Factors - Importance –Testing Types -Testing Techniques- Test Design-Test Scenarios-Test Cases Design-types-Test Scenario-Test cases for\n                        sample case studies - Smoke Testing-Sanity Testing-Regression Testing, Re-Testing, Ad-Hoc Testing-Gorilla Testing. Test Management-Test Policy-Test Strategy-Test Plan-Test Process-Levels of Testing-Testing Metrics-Review-Walk through Inspection-\n                        Desk Checking - Testing Tools- Software Metric -Software quality - SEI CMM and ISO-9001 -Software Risk and Reliability (10)"
                },
                {
                    "title": "OBJECT ORIENTED SYSTEMS DEVELOPMENT:",
                    "content": "Object Oriented Systems Development life Cycle - Object oriented methodologies\n                        -Rational Unified Process – Unified Modeling Language –Process workflows – Importance of Modeling – Types of Modeling-Software\n                        Design patterns-Business Aspects of Software Engineering (6)"
                },
                {
                    "title": "AGILE SOFTWARE DEVELOPMENT :",
                    "content": "Traditional Model vs. Agile Model- Agile Fundamentals- Generating User Stories- Agile\n                        software development methods –Agile management (6)"
                }
            ],
            "textbooks": [
                "1. Pressman R.S., “Software Engineering – A Practitioner’s Approach”, Tata McGraw Hill, 2019.",
                "2. John Hunt, “The Unified Process for Practitioners”, Springer, 2014."
            ]
        },
        {
            "code": "23XT62",
            "title": "COMPUTER GRAPHICS AND VISUALIZATION",
            "semester": 6,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "GRAPHICS INPUT - OUTPUT DEVICES:",
                    "content": "Raster scan displays - Random scan displays - Direct view storage tubes - Flat panel\n                        displays - Mouse - Track Ball - Joy Stick - Digitizers - Touch panels - LCD. Graphical User Interface and Interactive Input Methods:\n                        The user dialog - Input of graphical data - Input function - Interactive picture construction techniques - Virtual reality environments. (4)"
                },
                {
                    "title": "OPENGL:",
                    "content": "Architecture, OpenGL API, Primitives and Attributes, Color, Viewing, Control Functions, Programming Event-Driven Input, Transformations, OpenGL Extensions. (4)"
                },
                {
                    "title": "TWO DIMENSIONAL GRAPHICS:",
                    "content": "Basic transformations - Matrix representation and homogeneous coordinates - Composite transformations - Line drawing algorithms: DDA and Bresenham's algorithms - Circle generation algorithms: Midpoint circle algorithm\n                        - Point clipping - Line clipping: Cohen Sutherland algorithm - Polygon clipping: Sutherland Hodgeman algorithm. (8)"
                },
                {
                    "title": "RASTER GRAPHICS:",
                    "content": "Fundamentals: generating a raster image, representing a raster image, scan converting a line drawing, displaying characters, speed of scan conversion, natural images - Solid area scan conversion: Scan conversion of polygons, Y-X algorithm, properties of scan conversion algorithms - Interactive raster graphics: painting model, moving parts of an image, feedback images. (8)"
                },
                {
                    "title": "IMAGE PROCESSING FUNDAMENTALS:",
                    "content": "Sampling and Quantization, Image Enhancement - Histogram Processing, Filtering, Edge\n                        Detection, Image Transforms. (6)"
                },
                {
                    "title": "CURVES AND SURFACES:",
                    "content": "Parametric representation of curves - Bezier curves – B-Spline curves - Parametric representation of\n                        surfaces - Bezier surfaces - Curved surfaces - Ruled surfaces - Quadric surfaces – Concatenation of two curve segments – Order of Continuity. (5)"
                },
                {
                    "title": "THREE DIMENSIONAL GRAPHICS:",
                    "content": "3D transformations - Viewing 3D graphical data - Orthographic, oblique, perspective projections\n                        - Hidden lines and hidden surface removal. (6)"
                },
                {
                    "title": "FRACTAL-GEOMETRY METHODS:",
                    "content": "Tiling the plane - Recursively defined curves - Koch curves - C curves - Dragons - Space filling\n                        curves - Fractals - Grammar based models - Graftals - Turtle graphics - Ray tracing (4)"
                }
            ],
            "textbooks": [
                "1. Donald Hearn and Pauline Baker M, \"Computer Graphics C Version\", Pearson Education, 2014.",
                "2. William M. Newmann, Robert F Sproull, “Principles of Interactive Computer Graphics”, Tata McGraw Hill, 2014.",
                "3. Angel, “Interactive Computer Graphics- A top down approach with OpenGL”, Pearson Education, 2014."
            ]
        },
        {
            "code": "23XT63",
            "title": "ARTIFICIAL INTELLIGENCE",
            "semester": 6,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "The foundations of AI - The History of AI - Intelligent agents - Agent based system. (2)"
                },
                {
                    "title": "PROBLEM SOLVING:",
                    "content": "State Space models - Searching for solution - Uninformed/Blind search - Informed/ Heuristic search - A* search - Hill-climbing search - Meta Heuristic: Genetic Algorithm - Adversary based search : Minimax - Expectimax – Alpha Beta pruning – Constraint satisfaction problem - Backtracking search. (11)"
                },
                {
                    "title": "KNOWLEDGE REPRESENTATION AND REASONING:",
                    "content": "Knowledge representation - Logics - bivalent logic - inference - Fuzzy logic: membership - Fuzzy rules and reasoning - Fuzzy inference. (10)"
                },
                {
                    "title": "UNCERTAIN KNOWLEDGE AND PROBABILISTIC REASONING:",
                    "content": "Uncertainty - Probabilistic reasoning - Semantics of Bayesian network - Exact inference in Bayesian network- Approximate inference in Bayesian network - Probabilistic reasoning over time – Inference in temporal models - Hidden Markov Models – Dynamic Bayesian Networks. (11)"
                },
                {
                    "title": "DECISION-MAKING:",
                    "content": "Basics of utility theory, Utility functions - Sequential decision problems - Markov decision process - Value iteration - Policy iteration - Decisions in Multi agent system: Multi agent decision theory - Group decision making. (11)"
                }
            ],
            "textbooks": [
                "1. Stuart Russell and Peter Norvig, “Artificial Intelligence: A Modern Approach”, Pearson Education, 2020.",
                "2. David Pool and Alan Mackworth, “Artificial Intelligence: Foundations of Computational agents”, Cambridge University Press, 2017.",
                "3. Timothy Ross, “ Fuzzy Logic with Engineering Applications”, John Wiley and sons, 2016."
            ]
        },
        {
            "code": "23XT64",
            "title": "PRINCIPLES OF COMPILER DESIGN",
            "semester": 6,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION TO COMPILERS:",
                    "content": "Phases of compilers – compilers and interpreters – Overview of Lexical analysis – Parsing\n                        Techniques – Top-down Parsing – Shift Reduce Parsing. (4)"
                },
                {
                    "title": "SEMANTIC ANALYSIS:",
                    "content": "Syntax Directed Definitions – Inherited and Synthesized attributes – Attribute Grammars - Evaluation of Attribute grammars – Dependency Graph - Ordering the Evaluation – S-attributed and L-attributed grammars – Semantic Rules with controlled Side Effects – Type checking – type conversion. \t(6)"
                },
                {
                    "title": "INTERMEDIATE CODE GENERATION:",
                    "content": "Syntax Tree, Three Address Code, Types and Declarations: Translation of Expressions, conditional statements, looping statements, break and continue statements, array indexing, function calls – Quadruples, Triples and\n                        Indirect triples – Short Circuit Evaluation for Boolean expression - Flow-of-control statements – Back patching. (8)"
                },
                {
                    "title": "RUN-TIME ENVIRONMENTS:",
                    "content": "Storage Allocation – Activation Trees- Activation Records – Parameter Passing Methods – Data Access\n                        with and without Nested Procedures – Heap Management – Garbage Collection. (5)"
                },
                {
                    "title": "CODE GENERATION:",
                    "content": "Issues in the design of code generation - Program and Instruction Costs – Static and Stack Allocation of addresses in Target Code – Producing Code generators automatically. (5)"
                },
                {
                    "title": "FLOW ANANLYSIS:",
                    "content": "Dominators and Post dominators – Loops and Strongly Connected Components – Reducibility – Interval and\n                        Structural analysis – Interval Trees - Iterative Data Flow Analysis – Lattices of flow functions – Control-Tree-based Data-flow analysis\n                        – Structural and Interval Analysis – Webs – Static Single-Assignment (SSA) Form - Alias Analysis - Dependence Relations – Direction\n                        Vector - Basic Block Dependence DAGs – Dependence in Loops – Dependence Testing – Program-Dependence Graphs. (10)"
                },
                {
                    "title": "CODE OPTIMIZATION AND SCHEDULING:",
                    "content": "Basic Blocks – Control Flow Graph – Value Numbering – Copy and Constant Propagation – Common Subexpression Elimination – Loop-invariant Code Motion - Peephole Optimization – Register Allocation and Graph coloring - Instruction Scheduling – Software Pipelining – Trace and Percolation Scheduling. (7)"
                }
            ],
            "textbooks": [
                "1.\tAlfred Aho, Monica Lam, Ravi Sethi, Jeffrey Ullman, Compilers: Principles, Techniques and Tools, 2014.",
                "2.\tSteven Muchnick, Advanced Compiler Design Implementation, 2003.",
                "3.\tJohn J. Donovan, “Systems Programming”, McGraw Hill ,  2017.",
                "4.\tAho A.V, Monica S Lam,  Ravi Sethi and Ullman J.D., “Compilers : Principles, Techniques and Tools”, Pearson  Addison Wesley,  2013."
            ]
        },
        {
            "code": "23XT66",
            "title": "COMPUTER GRAPHICS AND VISUALIZATION LAB",
            "semester": 6,
            "course_type": "regular",
            "credits": "0 0 4 2",
            "content": [
                {
                    "title": "Note:",
                    "content": "1. Drawing a line, circle using algorithms.\n                        2. Implementation of 2D Transformations (translation, scaling, rotation).\n                        3. Window – viewport simulation with various aspect ratios.\n                        4. Line clipping and Polygon clipping using algorithms.\n                        5. Manipulation of raster images.\n                        6. Image processing commands in Matlab.\n                        7. Histogram processing\n                        8. Filtering\n                        9. Edge detection\n                        10. Image Transforms\n                        11. Drawing a 2D curve using Bezier and B-Spline generations.\n                        12. 3d Projections – Orthographic and Perspective\n                        13. Hidden Surface Removal algorithm\n                        14. Mandelbrot and Julia Set Generation\n                        15. Graftals Generation\n                        16. Model a primitive (car / Aircraft) with OpenGL API.\n                        17. Model and Animate the primitive.\n Algorithms in Computer Graphics have to be implemented by students using C++ and OpenGL."
                }
            ]
        },
        {
            "code": "23XT67",
            "title": "ARTIFICIAL INTELLIGENCE LAB",
            "semester": 6,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "23XT68",
            "title": "COMPILER DESIGN LAB",
            "semester": 6,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "23XTP1",
            "title": "PROJECT WORK 1 – INDUSTRY / RESEARCH PROJECT",
            "credits": "0 0 0 12"
        },
        {
            "code": "23XT81",
            "title": "DEEP LEARNING",
            "semester": 8,
            "course_type": "regular",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Basic concepts – Convex sets, convex functions – loss functions – Gradient descent – Variants - Perceptron –\n                        Activation functions - Geometric representation – Perceptron Convergence theorem. (4)"
                },
                {
                    "title": "FEED FORWARD NETWORKS:",
                    "content": "Multi layer Perceptron – back propagation - Learning XOR – Auto encoder - Deep neural networks. (6)"
                },
                {
                    "title": "TRAINING NEURAL NETWORKS:",
                    "content": "Optimization methods for neural networks - Adagrad, Adadelta, rmsprop, adam, NAG - second order\n                        methods for training, Saddle point problem in neural networks, Regularization methods - dropout, batch normalization, Ridge and\n                        Lasso.\t(10)"
                },
                {
                    "title": "CONVOLUTIONAL NETWORKS:",
                    "content": "structure – properties – Region based CNN - LeNet – Alex net. (5)"
                },
                {
                    "title": "RECURRENT NETWORKS:",
                    "content": "Recurrent neural networks (RNN) – Gated Recurrent unit – Long Short Term Memory - Bidirectional RNNs -\n                        Deep recurrent network – Methodology – Applications. (8)"
                },
                {
                    "title": "DEEP LEARNING RESEARCH:",
                    "content": "Linear Factor Models, variants of Auto encoders, Representational Learning, Structured probabilistic\n                        models for deep learning, Monte Carlo Methods, Generative adversarial networks - Deep generative models. (9)"
                },
                {
                    "title": "APPLICATIONS:",
                    "content": "Natural language processing, Big Data, Brain Computer Interface, Vision, IoT. (3)"
                }
            ]
        },
        {
            "code": "23XT82",
            "title": "PARALLEL AND DISTRIBUTED COMPUTING",
            "semester": 8,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Concepts and Terminology – Generic Processor / ASIC Processor Architecture – Pipeline Architecture – Instruction\n                        Set Architecture - Types of Parallelism - Flynn's Classical Taxonomy – Terminology. (5)"
                },
                {
                    "title": "PARALLEL COMPUTER MEMORY ARCHITECTURES:",
                    "content": "Shared Memory - Distributed Memory -Hybrid Distributed-Shared Memory Multiprocessors: Communication and Memory issues - Message Passing Architectures - Vector Processing and SIMD Architectures. (5)"
                },
                {
                    "title": "PARALLEL PROGRAMMING MODELS:",
                    "content": "Overview -Shared Memory Model - Threads Model - Message Passing Model - Data Parallel\n                        Model - Other Models. (4)"
                },
                {
                    "title": "DESIGNING PARALLEL PROGRAMS:",
                    "content": "Automatic vs. Manual Parallelization - Understand the Problem and the Program - Partitioning -Communications - Synchronization -Data Dependencies - Load Balancing -Granularity -I/O -Limits and Costs of Parallel Programming\n                        - Performance Analysis and Tuning - Parallel Examples -Array Processing - Compiler Transformation techniques for High performance computing: - Transformations for parallel Machines. (8)"
                },
                {
                    "title": "PRAM ALGORITHMS:",
                    "content": ": PRAM model of computation- Work-Time formalism and Brent’s Theorem; algorithm design techniques-\n                        parallel prefix, pointer jumping, Euler tours, divide and conquer, symmetry breaking; survey of data-parallel algorithms; relative power\n                        of PRAM. (6)"
                },
                {
                    "title": "HIGH PERFORMANCE COMPUTING ARCHITECTURES:",
                    "content": "Latency Hiding Architectures -Multithreading Architectures -Dataflow Architectures - GPGPU Architecture- Overview of basic Accelerators /GPU / GPGPU and its programming model – CUDA - OpenCL. (8)"
                },
                {
                    "title": "DISTRIBUTED COMPUTING:",
                    "content": "Introduction -- Definitions, motivation - Communication Mechanisms - Communication protocols,-RPC- RMI.Hadoop Architecture: History of Hadoop, Background-Architecture - Hadoop and RDBMS-Subprojects-Distributions- Documentation. Hadoop Distributed File System (HDFS): HDFS Clusters – NameNodes, DataNodes& Clients – MapReduce :- Processing & Generating large data sets, Map functions, Programming MapReduce using SQL / Bash / Python, Parallel Processing, Failover.\n                        (9)"
                }
            ],
            "textbooks": [
                "1. John L. Hennessy and David A. Patterson, “Computer Architecture a Quantitative Approach”, Elsevier, 2016.",
                "2. Michael J Quinn, “ Parallel Computing : Theory And Practice”, Tata Mcgraw-Hill,2004.",
                "3. Andrew S. Tanenbaum and Maarten van Steen, “Distributed Systems, Principles and Paradigm”, Prentice Hall, 2013."
            ]
        },
        {
            "code": "23XT83",
            "title": "DATA MINING",
            "semester": 8,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Motivation for Data Mining – Importance – Definition – Kinds of data for Data Mining – Data Mining functionalities\n                        – Patterns – Classification of Data Mining Systems – Major issues in Data Mining-Overview of Data Mining Techniques. DATA PREPROCESSING: Types of data, Data cleaning-Smoothing, Handling missing values- Feature subset selection Sampling methods. (10)"
                },
                {
                    "title": "DATA PREPROCESSING:",
                    "content": "Types of data, Data cleaning-Smoothing, Handling missing values- Feature subset selection Sampling methods. (10)"
                },
                {
                    "title": "DATA WAREHOUSE and OLAP TECHNOLOGY:",
                    "content": "Overview- Need for Data Warehouse- multidimensional data model-Data Warehouse architecture -Data warehousing Schemas - Data Warehousing to Data mining. (4)"
                },
                {
                    "title": "DESIGNING PARALLEL PROGRAMS:",
                    "content": "MINING FREQUENT PATTERNS, ASSOCIATIONS AND CORRELATIONS: Basic concepts – Efficient and Scalable Frequent\n                        Itemset Mining methods – Apriori, FP Tree. CLASSIFICATION AND PREDICTION: Overview of Classification techniques –Ensemble Learning-bagging, boosting, cascading, stacking. CLUSTERING: Hierarchical – Density based. (10)"
                },
                {
                    "title": "INCREMENTAL & STREAM DATA MINING:",
                    "content": "Incremental Algorithms for Data Mining, Characteristics of Streaming Data, Issues and Challenges, Streaming Data Mining Algorithms, Any time stream Mining. (7)"
                },
                {
                    "title": "SEQUENCE MINING:",
                    "content": "Characteristics of Sequence Data, Problem Modeling, Sequential Pattern Discovery, Timing Constraints, Applications in Bioinformatics Multivariate Time Series (MVTS) Mining: Importance of MVTS data - Sources of MVTS data - Mining MVTS data. (8)"
                },
                {
                    "title": "APPLICATIONS AND TRENDS IN DATA MINING:",
                    "content": "Spatial Data Mining –Graph Mining- Web Mining –Text Mining. (6)"
                }
            ],
            "textbooks": [
                "1. Jiawei Han and Micheline Kamber , “Data Mining – Concepts and Techniques”, Morgan Kaufmann Publishers, 2012.",
                "2. Tan, Steinbach and Kumar, “Introduction to Data Mining”, Pearson Education, 2014."
            ]
        },
        {
            "code": "23XT86",
            "title": "PARALLEL AND DISTRIBUTED COMPUTING LAB",
            "semester": 8,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "23XT87",
            "title": "DATA MINING LAB",
            "semester": 8,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "23XT88",
            "title": "RESEARCH SPECIALIZATION LAB - I",
            "semester": 8,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "23XT91",
            "title": "GAME THEORY",
            "semester": 9,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Game theory the theory of rational choice – Interacting decision makers. (2)"
                },
                {
                    "title": "NASHEQUILIBRIUM:",
                    "content": "Strategic games – Best response – Dominance – Examples from economics, business, environment, military -\n                        Symmetric games and symmetric equilibria. Illustrations: Cournot’s model of oligopoly, Electoral competition. (7)"
                },
                {
                    "title": "MIXED STRATEGIES:",
                    "content": "Dominance – Equilibrium – Illustrations: Expert diagnosis, Reporting a crime – Formation of players’ beliefs. (5)"
                },
                {
                    "title": "EXTENSIVE GAMES WITH PERFECT INFORMATION:",
                    "content": "Strategies and outcomes – Nash equilibrium – Subgame perfect equilibrium\n                        - Stackelberg’s model of duopoly, Buying votes – Illustrations: Entry into a monopolized industry, Electoral competition with strategic\n                        voters, Committee decision making. (7)"
                },
                {
                    "title": "GAMES WITH IMPERFECT INFORMATION:",
                    "content": "Bayesian games – Examples – Strategic information – Transmission – Agenda Control\n                        with imperfect Information – Signaling games - Education as a signal of ability. (8)"
                },
                {
                    "title": "REPEATED GAMES:",
                    "content": "REPEATED GAMES: The prisoner’s dilemma – Finitely repeated and infinitely repeated – Strategies – Nash equilibrium – Subgame\n                        – Perfect equilibria and the one – deviation – Property – General results – Finitely replaced games – Variation on a theme: Imperfect observability. (8)"
                },
                {
                    "title": "INTRODUCTION TO ALGORITHMIC GAME THEORY:",
                    "content": "Auction and mechanism design basics - the Vickrey auction - Sponsored\n                        Search Auction - Social choice theory - VCG mechanism. Algorithmic Aspects of Equilibria: Existence and computational complexity\n                        equilibria - Market Equilibrium - Correlated Equilibrium. (8)"
                }
            ],
            "textbooks": [
                "1. Martin J Osborne, “An Introduction to Game Theory”, Oxford University Press, 2009.",
                "2. Vijay Krishna, “Auction Theory”, Academic Press, 2009."
            ]
        },
        {
            "code": "23XT92",
            "title": "MATHEMATICAL MODELLINGY",
            "semester": 9,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION TO MODELLING:",
                    "content": "Modelling process, Overview of different kinds of model. (3)"
                },
                {
                    "title": "EMPIRICAL MODELING WITH DATA FITTING:",
                    "content": "Error function, least squares method; fitting data with polynomials and splines. (6)"
                },
                {
                    "title": "CAUSAL MODELING AND FORECASTING:",
                    "content": "Introduction, Modelling the causal time series, forecasting by regression analysis, predictions by regression. Planning, development and maintenance of linear models, trend analysis, modelling seasonality and trend,\n                        trend removal and cyclical analysis, decomposition analysis. Modelling financial time series. Econometrics and time series models.\n                        Non seasonal models: ARIMA process for univariate and multivariate. (10)"
                },
                {
                    "title": "PORTFOLIO MANAGEMENT:",
                    "content": "Simple market models, risk-free assets, risky assets, discrete time market model. Portfolio - Introduction, risk and return of a portfolio. Portfolio with two-securities- Risk and expected return, risk-reward analysis, asset pricing\n                        models, portfolio optimization, Markowitz model and efficient frontier m, Capital Asset Pricing Models (CAPM). (11)"
                },
                {
                    "title": "MODELING WITH BIOINFORMATICS:",
                    "content": "Introduction, Biological data- types, mode of collection, documentation and submission. Sequence alignment- Definition, significance, dot matrix method, dynamic programming- Global and local alignment tools, scoring\n                        matrices and gap penalties. Multiple sequence alignment: Iterative methods. Hidden Markovian models, statistical methods, position\n                        specific scoring matrices. (15)"
                }
            ],
            "textbooks": [
                "1. Giordano F R, Weir M D and Fox W P,“A First Course in Mathematical Modeling”, Brooks/Cole, 2013.",
                "2. Mount, DW, “Bioinformatics Sequence and genome analysis ”, Cold Spring Harbor Laboratory, 2004.",
                "3. Capinski M. and Zastawniak T,“Mathematics for Finance: An Introduction to Financial Engineering”, Springer, 2010"
            ]
        },
        {
            "code": "23XT93",
            "title": "INFORMATION RETRIEVAL AND WEB SEARCH",
            "semester": 9,
            "course_type": "regular",
            "credits": "3 0 0 3",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Overview of IR Systems - Historical Perspectives - Goals of IR - The impact of the web on IR - The role of artificial intelligence (AI) in IR. (3)"
                },
                {
                    "title": "TEXT REPRESENTATION:",
                    "content": "Statistical Characteristics of Text: Zipf's law; Porter stemmer; morphology; index term selection; using\n                        thesauri. Basic Tokenizing, Indexing: Simple tokenizing, stop-word removal, and stemming; inverted indices; Data Structure and\n                        File Organization for IR - efficient processing with sparse vectors. (6)"
                },
                {
                    "title": "RETRIEVAL MODELS:",
                    "content": "Similarity Measures and Ranking - Boolean Matching – Extended Boolean models - Ranked retrieval - Vector\n                        Space Models -, text-similarity metrics - TF-IDF (term frequency/inverse document frequency) weighting - cosine similarity, Probabilistic Models, Evaluations on benchmark text collections. (8)"
                },
                {
                    "title": "QUERY PROCESSING:",
                    "content": "Query Operations and Languages- Query expansion; Experimental Evaluation of IR: Performance metrics:\n                        recall, precision, and F-measure. (5)"
                },
                {
                    "title": "TEXT CATEGORIZATION AND CLUSTERING:",
                    "content": "Categorization: Rocchio; Naive Bayes, kNN; Clustering: Agglomerative clustering;\n                        k-means; Expectation Maximization (EM); Dimension Reduction: LSI, PCA. (6)"
                },
                {
                    "title": "WEB SEARCH:",
                    "content": "IR Systems and the WWW - Search Engines: Spidering, Meta Crawlers and near duplicate pages, Question answering, ; Link analysis: Hubs and Authorities, Google PageRank, Duplicate Detection. (5)"
                },
                {
                    "title": "INFORMATION FILTERING TECHNIQUES:",
                    "content": "Introduction to Information Filtering, Relevance Feedback - Applications of Information\n                        Filtering: RECOMMENDER SYSTEMS: Collaborative filtering and Content-Based recommendation of documents and products (6)"
                },
                {
                    "title": "INFORMATION EXTRACTION AND INTEGRATION:",
                    "content": "Extracting data from text; Basic Techniques: Named Entity Recognition, Co- reference Resolution, Relation Extraction, Event Extraction; Extracting and Integrating specialized information on the Web, Web Mining and Its Applications. (6)"
                }
            ],
            "textbooks": [
                "1. Christopher D. Manning, Prabhakar Raghavan and Hinrich Schütze, “Introduction to Information Retrieval”, Cambridge University Press, 2012.",
                "2. Stefan Büttcher, Charles L. A. Clarke, Gordon V. Cormack, “ Information Retrieval – Implementing and Evaluating Search Engines “, The MIT Press, 2016",
                "3. B.Croft, D. Metzler, T. Strohman, “Search Engines: Information Retrieval in Practice”, Pearson Education, 2015."
            ]
        },
        {
            "code": "23XT96",
            "title": "MODELLING AND SIMULATION LAB",
            "semester": 9,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "23XT97",
            "title": "INFORMATION RETRIEVAL AND WEB SEARCH LAB",
            "semester": 9,
            "course_type": "regular",
            "credits": "0 0 4 2"
        },
        {
            "code": "23XT98",
            "title": "RESEARCH SPECIALIZATION LAB - II",
            "semester": 9,
            "course_type": "regular",
            "credits": "0 0 0 12"
        },
        {
            "code": "23XTP2",
            "title": "PROJECT WORK II – INDUSTRY / RESEARCH PROJECT",
            "credits": "0 0 0 12"
        },
        {
            "code": "23XTE1",
            "title": "REINFORCEMENT LEARNING",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "REINFORCEMENT PROBLEM:",
                    "content": "ntroduction - Elements of RL, History of RL- Evaluative feedback -Goals and rewards – Returns -\n                        Bandit learning: Upper-confidence - bound algorithms - Thompson sampling, online learning - Multi agent reinforcement learning. (6)"
                },
                {
                    "title": "MARKOV DECISION PROCESS (MDP):",
                    "content": "CValue functions - Optimality Criterion in MDPs.- Partially Observed Markov Decision\n                        Process. (4)"
                },
                {
                    "title": "DYNAMIC PROGRAMMING (DP):",
                    "content": "Policy Evaluation- Policy Improvement - Value Iteration, asynchronous DP- Efficiency of DP- Stochastic DP. (5)"
                },
                {
                    "title": "MONTE CARLO METHODS:",
                    "content": "Policy Evaluation- Policy Improvement- On-policy and off- policy Monte Carlo controls-Incremental implementation. (8)"
                },
                {
                    "title": "TEMPORAL DIFFERENCE LEARNING (TD):",
                    "content": "TD-prediction- Optimality of TD - Sarsa- Q-Learning – R- Learning-Actor-Critic Model-\n                        Unifying Monte Carlo and TD-Traces- Games. (8)"
                },
                {
                    "title": "FUNCTION APPROXIMATION:",
                    "content": "Value prediction and control – Gradient Descent methods-Linear methods – Artificial Neural Network based approximation- lazy learning - Policy Gradient methods- REINFORCE algorithm, exact gradient methods, estimating gradients, approximate policy gradient algorithms, actor-critic methods - Deep Q Learning - Inverse RL (9)"
                },
                {
                    "title": "PLANNING AND LEARNING:",
                    "content": "Model based learning and planning - prioritized sweeping-Heuristic search. (5)"
                }
            ],
            "textbooks": [
                "1. Sutton R. S. and Barto A. G., \"Reinforcement Learning: An Introduction\", MIT Press, 2018.",
                "2. Dimitri P. Bertsekas, \"Reinforcement Learning and Optimal Control”, Athena Scientific, 2019",
                "3. Csaba Szepesvári, “Algorithms for Reinforcement Learning”, Morgan & Claypool, 2010.",
                "4. Masashi Sugiyama, “Statistical Reinforcement Learning : Modern Machine Learning Approaches”, CRC Press, Taylor & Francis Group, 2015"
            ]
        },
        {
            "code": "23XTE2",
            "title": "SOFTWARE PATTERNS",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO PATTERNS:",
                    "content": "Reusable object oriented software, Motivation, Best design practices of object oriented software,\n                        Coupling and Cohesion, Types of Cohesion and Coupling, Benefits of patterns, Definition of a Pattern, Types, Pattern description,\n                        Pattern Language, IDIOMS, Framework, Architecture. (6)"
                },
                {
                    "title": "DESIGN PATTERNS:",
                    "content": "Creational patterns – Abstract factory, Builder, Factory method, Prototype, Singleton, Structural patterns –\n                        Adapter, Bridge, Composite, Decorator, Façade, Flyweight, Proxy, Behavioral patterns – Command, Interpreter, Iterator, Mediator, Memento, Observer, State, Strategy, Template method, Visitor, Chain of Responsibility, Case Studies. (15)"
                },
                {
                    "title": "ARCHITECTURAL PATTERNS:",
                    "content": "From Mud to Structure – Layers, Pipes and Filters, Blackboard, Distributed systems – Broker, Interactive Systems – Model View Controller (MVC), Presentation Abstraction Control, Adaptable Systems – Reflection, Microkernel. Anti-Patterns. (13)"
                },
                {
                    "title": "REFACTORING:",
                    "content": "What is refactoring, Principles in refactoring, Bad smells in code, Refactoring Techniques - Composing methods, Moving features between objects, Organizing data, Simplifying conditional expressions, Making method calls simpler, Dealing with generalization. Design Refactoring – Technical Debt, Design Smells, Abstraction Smells, Encapsulation Smells, Modularization Smells, Hierarchy Smells, Architectural Refactoring. Refactoring Tools. (11)"
                }
            ],
            "textbooks": [
                "1. Erich Gamma, Richard Helm, Ralph Johnsons and John Vlissides, “Design Patterns: Elements of Reusable Object-Oriented Software”, Pearson Education, 2004.",
                "2. Frank Buschman, Regine Meunier, Hans Rohnert, Peter Sommerland and Michael Stal, “Pattern-Oriented Software Architecture: A System of Patterns”, John Wiley, 2011.",
                "3. Martin Fowler, Kent Beck, William Opdyke and Don Roberts, “Refactoring: Improving the Design of Existing Code”, Addison-Wesley Longman, 2012."
            ]
        },
        {
            "code": "23XTE3",
            "title": "NATURAL LANGUAGE PROCESSING",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Natural language processing techniques - analysis in NLP: morphological – syntactic, semantic - pragmatic - Applications (3)"
                },
                {
                    "title": "WORDS:",
                    "content": "Regular expressions – Automata – Morphology – Finite state Transducers – Finite state morphological parsing – Combining FST lexicon and rules – Porter Stemmer Algorithm – Probabilstic models for Spelling – Bayes method, Minimum edit distance - N- Grams – Counting words in Corpora – Simple n-grams – Smoothing – Evaluating language models : Entropy, Perplexity- Part of Speech Tagging (POS) – Rule based tagging – Stochastic based tagging – Transformation based tagging - Context Free Grammars\n                        - Top down parser – Earley Algorithm – Bottom-up parsing – CYK parser – Probabilistic parsing. (15)"
                },
                {
                    "title": "SEMANTICS & PRAGMATICS:",
                    "content": "First order predicate calculus – Syntax driven sematic analysis – Attachments for a fragment of\n                        English – Word Sense Disambiguation – Machine learning approaches – Dictionary based approaches – Pragmatics : Discourse –\n                        Text coherence. (10)"
                },
                {
                    "title": "NATURAL LANGUAGE GENERATION:",
                    "content": "Architecture of NLG Systems- Generation Tasks and Representations- Application of NLG.\n                        Machine Translation: Language similarities and differences – The transfer metaphor – Direct translation – Statistical translation - Translation involving Indian Languages. (12)"
                },
                {
                    "title": "CASE STUDIES:",
                    "content": "Mail spam, web spam detection, Fake news detection - Sentiment Analysis - Automatic summarization - Question answering - Named entity recognition and relation extraction - IE using sequence labeling - Open problems. (5)"
                }
            ],
            "textbooks": [
                "1. Daniel Jurafsky and James H. Martin, “Speech and Language Processing: An Introduction to Natural Language Processing, Computational Linguistics and Speech Recognition”, Prentice Hall, 2014.",
                "2. Jacob Eisenstein, Introduction to Natural language processing, The MIT Press, 2019."
            ]
        },
        {
            "code": "23XTE4",
            "title": "APPROXIMATION ALGORITHMS",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Definition-performance ratios, lower bounding OPT, vertex-cover problem- a greedy approach. (4)"
                },
                {
                    "title": "COMBINATORIAL ALGORITHMS:",
                    "content": "Set cover problem, Metric TSP, multiway cut problem, the minimum k-cut problem, FPTAS, PTAS,\n                        FPTAS for knapsack, greedy algorithms for Makespan-PTAS for minimum Makespan, Euclidean TSP. (10)"
                },
                {
                    "title": "LINEAR PROGRAMMING RELAXATIONS:",
                    "content": "LP-duality, min-max relations and LP-duality, rounding applied to vertex cover-simple\n                        rounding algorithm-randomized rounding, primal dual method and vertex cover. (9)"
                },
                {
                    "title": "CUTS, METRICAL RELAXATIONS AND EMBEDDINGS:",
                    "content": "Multiway cut, sum multicommodity flow, some applications of multicut,\n                        rounding for Sparsest Cut via L1 Embeddings. (8)"
                },
                {
                    "title": "SEMIDEFINITE PROGRAMMING:",
                    "content": "Strict quadratic programs and vector programs, properties of positive semidefinite matrices, the semidefinite programming problem, randomized rounding algorithm, improving the guarantee for MAX-2SAT. (7)"
                },
                {
                    "title": "HARDNESS OF APPROXIMATION:",
                    "content": "reduction, graphs, and hardness factors, statement of the PCP theorem, hardness of MAX-3SAT. (7)"
                }
            ],
            "textbooks": [
                "1. David P. Williamson, David B. Shmoys, “The design of approximation algorithms”, Cambridge university press, 2011",
                "2. Vijay V.Vazirani, “Approximation Algorithms”, SpringerVerlag, 2010."
            ]
        },
        {
            "code": "23XTE5",
            "title": "NETWORK ALGORITHMICSS",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Algorithms Vs Algorithmics – Network algorithmics – Network bottlenecks – Endnode bottlenecks – Router\n                        bottlenecks – characteristics of network algorithmics. (4)"
                },
                {
                    "title": "NETWORK IMPLEMENTATION MODELS:",
                    "content": "Protocols - Hardware - Network device architectures – Operating System Implementation Principles – System Principles – Principles for modularity and efficiency – Principles for speeding up routines – Principles in action. (8)"
                },
                {
                    "title": "ENDNODE ALGORITHMICS:",
                    "content": "Copying data – Transferring Control – Maintaining timers – Protocol Processing (8)"
                },
                {
                    "title": "ROUTER ALGORITHMICS:",
                    "content": "Exact match lookup – Prefix match look ups – Packet Classification – Switching – Scheduling packets –\n                        Computing traffic matrices (15)"
                },
                {
                    "title": "NETWORK SECURITY:",
                    "content": "Searching for multiple strings in packet payloads – IP trace back via probabilistic marking and logging – Detecting worms. (10)"
                }
            ],
            "textbooks": [
                "1. George Varghese, “Network Algorithmics, An Interdisciplinary Approach to Designing Fast Networked Devices”, Morgan Kaufmann, 2006.",
                "2. Michal Pioro and Deepankar Medhi, “Routing Flow and Capacity Design in Communication and Computer Networks”, Morgan Kaufmann, 2007."
            ]
        },
        {
            "code": "23XTE6",
            "title": "SOCIAL NETWORK ANALYSIS",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Motivation - different sources of network data - types of networks - tools for visualizing network data - review of\n                        graph theory basics. (9)"
                },
                {
                    "title": "GRAPH THEORETIC PROPERTIES OF SOCIAL NETWORKS:",
                    "content": "Notions of centrality - Strong and weak ties – Homophily - Structural\n                        Balance. (5)"
                },
                {
                    "title": "DYNAMIC PROPERTIES OF NETWORKS:",
                    "content": "Information diffusion - networks effects on information diffusion - maximizing influence\n                        spread - power law and heavy tail - preferential attachment models - small world phenomenon - cascading behavior on networks - Epidemics. (11)"
                },
                {
                    "title": "BEHAVIORAL PROPERTIES ON NETWORKS:",
                    "content": "Network economics - Bargaining and power in networks - Sponsored search markets. (10)"
                },
                {
                    "title": "MINING GRAPHS:",
                    "content": "Community and cluster detection: random walks - spectral methods - link analysis for web mining-overview of\n                        social tagging and applications. (10)"
                }
            ],
            "textbooks": [
                "1. David Easley and Jon Kleinberg, “Networks, Crowds, and Markets: Reasoning About a Highly Connected World”, Cambridge University Press, 2010."
            ]
        },
        {
            "code": "23XTE7",
            "title": "ADVANCED COMPUTER GRAPHICS",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "GEOMETRICAL TRANSFORMATIONS:",
                    "content": "Transformation as a change in coordinate system. Viewing in 3D: Projections – specifying\n                        arbitrary 3D viewing – The Mathematics of planar geometric projections – implementing planar geometric projections, Coordinate\n                        systems. (3)"
                },
                {
                    "title": "OBJECT HIERARCHY:",
                    "content": "Geometric modeling- Characteristics of retained – mode graphics packages – Defining and displaying structure – Modeling transformations, Hierarchical structure networks. Input devices – interaction techniques And interaction task."
                },
                {
                    "title": "USER INTERFACE SOFTWARE:",
                    "content": "Basic interaction – handling models - window management systems – User-interface management\n                        systems. (9)"
                },
                {
                    "title": "REPRESENTING CURVES AND SURFACES:",
                    "content": "Polygon meshing – parametric cubic curves, Parametric bicubic surfaces, Quadric surfaces. SOLID MODELLING: Representing solids – Regularized Boolean set operations – Primitive instancing – Sweep representations – Boundary representations – Spatial – Partitioning representations – Constructive solid geometry – Comparison of representation – User interfaces for solid modeling."
                },
                {
                    "title": "VISIBLE SURFACE DETERMINATION:",
                    "content": "Function of two variables – Techniques for efficient visible surface algorithms – Algorithms\n                        for visible line determination– Visible ray tracing. (12)"
                },
                {
                    "title": "REALISM:",
                    "content": "Fundamental difficulties – Rendering techniques for line drawing, shaded images – Improved object models – Dynamics – stereopsis – Improved displays – Interacting with our other senses – Aliasing and antialiasing. ACHROMATIC AND COLORED LIGHT: Achromatic light – Chromatic color – Color Models for Raster Graphics – Reproducing Color – Using Color in Computer Graphics. illuminations and shading: Illumination models – Shading models for polygons – Surface detail – Shadows – Transparency – Inter\n                        object reflections – Physically based illumination models – Extended light sources – Spectral sampling – Improved camera model –\n                        Global Illumination algorithms – Recursive ray tracing – Radiosity methods – The rendering pipeline. (11)"
                },
                {
                    "title": "IMAGE MANIPULATION AND SHADING:",
                    "content": "Filtering – Image Processing – Geometric transformations of Images – Multipass transformation – Image Composition – Mechanism for Image Storage – Special Effects with images. ANIMATION : Conventional and Computer assisted Animation – Animation languages – Methods of controlling animation - Basic rules of animation – Problems peculiar\n                        to animation. (10)"
                }
            ],
            "textbooks": [
                "1. Foley James D, Vandam Andries and Hughes John F, \"Computer Graphics: Principles and Practice\", Addison-Wesley, 2013.",
                "2. Donald Hearn, M. Pauline Baker and Warren Carithers, “Computer Graphics with OpenGL”, Pearson Education, 2013."
            ]
        },
        {
            "code": "23XTE8",
            "title": "COMPUTER VISION AND IMAGE ANALYSIS",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "IMAGE FORMATION:",
                    "content": "Geometric primitives and transformations - Photometric image formation - The digital camera. (3)"
                },
                {
                    "title": "IMAGE PROCESSING:",
                    "content": "Point operators - linear filtering - Neighborhood operators - Histogram - Fourier transforms - Pyramids and\n                        wavelets - Global optimization. (6)"
                },
                {
                    "title": "SEGMENTATION:",
                    "content": "Active contours - Split and merge - Mean shift and mode finding - Normalized cuts - Graph cuts and energy - based\n                        methods. (5)"
                },
                {
                    "title": "RECOGNITION:",
                    "content": "Object detection - Face recognition - Instance recognition - Category recognition - Context and scene understanding. (4)"
                },
                {
                    "title": "FEATURE EXTRACTION:",
                    "content": "Spatial Feature - Edge Detection - Boundary Extraction - Boundary Representation - Region Representation -\n                        Moment Representation - Shape Features - Texture. (5)"
                },
                {
                    "title": "IMAGE COMPRESSION:",
                    "content": "Basic requirements - Types of compression - Coding Algorithms. (4)"
                },
                {
                    "title": "FINDING TEMPLATES USING CLASSIFIERS:",
                    "content": "Classifiers - Feature Selection - Neural Networks - Support Vector Machine - Deep Learning\n                        - Convolutional Neural Networks - Multiple Classifiers. (9)"
                },
                {
                    "title": "MOTION DETECTION:",
                    "content": "Flow and correspondence - Optical flow - based motion estimation - Quadrature filter techniques - Correlation and matching - Modeling of flow fields. (5)"
                },
                {
                    "title": "CASE STUDIES:",
                    "content": "Applications of computer vision and image analysis. (4)"
                }
            ],
            "textbooks": [
                "1. Richard Szeliski, “Computer Vision: Algorithms and Applications”, Springer, 2010.",
                "2. Anil K Jain, “Fundamentals of Digital Image Processing”, Prentice Hall, 2001.",
                "3. David Forsyth and Jean Ponce, “Computer Vision: A Modern Approach”, Pearson, 2012.",
                "4. Bernd Jahne, “Computer Vision and Applications A Guide for Students and Practitioners”, Elsevier, 2000."
            ]
        },
        {
            "code": "23XTE9",
            "title": "DATA COMPRESSION",
            "course_type": "professional_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "DATA COMPRESSION LEXICON:",
                    "content": "Introduction to Data Compression - Dawn Age - Coding - Lossy Compression. (4)"
                },
                {
                    "title": "MINIMUM REDUNDANCY CODING (THE DAWN AGE):",
                    "content": "The Shannon - Fano Algorithm, The Huffman Algorithm - Into the Huffman\n                        Code: Counting the Symbols, Building the tree. (5)"
                },
                {
                    "title": "ADAPTIVE HUFFMAN CODING:",
                    "content": "Adaptive Coding - Updating the Huffman Tree - Escape code. (5)"
                },
                {
                    "title": "ARITHMETIC HUFFMAN CODING:",
                    "content": "Arithmetic Coding with floating point data type – Arithmetic coding with integral data type. (6)"
                },
                {
                    "title": "STATISTICAL MODELING:",
                    "content": "Higher-order Modeling - Finite Context Modeling – Order one modeling – Order two Modeling. (5)"
                },
                {
                    "title": "SPEECH COMPRESSION:",
                    "content": "Digital Audio Concepts - Lossless Compression of Sound. (5)"
                },
                {
                    "title": "VIDEO COMPRESSION:",
                    "content": "JPEG Compression - Implementing DCT - Complete Code Listing. (5)"
                },
                {
                    "title": "DICTIONARY-BASED COMPRESSION:",
                    "content": "LZ77 Compression and Decompression - LZSS Compression and Decompression - LZ78 Compression and Decompression - LZW Compression and Decompression – LZMW Compression and Decompression - LZAP Compression and Decompression – LZY Compression and Decompression. (10)"
                }
            ],
            "textbooks": [
                "1. Khalid Sayood, “Introduction to Data Compression”, Morgan Kaufmann, 2013.",
                "2. David Salomon, “Data Compression: The Complete Reference”, Springer, 2014"
            ]
        },
        {
            "title": "23XTEB SECURITY IN COMPUTING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Security concepts –Threats- Attacks - vulnerabilities and exploiting vulnerabilities - Services and Mechanisms -\n                        attacks and defenses on Computer systems. (4)"
                },
                {
                    "title": "SOFTWARE SECURITY AND TRUSTED SYSTEMS:",
                    "content": "Malicious and non-Malicious programs – Buffer overflows - Fast flux - Covert\n                        channels -Defense mechanisms – Security Policies - Types - Trusted Computing - Trusted OS design - Virtualization security – containers. (7)"
                },
                {
                    "title": "OPERATING SYSTEM SECURITY :",
                    "content": "Windows security - Understanding User Authentication- Securing Access with Permissions- Unix\n                        Security Overview - Protecting User Accounts and Strengthening Authentication - Limiting Super user Privileges - Securing Local and\n                        Network File Systems - Network Configuration - Hardening Linux and Unix - Proactive Defense for Linux and Unix (12)"
                },
                {
                    "title": "SECURITY AT NETWORK LAYER:",
                    "content": "Network layer threats and security controls –Security problems in TCP/IP protocol suite – DNS\n                        Cache poisoning - IPSec – modes – security protocols – SA – Internet key exchange. (8)"
                },
                {
                    "title": "ETHICAL HACKING AND PENETRATION TESTING:",
                    "content": "Principles of Intrusion detection – types– Architecture - Intrusion Detection and\n                        response - Network penetration testing- reconnaissance – scanning- Exploitation. (7)"
                },
                {
                    "title": "WEB APPLICATION SECURITY:",
                    "content": "Email security –S/MIME – Web Security – Cross site scripting – SQL injection attacks – Defense methods- Session integrity for web applications- SSL Architecture – Secure session management-- Session hijacking - securing a web server. (7)"
                }
            ],
            "textbooks": [
                "1. Roberta Bragg, Mark Rhodes, Keith Strass Berg J, “Network Security - The complete reference”, Tata McGraw Hill, 2017.",
                "2. John r. Vacca , “Network and system security”, Syngress,imprint of Elsevier, 2014",
                "3. Patrick Engebretson ,David Kennedy , “The Basics of Hackingand Penetration Testing”, Syngress publications ,Elseiver,, 2013.",
                "4. Darril Gibson , Microsoft Windows Security Essentials, ,Wiley, June 2011"
            ]
        },
        {
            "title": "23XTEC ADVANCED OPERATING SYSTEMS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "LINUX SYSTEM:",
                    "content": "Design Principles – Kernel Modules – Process Management Scheduling – Memory Management – Input-Output Management – File System –Inter-process Communication. iOS and Android: Architecture and SDK Framework – Media Layer –\n                        Services Layer – Core OS Layer. (6)"
                },
                {
                    "title": "OVERVIEW OF SYSTEM CALLS:",
                    "content": "anatomy of a system call and x86 mechanisms for system call implementation - MMU/memory translation, segmentation, and hardware traps interact - create kernel-user context separation – virtualization. (6)"
                },
                {
                    "title": "THE KERNEL EXECUTION AND PROGRAMMING CONTEXT:",
                    "content": "Live debugging and tracing– Hardware and software support for\n                        debugging –Dtrace: programming, implementation/design, internals–Kprobes and SysTrace: Linux catching up. (7)\n                        Linking and loading– Executable and Linkable Format (ELF) – Internals of linking and dynamic linking –Internals of effective spinlock implementations on x86. (4)\n                        Process and thread kernel data structures– process table traversal – lookup, allocation and management of new structures- /proc internals– optimizations. (4)\n                        Virtual File System and the layering of a file system call from API to driver– Object-orientation patterns inkernel code– a review of OO implementation generics (C++ vtables, etc). (8)\n                         Kmem and Vmem allocators. OO approach to memory allocation–Challenges of multiple CPUs and memory hierarchy–Overview of the kernel network stack implementation– Path of a packet through a kernel– Berkeley Packet Filter architecture– Linux Netflter architecture. (10)"
                }
            ],
            "textbooks": [
                "1. Robert Love, Linux System Programming, O’Reilly, 2013",
                "2. Yang Lixiang, Liang Wenfeng, The Art of Kernel Linux design, CRC Press, 2016",
                "3. Rami Rosen, Linux Kernel Networking : Implementation and Theory, Apress, 2014."
            ]
        },
        {
            "title": "23XTED EXACT ALGORITHMS FOR HARD PROBLEMS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "POLYNOMIAL TIME ALGORITHMS FOR TREES AND SPECIAL INSTANCES OF SAT:",
                    "content": "2-SAT, Horn SAT - Algorithms for vertex cover, dominating set, independent set in trees. (7)"
                },
                {
                    "title": "POLYNOMIAL TIME ALGORITHMS FOR SPECIAL GRAPHS:",
                    "content": "Vertex cover in bipartite graphs: Konig’s theorem - interval graphs -  chordal graphs - split graphs - permutation graphs - perfect graphs. (7)"
                },
                {
                    "title": "PARAMETERIZED ALGORITHMS:",
                    "content": "Fixed-parameter tractability (FPT): Basic Algorithmic Techniques: Kernelization, Branching, Iterative Compression, Miscellaneous Techniques: Linear Programming, Color Coding. (10)"
                },
                {
                    "title": "HARDNESS THEORY:",
                    "content": "Introduction to Reductions, W[1] & W[2] hard reduction – reduction with vertex and edge representation. (7)"
                },
                {
                    "title": "EXACT EXPONENTIAL ALGORITHMS:",
                    "content": "Exponential-Time Hypothesis (ETH) – ETH and classical complexity – ETH and FPT problems – ETH and W[1] problems. (7)"
                },
                {
                    "title": "ETH BASED LOWER BOUNDS:",
                    "content": "Branching - Hitting set - Dynamic Programming – Inclusion Exclusion – Treewidth. (7)"
                }
            ],
            "textbooks": [
                "1.\tMartin Charles Golumbic, “Algorithmic Graph Theory and Perfect Graphs”, Annals of Discrete Mathematics, Elsevier, 2004.",
                "2.\tRolf Niedermeier, “Invitation to Fixed-Parameter Algorithms”, Oxford Univ. Press, 2006.",
                "3.\tFomin F V., Kratsch D, “Exact Exponential Algorithms”, Springer, 2010."
            ]
        },
        {
            "title": "23XTEE MOBILE COMPUTING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Introduction to mobile and wireless devices - wireless networking, Advantages and disadvantages of wireless networking, Evolution of mobile communication generations- Challenges in mobile computing – Vertical and horizontal mobile applications - Wireless LAN and Wireless WAN. (5)"
                },
                {
                    "title": "CELLULAR CONCEPT:",
                    "content": "Wireless transmission - Frequencies for radio transmission - Regulations - Signals , Antennas , Signal propagation ,Path loss of radio signals , Additional signal propagation effects - Multi-path propagation - Multiplexing - Space division multiplexing - Frequency division multiplexing -Time division multiplexing - Code division multiplexing - Spread spectrum - Direct sequence spread spectrum - Frequency hopping spread spectrum. (10)"
                },
                {
                    "title": "CELLULAR NETWORK :",
                    "content": "Cellular Concepts – Factors determining cell size and shape - GSM-Mobile services - System architecture\n                        -- Handover – GPRS – Mobile services – System architecture – Location Management strategies – Eager caching Vs lazy caching - LTE Network architecture and interfaces. (10)"
                },
                {
                    "title": "MOBILE APPLICATIONS ARCHITECTURE:",
                    "content": "Smart Client – Smart Client Architecture – Messaging Architecture – The Model-View- Controller Model- Delegate Pattern- Building Smart Client Applications-Design, Development, implementation, testing and deployment phase- MVVM mobile architecture design. (6)"
                },
                {
                    "title": "MOBILE APPLICATION DEVELOPMENT:",
                    "content": "Introduction to Android Platform – Android architecture overview - Application life cycle - UI design for Android - Different types of layouts – Widgets – List view and Adapters - Dialogs and Toasts – Intent filters - Files and database – SQLite on Android - Security model – Comparison with IOS application development -Building cross-platform applications using React Native. (14)"
                }
            ],
            "textbooks": [
                "1. Jochen Schiller, “Mobile Communications”, Pearson Education, 2012.",
                "2. Martyn Mallick, “Mobile and Wireless Design Essentials”, Wiley, 2003",
                "3. John Horton, “Android Programming for Beginners”, Packt Publishing, 2017."
            ]
        },
        {
            "title": "23XTEF BIG DATA AND MODERN DATABASE SYSTEMS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "OBJECT AND SPATIAL DATABASES:",
                    "content": "Object Oriented Databases - Complex data types - Structured types and Inheritance - Query Processing in Object databases - Spatial Databases : Geometric Information System - Spatial Data Types – Spatial Queries - Spatial\n                        indexing techniques. (6)"
                },
                {
                    "title": "PARALLEL AND DISTRIBUTED DATABASES:",
                    "content": "Architecture of parallel databases – Parallel query evaluation, Parallel query optimization – Distributed DBMS Architecture, Distributed Database Design, Distributed Query Processing. (5)"
                },
                {
                    "title": "DATA MODELING FOR BIG DATA:",
                    "content": "Big Data and Challenges, Big Data models, NoSQL data models, Basic principles of NoSQL\n                        models, BASE properties, CAP Theorem, SQL databases Vs NoSQL databases - MAP-REDUCE: Apache Hadoop and HDFS,\n                        SPARK. (10)"
                },
                {
                    "title": "NOSQL DATABASES (PART 1):",
                    "content": "Key - Value Stores: Amazon DynamoDB, Key -Value Stores (in-memory) : Redis , Column Oriented\n                        Store: Google BigTable , Apache Cassandra - Hbase. (10)"
                },
                {
                    "title": "NOSQL DATABASES (PART 2):",
                    "content": "Document Oriented Stores – MongoDB - Apache CouchDB - Graph databases: Neo4J – OrientDB. (9)"
                },
                {
                    "title": "DATABASE INTEGRATION:",
                    "content": "Data warehousing, Virtual Data Integration - Schema directed data integration - Schema mapping and\n                        information preservation. (5)"
                }
            ],
            "textbooks": [
                "1. Pramod J. Sadalage and Martin Fowler, “NoSQL Distilled - Brief Guide to the Emerging World of Polyglot Persistence”, Pearson Education, 2013.",
                "2. Guy Harrison, “Next generation Databases: NoSQL and BigData”, Apress, 2015.",
                "3. Kristina Chodorow, Shannon Bradshaw, Eoin Brazil, “MongoDB: The Definitive Guide”, O’Reilly Media, 2019",
                "4. Holden Karau, Andy Konwinski, Patrick Wendell, Matei Zaharia, “Learning Spark: Lightning-Fast Big Data Analysis”, O'Reilly Media, 2015"
            ]
        },
        {
            "title": "23XTEG NETWORK SCIENCE",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Basics of networks and graphs, random network model - degree distribution, evolution, small world property, six\n                        degrees of separation, Watts-Strogatz model, local clustering coefficient, random networks and network science. (5)"
                },
                {
                    "title": "BARABÁSI-ALBERT MODEL:",
                    "content": "Growth and preferential attachment, Barabási-Albert model, degree dynamics, degree distribution,\n                        diameter and the clustering coefficient, preferential attachment - absence of growth, measure, non-linearity, the origins. (8)"
                },
                {
                    "title": "SCALE-FREE PROPERTY:",
                    "content": "Power laws and scale-free networks, Hubs, Universality, Ultra-small property, role of the degree exponent, Generating networks with a pre-defined degree distribution. (8)"
                },
                {
                    "title": "EVOLVING NETWORKS:",
                    "content": "Bianconi-Barabási model, measuring fitness, Bose-Einstein condensation, evolving networks. (8)"
                },
                {
                    "title": "DEGREE CORRELATIONS:",
                    "content": "Assortativity and disassortativity, Measuring degree correlations, Structural cutoffs, Degree correlations\n                        in real networks, Generating correlated networks, impact of degree correlations. (8)"
                },
                {
                    "title": "NETWORK ROBUSTNESS:",
                    "content": "Percolation theory, robustness of scale-free networks, attack tolerance, cascading failures, modeling\n                        cascading failures, building robustness. (8)"
                }
            ],
            "textbooks": [
                "1. Albert-LászlóBarabási, Network Science, Cambridge University Press, 2016.",
                "2. Filippo Menczer, Santo Fortunato, Clayton A. Davis, “A First Course in Network Science”, Cambridge University Press, 2020."
            ]
        },
        {
            "title": "23XTEH SECURITY MODELLING AND ANALYSIS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Computer security - Cryptographic protocols - Security analysis - Needham-Schroeder example - Model checker- Murphi. \t(5)"
                },
                {
                    "title": "KEY EXCHANGE AND CONTRACT-SIGNING PROTOCOLS:",
                    "content": "Key management - Kerberos - Public-Key infrastructure - Security properties and attacks on them - Diffie-Hellman key exchange - IPSEC - IKE. Contract-Signing and Fair-Exchange - Trusted third party\n                        - Optimistic Contract-Signing - Asokan-Shoup-Waidner protocol - Desirable properties –fairness- timeliness- accountability - Abuse-\n                        Free Contract-Signing. (10)"
                },
                {
                    "title": "MODELING SECURITY PROTOCOLS IN CSP:",
                    "content": "Data types for protocol models- Modeling intruder - Expressing protocol goals - Overview of FDR and Casper - Protocol specifications - Case study: Wide-Mouthed-Frog protocol. (10)"
                },
                {
                    "title": "EVOLVING NETWORKS:",
                    "content": "Bianconi-Barabási model, measuring fitness, Bose-Einstein condensation, evolving networks. (8)"
                },
                {
                    "title": "PROTOCOL COMPOSITION LOGIC:",
                    "content": "Proving protocols secure - Symbolic model - Challenge Response example - Informal ‘hand’\n                        proof - Formalization: protocol specification language - syntax - semantics - proof system - Protocol composition - Complexity theoretic semantics. (10)"
                },
                {
                    "title": "FORMAL PROOF OF COMPUTER SECURITY PROTOCOLS:",
                    "content": "Protocol Verification by BAN logic and Inductive Method: BAN logic-\n                        syntax and semantics - Inductive Method: Analysis by theorem proving - Inductive proofs - Protocol traces - Dolev-Yao attacker model. (10)"
                }
            ],
            "textbooks": [
                "1. Peter Ryan, Steve Schneider, ‘Modeling and analyzing security protocols: the CSP approach’. Addison-Weasley, 2001",
                "2. Colin Boyd, Anish Mathuria, ‘Protocols for Authentication and Key Establishment’. Springer, 2010."
            ]
        },
        {
            "title": "23XTEI INTERNET OF THINGS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO IoT:",
                    "content": "Introduction to Internet of Things (IoT) – Machine to Machine (M2M) –- Features and Definition of IoT–\n                        Recent Trends in the Adoption of IoT – Societal Benefits. (2)"
                },
                {
                    "title": "IoT ARCHITECTURE:",
                    "content": "Functional Requirements - IoT Enabling Technologies – IPv6 - Basic Architecture – Components of IoT: Embedded Computation Units, Microcontrollers, System on Chip (SoCs) - Sensors – Actuators – Communication Interfaces. (7)"
                },
                {
                    "title": "RF COMMUNICATION TECHNOLOGIES INIoT:",
                    "content": "Wireless Sensor Networks (WSN): Overview, Fault Tolerance - RFID – NFC - Low\n                        Power Personal Area networks (LowPAN): Overview, 6LowPAN,IEEE 802.15.4, BLE, Zigbee, Zwave, and Thread - Wi-Fi -Low Power\n                        Wide Area Networks (LPWAN): Concepts and features, SigFox, LoraWAN, LPWAN-3GPP,Comparing different LPWAN technologies. (7)"
                },
                {
                    "title": "APPLICATION LAYER PROTOCOLS IN IoT:",
                    "content": "Rest Architecture - HTTP – CoAP: Architecture, Features, Applications -MQTT: Architecture, Feature, Applications -Comparing different IoT Application Layer Protocols. (7)"
                },
                {
                    "title": "MODERN NETWORKING:",
                    "content": "Cloud Computing: Introduction to the Cloud Computing, Cloud service options, Cloud Deployment models,\n                        Load balancing, Hypervisors, Comparison of Cloud providers - Introduction to SDN: Data Plane, Control Plane, Application Plane - OpenFlow Protocol – Relevance of SDN to IoT. (8)"
                },
                {
                    "title": "SECURITY IN IoT:",
                    "content": "IEEE 802.11 Wireless Networks Attacks: Basic Types, WEP Key Recovery Attacks, Keystream Recovery Attacks\n                        against WEP – RFID Security – Security Issues in ZigBEE: Eavesdropping Attacks, Encryption Attacks – Bluetooth Security: Threats\n                        to Bluetooth Devices and Networks – Blockchain in IoT security. (10)"
                },
                {
                    "title": "PROTOTYPING::",
                    "content": "Prototyping embedded devices- Open Source versus Closed Source-Embedded Computing Basics-Arduino-\n                        Raspberry Pi- Implementation. (2)"
                },
                {
                    "title": "APPLICATIONS INIoT:",
                    "content": "Smart homes – Energy – Health Care – Smart Transportation – Smart Living – Smart Cities- Smart Grid –\n                        Smart Agriculture. (2)"
                }
            ],
            "textbooks": [
                "1. Dieter Uckelmann, Mark Harrison, Florian Michahelles, “Architecting the Internet of Things”, Springer, 2011",
                "2. Adrian McEwen and Hakim Cassimally, “Designing the Internet of Things”, John Wiley, 2014.",
                "3. Thomas Erl, Dr. Zaigham Mahmood, Professor Ricardo Puttini,\"Cloud Computing: Concepts, Technology & Architecture\",PHI, 2013",
                "4. Brian Russell, Drew Van Duren, \"Practical Internet of Things Security\", Packt Publishing, 2016."
            ]
        },
        {
            "title": "23XTEJ EPIDEMIC MODELS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "The epidemic in a closed population – Initial growth-the final size. Heterogeneity: Differences in infectivity, differences in infectivity and susceptibility. (9)"
                },
                {
                    "title": "STRUCTURED POPULATIONS:",
                    "content": "The concept of state - i-states, p-states, recapitulation and problem formulation. (7)"
                },
                {
                    "title": "THE BASIC REPRODUCTION RATIO:",
                    "content": "The definition of R0, general h-state, on conditions that simplify the computation of R0, sub\n                        models for the kernel, extended example, pair formulation models. Partially vaccinated populations, the intrinsic growth rate r, some generalities, separable mixing. (15)"
                },
                {
                    "title": "MACROPARASITES:",
                    "content": "Introduction, counting parasite load, the calculation of R0 for life cycles, seasonality and R0, a pathological model. (8)"
                },
                {
                    "title": "CONTACT:",
                    "content": "Introduction, Contact duration, consistency conditions, effects of subdivision, network models. (6)"
                }
            ],
            "textbooks": [
                "1.Diekmann, J.A.P. Heesterbeek, “Mathematical Epidemiology of Infectious Diseases: Model building, Analysis and Interpretation”, John Wiley , 2000.",
                "2.Fred Brauer, Carlos Castillo-Chawez, and Zhilan Feng, \"Mathematical models in Epidemiology\", Springer, 2019.",
                "3.Diekmann O., Heesterbeek, J.A.P. and Britton, T. Mathematical tools for understanding infectious disease dynamics. Princeton University Press, 2012."
            ]
        },
        {
            "title": "23XTEK STATISTICAL LEARNING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "THEORETICAL FOUNDATIONS :",
                    "content": "Review of Statistical Inference, Review of Probability, Testing of Hypothesis – Introduction to\n                        Function Spaces – Vector Spaces - Metric Spaces – Cauchy Sequence – Complete Metric Space – Normed Space, Inner Product\n                        Space – Banach Space - Hilbert Space – Sobolev – Examples - Mercer Kernels - Reproducing Kernel Hilbert Space (RKHS), Concentration of Measure : Measures of Complexity - Rademacher Complexity (10)"
                },
                {
                    "title": "LINEAR REGRESSION:",
                    "content": "Simple, Multiple, Other Considerations in the Regression Model – Resampling Methods – Cross-Validation, Bootstrap – Linear Model Selection & Regularisation – Subset Selection , Shrinkage Methods – Ridge, Lasso, Dimension Reduction\n                        Methods. (8)"
                },
                {
                    "title": "NON-LINEAR REGRESSION :",
                    "content": "Polynomial Estimators, Step Functions, Basis Functions, Regression Spline, Smoothing Splines,\n                        Local Regression, Generalised Additive Models (4)"
                },
                {
                    "title": "LINEAR CLASSIFICATION:",
                    "content": "Review of Classification Models, Logistic Regression, Linear Discriminant Analysis, Quadratic\n                        Discriminant Analysis, Comparison of Classification Methods. (6)"
                },
                {
                    "title": "TREE BASED METHODS:",
                    "content": "Regression Trees, Classification Trees, Bagging, Random Forests, Boosting. (9)"
                },
                {
                    "title": "SUPPORT VECTOR MACHINES:",
                    "content": "PMaximal Margin Classifier – Support Vector Classifiers - Support Vector Machines – Non-linear\n                        Decision Boundaries – SVMs with more than 2 classes. (4)"
                },
                {
                    "title": "UNSUPERVISED LEARNING:",
                    "content": "Principal Components Analysis – Clustering Methods – K-Means Clustering, Hierarchical Clustering. (4)"
                }
            ],
            "textbooks": [
                "1. Gareth James, Daniela Witten, Trevor Hastie, Robert Tibshirani, “An introduction to Statistical learning”, Springer, 2013.",
                "2. Trevor Hastie, Robert Tibshirani, Jerome Friedman, “Elements of Statistical Learning: Data Mining, Inference and Prediction”,"
            ]
        },
        {
            "title": "23XTEL LARGE SCALE MACHINE LEARNING",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "Properties of High-Dimensional Space - Gaussians in High Dimension -Bounds on Tail Probability Applications of the\n                        tail bound - Convex analysis. (7)"
                },
                {
                    "title": "RANDOM PROJECTIONS AND APPLICATIONS IN DIMENSIONALITY REDUCTION:",
                    "content": "Random Projection and Johnson Lindenstrauss Theorem - Best-Fit Subspaces and Large-Scale SVD using Random Projections - Spectral Decomposition. (6)"
                },
                {
                    "title": "OPTIMIZATION FOR LARGE SCALE MACHINE LEARNING:",
                    "content": "First-order Methods for Large Scale Optimization – Stochastic gradient\n                        with sub sampling - Accelerating SGD with preconditioning and adaptive learning - Noise reduction - Dynamic sample size methods -\n                        Second order methods- Quasi-Newton methods - Distributed optimization - Derivative free optimization – Contrastive divergence –\n                        Markov Chain Monte Carlo – Gibbs sampling. (14)"
                },
                {
                    "title": "RANDOM MATRICES :",
                    "content": "Introduction to random matrix theory - Concentration of measure and random matrices - Large Covariance\n                        matrix estimation. (8)"
                },
                {
                    "title": "SPARSE RECOVERY: THEORY AND ALGORITHMS :",
                    "content": "Introduction to sparse recovery - A Statistical View of Sparse Recovery - Noiseless Sparse Recovery - Approximations - Sampling theorem - Elastic Net - Fussed Lasso - Low-rank Matrix Recovery –Sketching\n                        and Randomized Linear Algebra - Approximate nearest neighbor in high dimensional data - Locality sensitive data structures. (10)"
                }
            ],
            "textbooks": [
                "1. Martin J, Wain Wright, “High-dimensional statistics: A non-asymptotic viewpoint”, Cambridge University Press, 2019",
                "2. T. Tao, “Topics in random matrix theory,” American Mathematical Society, 2012"
            ]
        },
        {
            "title": "23XTEM COMPUTATIONAL GEOMETRY",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "MATHEMATICAL & GEOMETRICAL REVIEW:",
                    "content": "Algorithm analysis – sorting, binary search, balanced binary search, divide and\n                        conquer, plane sweep, Kd-trees, Dijkstra’s algorithm, points, lines and planes, basic geometric objects – polygons, polytopes, convexity, graphs - vertex coloring, planar, Euler’s formula. (2)"
                },
                {
                    "title": "CONVEX HULLS:",
                    "content": "Definition, lower bounds, algorithms - Graham's scan, divide and conquer, Jarvis march, 3D hulls. (5)"
                },
                {
                    "title": "LINE SEGMENT INTERSECTION:",
                    "content": "Plane sweep algorithm, Doubly-connected edge list, computing overlay of two subdivisions, Map\n                        overlay algorithm, half-plane intersection, arrangements of lines. (8)"
                },
                {
                    "title": "POLYGON TRIANGULATION:",
                    "content": "Art gallery problem – introduction, triangulation, bounds, partition into monotone pieces, triangulating monotone polygon, placement of guards. (8)"
                },
                {
                    "title": "ORTHOGONAL RANGE SEARCHING:",
                    "content": "1-D and 2-D range searching, range trees. (4)"
                },
                {
                    "title": "VORONOI DIAGRAMS:",
                    "content": "Properties, beach line, computing Voronoi diagram, Delaunay triangulations, computing Delaunay\n                        triangulations. (8)"
                },
                {
                    "title": "ROBOT MOTION PLANNING:",
                    "content": "Work space and configuration space, point robot, free space, Minkowski sums for convex and nonconvex polygons, translational motion planning, motion planning with rotations, Point location and trapezoidal maps. Visibility graphs - Shortest paths for a point robot, computing visibility graph, shortest paths for a translating polygonal robot. (10)"
                }
            ],
            "textbooks": [
                "1. Mark de Berg, Otfried Cheong, Marc van Kreveld, Mark Overmars, “Computational Geometry - Algorithms and Applications”, Springer Verlag, 2011.",
                "2. Joseph O’Rourke, “Computational Geometry in C”, Cambridge University Press, 2008."
            ]
        },
        {
            "code": "23XTO1",
            "title": "COMPUTATIONAL FINANCE",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION :",
                    "content": "of one price – Risk neutral pricing – Arbitrage and Hedging – Financial Products and capital markets – Futures, \n                        Forwards and options – Options pricing problem and three types of solutions.(5)"
                },
                {
                    "title": "ATHEMATICAL PRELIMINARIES :",
                    "content": "expectation – Sigma Algebra – Filtrations, Time series analysis - Covariance \n                        stationary – autocorrelations - MA(1) and AR(1) models, Stochastic Calculus - Random walk – Brownian motion – Martingales –\n                        Ito’s Lemma (12)"
                },
                {
                    "title": "PORTFOLIO THEORY -",
                    "content": "- Portfolio theory with matrix algebra - Review of constrained optimization methods, Markowitz \n                        algorithm, Markowitz Algorithm using the solver and matrix algebra – Portfolio choice and linear pricing – Statistical analysis of efficient \n                        portfolios (10)"
                },
                {
                    "title": "BASIC OPTIONS THEORY –",
                    "content": "– Pay off diagrams – Single period binomial options theory – Multi period binomial options \n                        theory – Real options – American options, Simulation methods for options pricing – Random variable generation – simulation of \n                        stochastic processes (8)"
                },
                {
                    "title": "HE CAPITAL ASSET PRICING (CAP) AND RISK BUDGETING -",
                    "content": "Mean variance portfolio theory – Asset returns – Variance as a \n                        risk measure - The one and two fund theorems, The capital market line – CAP as a pricing formula – Systematic and unsystematic \n                        risk – Euler’s theorem – Asset contributions to volatility – beta as a measure of portfolio risk , Limitations of mathematical models in \n                        finance (10)"
                },
                {
                    "title": "Tutorial Practice:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1. David Ruppert, “Statistics and Data Analysis for Financial Engineering”, Springer-Verlag, 2011.",
                "2. Edwin J. Elton, Martin J. Gruber, Stephen J. Brown and William N. Goetzmann “Modern Portfolio Theory and Investment Analysis”,"
            ]
        },
        {
            "code": "23XTO2",
            "title": "PRINCIPLES OF MANAGEMENT AND BEHAVIORAL SCIENCES",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "PRINCIPLES OF MANAGEMENT:",
                    "content": "Meaning, Definition and Significance of Management, Basic Functions of Management – Planning, \n                        Organizing, Staffing, Directing and Controlling. Organizational Environment – Social, Economic, Technological and Political. \n                        Corporate Social Responsibility - Case discussion. (5)"
                },
                {
                    "title": "INDUSTRIAL AND BUSINESS ORGANIZATION:",
                    "content": "of Industries (Small Scale, Medium Scale and Large Scale Industries). \n                        Forms of Business Organizations. Resource Management – Internal and External Sources. (8)"
                },
                {
                    "title": "ORGANIZATIONAL BEHAVIOUR:",
                    "content": "of OB, Impact of culture on organization. Role of leadership and leadership styles. \n                        Personality and Motivational Theories. Attitudes, Values and Perceptions at work - Case discussion.  (8)"
                },
                {
                    "title": "GROUP BEHAVIOUR:",
                    "content": "Group dynamics, Group formation and development, group structure and group cohesiveness. Informal \n                        organization – Sociometry – Interaction analysis – Exercises. (8)"
                },
                {
                    "title": "GLOBALISATION:",
                    "content": "for global competitiveness, proactive and reactive forces of globalization. Cross cultural management –\n                        Management of work force diversity (8)"
                },
                {
                    "title": "HUMAN RESOURCE MANAGEMENT:",
                    "content": "Objectives and Functions, Selection and Placement, Training and Development – Conflict \n                        management – Stress management - Human resource management in global environment - Human resource information system \n                        (HRIS) - Case discussion. (8)"
                },
                {
                    "title": "Tutorial Practice:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1. Harold Koontz, Heinz Weihrich and Ramachandra Aryasri, “Principles of Management”, Tata McGraw Hill, 2004.",
                "2. Mamoria C B, “Personnel Management”, Sultan Chand, 2005."
            ]
        },
        {
            "code": "23XTO3",
            "title": "ENTREPRENEURSHIP",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION TO ENTREPRENEURSHIP:",
                    "content": "– Characteristics and Functions of an Entrepreneur – Common myths about \n                        entrepreneurs – Importance of Entrepreneurship. Creativity and Innovation: The role of creativity – The innovation Process – Sources \n                        of New Ideas – Methods of Generating Ideas – Creative Problem Solving – Entrepreneurial Process (11)"
                },
                {
                    "title": "FORMS OF BUSINESS ORGANIZATION:",
                    "content": "Sole Proprietorship – Partnership – Limited liability partnership - Joint Stock Companies \n                        and Cooperatives. Developing an Effective Business Model: The Importance of a Business Model – Starting a small scale industry -\n                        Components of an Effective Business Model. (9)"
                },
                {
                    "title": "APPRAISAL OF PROJECTS:",
                    "content": "Importance of Evaluating Various options and future investments- Entrepreneurship incentives and \n                        subsidies – Appraisal Techniques. (8)"
                },
                {
                    "title": "FINANCING THE NEW VENTURE:",
                    "content": "Determining Financial Needs – Sources of Financing – Equity and Debt Funding – Case studies \n                        in Evaluating Financial Performance (8)"
                },
                {
                    "title": "THE MARKETING FUNCTION:",
                    "content": "Analysis – Competitor Analysis – Marketing Research for the New Venture – Defining the \n                        Purpose or Objectives – Gathering Data from Secondary Sources – Gathering Information from Primary Sources – Analyzing and \n                        Interpreting the Results – The Marketing Process. Intellectual Property Protection and Ethics: Patents – Copyright - Trademark\u0002Geographical indications – Ethical and social responsibility and challenge (9)"
                }
            ],
            "textbooks": [
                "1. Donald F.Kuratko and Richard M. Hodgetts, “Entrepreneurship”, South-Western, 2003.",
                "2. Vasant Desai, “The Dynamics of Entrepreneurial Development and Management”, Himalaya Publishing House, 2010"
            ]
        },
        {
            "code": "23XTO4",
            "title": "COMPUTATIONAL COMPLEXITY THEORY",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "INTRODUCTION:",
                    "content": "The computational model - Modeling computation and efficiency - Review of Turing machines – Universal Turing \n                        machines – Uncomputable functions – Deterministic time and the class P(5)"
                },
                {
                    "title": "COMPLEXITY CLASSES:",
                    "content": "P, NP, NP Complete, NP-Hard - P vs NP – NP completeness – Relation between NP and NP completeness \n                        – The cook Levin theorem – The web of reductions – Decision vs Search – coNP, EXP and NEXP.(8)"
                },
                {
                    "title": "DIAGONALIZATION:",
                    "content": "Time hierarchy theorem – Space hierarchy theorem – non deterministic time hierarchy theorem – Oracle \n                        machines - Space complexity – Configuration graphs – Some space complexity classes – PSPACE completeness – NL Completeness. (8)"
                },
                {
                    "title": "POLYNOMIAL HIERARCHY AND ALTERNATIONS:",
                    "content": "The classes ∑𝑝2 and 𝜋2𝑝– The polynomial hierarchy – Alternating turing \n                        Machines – Time versus alternations – Defining the hierarchy via oracle machines. (8)"
                },
                {
                    "title": "CIRCUITS –",
                    "content": "Boolean circuits – Karp Lipton theorem – Circuit lower bounds. (2)"
                },
                {
                    "title": "RANDOMIZED COMPUTATION:",
                    "content": "Probabilistic Turing Machines (PTM) –Examples - RP (Randomized Polynomial) , BPP (Bounded \n                        Error probabilistic polynomial) ,Complement Randomized Polynomial (Co-RP) – Probabilistic Polynomial (PP) – Randomized \n                        logarithmic space polynomial time (RL) – Related problems.  (5)"
                },
                {
                    "title": "COUNTING PROBLEMS:",
                    "content": "Counting classes – Complexity of counting problems – An approximate comparison procedure -\n                        Constructing A-Comp - Non-Uniform Classes– Oracles – Relativization.  (6)"
                },
                {
                    "title": "APPLICATIONS -",
                    "content": "decision tree – Pseudo random number generators.  (3)"
                },
                {
                    "title": "Tutorial Practice:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1. Sanjeev Arora, Boaz Barak, “Computational Complexity : A modern approach”, Cambridge University Press, 2012.",
                "2. Goldreich, “Computational Complexity: A Conceptual Perspective”, CUP 2010."
            ]
        },
        {
            "code": "23XTO5",
            "title": "WIRELESS NETWORKS",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "WIRELESS NETWORK OVERVIEW:",
                    "content": "and wireless Networks- Effect of mobility on systems- Introduction to wireless \n                        technologies- RF Overview - Wireless Signal Propagation-Signal-to-Noise Ratio – Modulation - ISM Spectrum - Frequency Hopping \n                        Spread Spectrum (FHSS) - Direct Sequence Spread Spectrum (DSSS)- Orthogonal Frequency Division Multiplexing (OFDM) -\n                        Coordination mechanisms and MAC protocols for multi-user network access. (8)"
                },
                {
                    "title": "WLAN TECHNOLOGIES:",
                    "content": "IEEE 802.11 Standard—WPA (Wi- Fi Protected Access)-WPA2- WEP (wired Equivalence Privacy)- Static \n                        WEP Wireless Architecture- Bluetooth –Zigbee Wireless data networks-Personal Area Networks-GPRS architecture(9)"
                },
                {
                    "title": "AD HOC AND SENSOR NETWORKS:",
                    "content": "Ad hoc Network- Characteristics- Table-driven and On Demand routing protocols, Hybrid \n                        protocols -. Wireless Sensor networks- Classification, MAC and Routing Protocols (6)"
                },
                {
                    "title": "MOBILE NETWORK AND TRANSPORT LAYERS:",
                    "content": "Mobile IP – Dynamic Host Configuration Protocol-Mobile Ad Hoc Routing \n                        Protocols–Multicast routing-TCP over Wireless Networks – Indirect TCP – Snooping TCP – MobileTCP – Fast Retransmit / Fast \n                        Recovery – Transmission/Timeout Freezing-Selective Retransmission – Transaction Oriented TCP- TCP over 2.5 / 3G wireless \n                        Networks (6)"
                },
                {
                    "title": "WIRELESS THREATS AND RISKS:",
                    "content": "breaches on wireless Networks- Eavesdropping-Jamming - RF interference -Covert \n                        wireless channels-Traffic Analysis Spoofing- DOS attack - Malicious Code -Cryptographic threats- Rogue Access Points - MAC \n                        Filtering Attacks - Attack on MiC - RADIUS Vulnerabilities – WPA and 802.1x Vulnerabilities - Attacks on Wireless Gateways (8)"
                },
                {
                    "title": "FUTURE TRENDS:",
                    "content": "Emerging WLAN Related Technologies – 802.16 – 802.20 – 802.22 – UWB, Cognitive Radios, RFID – 4G and \n                        Data Communications Convergence.  (8)"
                },
                {
                    "title": "Tutorial Practice:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1. William Stallings, “Wireless Communication and Networks”, Pearson Education, 2016.",
                "2. Gary. S. Rogers and John Edwards, “An Introduction to Wireless Technology”, Pearson Education, 2012.",
                "3. SivaRam Murthy C and B.S Manoj, “Ad hoc Wireless Networks Architecture and Protocols”, Pearson Education, 2012.",
                "4. Kaveh Pahlavan, Prashant K. Krishnamurthy, “Principles of Wireless Networks : A Unified Approach”, John Wiley, 2011."
            ]
        },
        {
            "code": "23XTO6",
            "title": "COMPUTATIONAL FOUNDATIONS FOR ROBOTICS",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "NTRODUCTION:",
                    "content": "Robots and their applications in industry, mobile and service applications, Configurations of industrial and mobile \n                        robots. Robot controllers, drives, actuators and sensors, Spatial descriptions and Transformations: Positions, orientations and frames, \n                        Mappings, translations, rotations and transformations, transformation arithmetic, Transform equations, representation of orientation, \n                        free vector transformation, Introduction to ROS.  (12)"
                },
                {
                    "title": "FORWARD AND INVERSE KINEMATICS:",
                    "content": "co-ordinates, D-H Representation, Arm equation -Two axis and three axis, robots, \n                        Inverse kinematics of two axis and three axis robots, Maneuverability – Workspace – Control. (15)"
                },
                {
                    "title": "LOCALIZATION AND MAPPING:",
                    "content": "Challenges in mobile robots, Introduction - Bayes filter – Kalman Filter - Extended Kalman Filter - \n                        Information Filter - Histogram Filter - Particle Filter –Localization- Map Representation- Probabilistic Map based Localization-Monte \n                        carlo localization- Landmark based navigation-Globally unique localization- Positioning beacon systems- Route based localization –\n                        Mapping – Metrical maps - Grid maps - Sector maps – Hybrid Maps – SLAM (18)"
                },
                {
                    "title": "DECISION MAKING:",
                    "content": "Discrete planning and dynamic programming principles, Configuration space abstraction, Sampling-based \n                        planners for mobile robots, Feedback-based planning for mobile robots- Feedback in discrete spaces, wave-front functions, Potential \n                        and navigation functions for mobile robots (12)"
                },
                {
                    "title": "PLANNING AND NAVIGATION:",
                    "content": "Overview of the three computational components and their interaction, sensing, planning, and control \n                        - Global path planning – A* Algorithm - local path planning - Road map path planning- Cell decomposition path planning-Potential field \n                        path planning-Obstacle avoidance – Path control. Markov Decision Process (MDP) in discrete spaces, optimal control and steering \n                        methods- Nonlinear optimization and gradient methods.  (15)"
                },
                {
                    "title": "FUTURE TRENDS:",
                    "content": "Emerging WLAN Related Technologies – 802.16 – 802.20 – 802.22 – UWB, Cognitive Radios, RFID – 4G and \n                        Data Communications Convergence.  (8)"
                },
                {
                    "title": "Tutorial Practice:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1. John J. Craig, Introduction to Robotics: Mechanics and Control, Pearson Education Company, 2008",
                "2. Steven M. LaValle, Planning Algorithms, Cambridge University Press, 2006",
                "3. Howie Choset, Kevin M. Lynch, Seth Hutchinson, George A. Kantor, Wolfram Burgard, Lydia E. Kavraki, Sebastian Thrun, Principles"
            ]
        },
        {
            "code": "23XTO7",
            "title": "GEOMETRY FOR GRAPHICS",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "Introduction:",
                    "content": "Coordinate systems – Cartesian, Polar, Cylindrical and spherical, Points, lines, angles, simple closed curve, Polygon, \n                        polyhedron, platonic solids. Vector space, basis, Dimension, change of basis, norm, linear transformations. (2)"
                },
                {
                    "title": "Euclidean Geometry:",
                    "content": "Axiomatic system, Euclid’s postulates. Euclidean transformation, Isometry - Translation, scaling, reflection. \n                        Euclidean-Congruence of triangles, Triangle angle sum, Pythagorean Theorem (9)"
                },
                {
                    "title": "Conics:",
                    "content": "Degenerate and non-degenerate conics. Circles, Orthogonal Circles, Thales' theorem, Circles through Two Points. Parabola, \n                        Ellipse, hyperbola, rectangular hyperbola. Polar Equation of a Conic. Properties of Conics – Tangent, normal, reflection. Quadric \n                        Surfaces in R3,classifications,ruled surface in R3 - Hyperboloid of One Sheet, Hyperbolic Paraboloid.(18)"
                },
                {
                    "title": "Affine Geometry:",
                    "content": "Affine Transformations, affine properties, Images of Sets, parallel projection, Properties. Ellipse - Midpoint Theorem, \n                        Conjugate Diameters Theorem, Fundamental Theorem of Affine Geometry, Barycentric Coordinates - Section Formula. Classifying \n                        Non-Degenerate Conics. (9)"
                },
                {
                    "title": "Projective Geometry-Lines:",
                    "content": "Perspectivity, Desargues’ Theorem. Projective Points, Projective Plane RP2\n                        - Projective Lines, \n                        Collinearity Property, Incidence Property. Embedding Planes, projective transformation – properties, Fundamental Theorem of \n                        Projective Geometry. Perspectivity Theorem.   (9)"
                },
                {
                    "title": "Projective Geometry-Conics:",
                    "content": "Projective Conic- standard form, Parametrization Theorem, Tangents to Projective Conics, Eccentricity \n                        Formula, Plane Sections of a Right Circular Cone, Three Tangents Theorem, Tangents to Plane Conics.  (7)"
                },
                {
                    "title": "Tutorial Practice:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1. David A Brannan, Matthew F Esplen, Jeremy J Gray, Geometry, Cambridge University Press, 2017.",
                "2. Ray C. Jurgensen, Richard G. Brown, John W. Jurgensen, Geometry, McDougal Littell - A Houghton Mifflin Company, 2000"
            ]
        },
        {
            "code": "23XTO8",
            "title": "DIGITAL TOPOLOGY",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "TOPOLOGICAL SPACES AND CONTINUOUS FUNCTIONS:",
                    "content": "Topological spaces, basis for a topology, subspace topology, order \n                        topology, closed sets and limit points, Hausdroff spaces, product topology, metric topology, continuous functions (12+9)"
                },
                {
                    "title": "CONNECTEDNESS AND SEPARATION AXIOMS:",
                    "content": "spaces, connected sub sets of the real line, local connectedness, \n                        compact spaces, locally compact spaces, separation axioms- Regular, normal spaces (8+5)"
                },
                {
                    "title": "AXIOMATIC APPROACH TO DIGITAL TOPOLOGY:",
                    "content": "Axioms of Digital Topology, Relation between the suggested and classical \n                        Axioms, deducing the properties of Axiomatic Locally Finite spaces from the axioms.(7+4)"
                },
                {
                    "title": "DIGITAL SPACES:",
                    "content": "Definitions, interiors, exterior, connectedness in digital spaces, isomorphism between digital spaces.. Digital \n                        Plane- Definition, Jordan curve theorem, graph of 4- and 8- topologies, line complex and cellular complex(8+5)"
                },
                {
                    "title": "ABSTRACT CELL COMPLEXES:",
                    "content": "Topology of complexes, Cartesian complexes and combinatorial coordinates, AC complexes \n                        compared with other Locally Finite Spaces.  (10+7)"
                }
            ],
            "textbooks": [
                "1. James R. Munkres, ‘Topology- A First Course’, Pearson, 2018.",
                "2. Reinhard Klette , Azriel Rosenfeld,’ Digital Geometry: Geometric methods for Digital Picture Analysis’, Morgan",
                "4. Vladimir A. Kovalevsky, ‘Geometry of Locally Finite Spaces: Computer Agreeable Topology and Algorithms for Computer"
            ]
        },
        {
            "code": "23XTO9",
            "title": "ENVIRONMENTAL SCIENCE AND GREEN COMPUTING",
            "course_type": "open_elective",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "NATURAL RESOURCES, ECOSYSTEMS AND BIODIVERSITY:",
                    "content": "Environment, Definition, Scope and importance, Forest resources, \n                        Use and overexploitation, Water resources: Use and over utilization. Eco system; Structure and functions of an eco-system, energy \n                        flow in the eco system. Bio Diversity; values of biodiversity, biodiversity at global, national and local levels – threats to bio diversity. \n                        Conservation of bio diversity – In-situ & Ex-situ conservation.(9)"
                },
                {
                    "title": "ENERGY SOURCES:",
                    "content": "energy needs, Renewable and non-renewable energy sources, Hydro power, Solar Power: \n                        Photovoltaic Energy – Motivation for going Solar – Solar Electricity – PV cells. Wind Power: – Using the Wind: Generating Power at \n                        Remote Sites – Measuring the Wind – Estimating the output. Use of alternate energy sources.  (9)"
                },
                {
                    "title": "SOCIAL ISSUES AND THE ENVIRONMENT:",
                    "content": "From unsustainable to sustainable development, Urban problems related to energy, \n                        Water conservation, Rain water harvesting, Watershed management, Environment and human health, Role of information technology\n                        in environment and human health. Environment Protection Act: Air (Prevention and Control of Pollution) Act – Water Act, Forest \n                        Conservation Act, Wildlife Protection Act, Introduction to EIA and ISO 14000. (9)"
                },
                {
                    "title": "ENVIRONMENTAL POLLUTION AND DISASTER MANAGEMENT:",
                    "content": "Definition – causes, effects and control measures of air pollution, \n                        water pollution, soil pollution, noise pollution, thermal pollution and nuclear hazards. Disaster management - floods, earthquake, \n                        cyclone and landslides. Solid waste management - causes, effects and control measures of municipal solid wastes (Biomedical wastes, \n                        hazardous wastes). Role of an individual in prevention of pollution. (9)"
                },
                {
                    "title": "GLOBAL ATMOSPHERIC CHANGE & GREEN FUNDAMENTALS:",
                    "content": "The Atmosphere of Earth – Global Temperature – Global Energy \n                        Balance, The Greenhouse Effect - Environmental Issues and Green Computing, Electronic waste management: Introduction;-\n                        Environment and society, producer responsibility legislation – the Waste Electrical and Electronic Equipment (WEEE) directive, \n                        Materials Composition of WEEE: Mobile Phones – Television – Washing Machines, - Current and new electronic waste recycling \n                        technology- Future perspectives of electronic scrap.  (9)"
                },
                {
                    "title": "Tutorial:",
                    "content": ""
                }
            ],
            "textbooks": [
                "1. Mackenzie L. Davis, and David A. Cornwell, “Introduction to Environmental Engineering”, Tata McGraw Hill, New Delhi, 2010",
                "2. Chetan Singh Solanki, “Solar Photovoltaics”, PHI, 2011.",
                "3. Siraj Ahmed, “Wind Energy : Theory and Practice”, PHI, 2011.",
                "4. Mahajan S. P. Pollution Control in Process Industries, Tata McGraw Hill, 1985.",
                "5. R. E. Hester and R. M. Harrison, “Electronic Waste Management”, Royal Society of Chemistry, 2009."
            ]
        },
        {
            "title": "23XTOA FUNCTIONAL ANALYSIS",
            "credits": "3 2 0 4",
            "content": [
                {
                    "title": "METRIC SPACES:",
                    "content": "Definition, examples, open and closed sets, neighborhood, compact sets, convergence, Cauchy sequence, \n                        completeness, completion of metric spaces.(12+8)"
                },
                {
                    "title": "BANACH SPACE:",
                    "content": "Normed spaces, Banach space - Definition, examples, properties, finite dimensional normed spaces and \n                        subspaces, compactness and finite dimension. (8+6)"
                },
                {
                    "title": "LINEAR OPERATORS:-",
                    "content": "Definition and examples, bounded and continuous linear operators, linear functional on finite dimensional \n                        spaces, normed spaces of operators, Hahn Banach theorem, open mapping theorem, closed graph theorem (12+8)"
                },
                {
                    "title": "HILBERT SPACE:",
                    "content": "Inner product space, Hilbert space –Definition and examples, properties of inner product space, orthogonal \n                        complements, orthogonal sets and sequence, orthonormal sets and sequence, series corresponding to orthonormal sequences \n                        Bessel’s inequality(13+8)"
                }
            ],
            "textbooks": [
                "1. Erwin Kreyszig, “Introductory Function Analysis with Applications”, John Wiley , 2007.",
                "2. George F Simmons, “Introduction to Topology and Modern Analysis”, Tata Mc-Graw Hill, 2017."
            ]
        }
    ],
    "url": "https://amcsregulations.psgtech.ac.in/curriculum/tcs/2023/tcs2023.html",
    "coordinator": "Dr.Poonthalir G"
}